export const effarigQuotes = {
  initial: {
    id: 0,
    lines: [
      "Добро пожаловать в мою скромную обитель.",
      "Меня зовут Эффариг, и я управляю глифами.",
      "Я, в отличие от Терезы, не примитивен, как ты мог(ла) подумать.",
      "Я использую осколки глифов для исполнения своей воли.",
      "Я собираю их ради моего края.",
      "Чего же ты ждёшь? Начинай.",
    ]
  },
  unlockWeights: {
    id: 1,
    lines: [
      "Как тебе мой магазинчик? Пусть он невелик, зато он мой."
    ]
  },
  unlockGlyphFilter: {
    id: 2,
    lines: [
      "Это приобретение тебя выручит."
    ]
  },
  unlockSetSaves: {
    id: 3,
    lines: [
      "Не чересчур ли много ты купил(а)? Мне кажется, чересчур."
    ]
  },
  unlockRun: {
    id: 4,
    lines: [
      "Ты скупил(а) весь мой запас… что ж, по крайней мере, теперь я богат.",
      "Суть моей Реальности в страданиях. С каждым слоем она всё труднее.",
      "Надеюсь, ты никогда её не выполнишь.",
    ]
  },
  completeInfinity: {
    id: 5,
    lines: [
      { text: "Вы выполнили Реальность Эффарига на слое бесконечности.", showCelestialName: false },
      "Это был всего лишь первый рубеж. Дальше будет только хуже.",
      "Никто, кроме меня, не знает так хорошо мои владения, чтобы продвинуться дальше.",
    ]
  },
  completeEternity: {
    id: 6,
    lines: [
      { text: "Вы выполнили Реальность Эффарига на слое вечности.", showCelestialName: false },
      "Ты достиг(ла) предела. Даже не думай переступить через эту границу.",
      "Тебе не хватит жизни, чтобы выполнить Реальность до конца.",
      "Я просто подожду, пока ты не будешь вынужден(а) отступить.",
    ]
  },
  completeReality: {
    id: 7,
    lines: [
      { text: "Вы выполнили Реальность Эффарига на слое реальности.", showCelestialName: false },
      "Так вот что за дьявольская сила… что напугало других…",
      "Ты думаешь, оно того стоило? Растоптать плоды моего труда?",
      "И ради какой цели? Мы могли бы дружить, сотрудничать.",
      "Но нет. Это конец. Уходи, пока я пытаюсь удержаться за то, что осталось.",
    ]
  }
};
