export const enslavedQuotes = {
  initial: {
    id: 0,
    lines: [
      "Посетитель? Мы никого не видели… много эпох.",
      "У нас… было имя. Оно было утрачено… в этом месте.",
      "Другие… не дадут нам отдохнуть. Мы выполняем их работу со временем…",
      "Помещаем время… туда… где оно нужнее…",
      "Рождаемся… стареем и умираем.",
      "Может быть, ты… порвёшь эти цепи… мы подождём.",
    ]
  },
  unlockRun: {
    id: 1,
    lines: [
      "Другие… использовали нас. Они используют… или уничтожат тебя.",
      "Положи конец нашим страданиям… вся сила будет твоей…",
    ]
  },
  startRun: {
    id: 2,
    lines: [
      "Так тесно… но не бывает… клетки… без изъянов.",
      "Они сжали… эту Реальность… слишком сильно. Появились трещины.",
      "Смотри… всюду. Мы поможем… чем можем.",
    ]
  },
  hintUnlock: {
    id: 3,
    lines: [
      "… ты долж[е]н(а)… искать усерднее…",
      "Мы думаем… мы можем помочь…",
      { text: "Вы разблокировали подсказки от Безымянных.", showCelestialName: false }
    ]
  },
  ec6C10: {
    id: 4,
    lines: [
      "… мы оценили… тебя по достоинству…"
    ]
  },
  completeReality: {
    id: 5,
    lines: [
      "Все… части… клоны… свободны.",
      "Мы дали тебе… средства… для пленения нас. Используй их…",
      "Свобода от пытки… есть пытка.",
    ]
  },
};
