export const teresaQuotes = {
  initial: {
    id: 0,
    lines: [
      "Мы наблюдали за тобой.",
      "Твоё обращение с реальностями выглядит многообещающе.",
      "Мы Небожители, и мы хотим, чтобы ты к нам присоединил(ась)[ся].",
      "Меня зовут Тереза, и я Небожитель Реальности.",
      "Докажи своё достоинство.",
    ]
  },
  unlockReality: {
    id: 1,
    lines: [
      "Я впущу тебя в свою Реальность, смертн(ая)[ый]. Смотри, чтобы она тебя не убила."
    ]
  },
  completeReality: {
    id: 2,
    lines: [
      "Почему ты ещё здесь... ты долж[е]н(а) был(а) потерпеть неудачу."
    ]
  },
  effarig: {
    id: 3,
    lines: [
      "Ты всё ещё недосто(йна)[ин] быть одн(ой)[им] из нас.",
      "Надеюсь, другие смогут сделать то, что не смогла я."
    ]
  }
};
