<script>
export default {
  name: "AutomatorDocsIntroPage",
};
</script>

<template>
  <div>
    Добро пожаловать в Автоматизатор Измерений Антиматерии!
    <br>
    <br>
    Это вводная страница, дающая общий обзор всего, что можно делать с Автоматизатором.
    Подробности по определённой функциональности могут быть найдены в помощи по игре или, в некоторых случаях, на соответствующих страницах Автоматизатора.
    <br>
    <br>
    <b>Язык программирования:</b> Автоматизатор использует особый язык программирования, чтобы совершать определённые действия в игре.
    Нажмите кнопку <div class="fas fa-list c-automator-button-icon" /> для просмотра списка доступных команд. Вы также можете
    определять постоянные, служащие сокращениями определённых значений, на странице
    <div class="fas fa-book c-automator-button-icon" />.
    <br>
    <br>
    <b>Интерфейс</b> Автоматизатора разделён на две половины; левая половина содержит поле программы и кнопки
    для запуска, остановки и перезапуска программы, а правая - информацию об Автоматизаторе. Вы можете нажать кнопку
    <div class="fas fa-expand-arrows-alt c-automator-button-icon" /> в правом верхнем углу, чтобы переключить Автоматизатор
    в полноэкранный режим для удобства редактирования.
    <br>
    <br>
    <b>Режимы редактирования:</b> Существуют два режима, в которых вы можете редактировать программы для Автоматизатора: блочный
    (по умолчанию) и текстовый. Вы можете переключаться между режимами редактирования с помощью кнопки в
    правом верхнем углу левой половины интерфейса. Заметьте, что программы, содержащие ошибки, могут быть неправильно преобразованы для другого режима,
    что может привести к потере части программы. Команды в текстовом режиме вводятся на английском языке, в то время как блоки
    переведены на русский язык вместе с их параметрами.
    <br>
    <br>
    <b>Управление программами:</b> Вы можете переключаться между несколькими программами или создавать новые с помощью раскрывающегося списка во
    втором ряду кнопок. Текущая программа может быть переименована или удалена с помощью кнопок
    <div class="fas fa-edit c-automator-button-icon" /> и
    <div class="fas fa-trash c-automator-button-icon" /> соответственно. У Автоматизатора всегда будет хотя
    бы одна программа; при удалении последней будет автоматически создана пустая программа.
    <br>
    <br>
    <b>Редактирование программ:</b> в блочном режиме программы составляются из блоков с панели
    <div class="fas fa-cubes c-automator-button-icon" />, а в текстовом режиме программы вводятся в
    левую половину. В обоих режимах редактирования вы также можете генерировать маленький блок кода
    по шаблону из страницы <div class="fas fa-file-code c-automator-button-icon" />. Вы можете отменять и возвращать ограниченное
    количество изменений соответственно с помощью кнопок <div class="fas fa-arrow-rotate-left c-automator-button-icon" /> и
    <div class="fas fa-arrow-rotate-right c-automator-button-icon" /> или соответствующих горячих клавиш. Журнал изменений
    очищается при переключении на другие программу или режим редактирования или удалении программы.
    <br>
    <br>
    <b>Отладка:</b> Два главных инструмента, данных вам для отладлки ваших программ, - это журнал ошибок
    <div class="fas fa-exclamation-triangle c-automator-button-icon" />, используемый, когда ваша программа отказывается работать
    совсем, и журнал событий <div class="fas fa-eye c-automator-button-icon" />, используемый, когда программа работает, но не так, как вы
    ожидаете.
    <br>
    <br>
    <b>Импорт и экспорт</b> программ для Автоматизатора в текстовой кодировке осуществляется с помощью кнопок
    <div class="fas fa-file-export c-automator-button-icon" /> и
    <div class="fas fa-file-import c-automator-button-icon" /> соответственно. Вам также доступны
    расширенные возможности экспорта на странице <div class="fas fa-window-restore c-automator-button-icon" />.
    <br>
    <br>
    <b>Хранение программ:</b> изменения к программам не всегда сразу сохраняются на ваш компьютер;
    см. подробности в статьях помощи по игре об Автоматизаторе. Кроме того, есть два ограничения на количество символов в программах,
    показанных прямо над интерфейсом Автоматизатора.
  </div>
</template>

<style scoped>
.c-automator-button-icon {
  padding: 0.3rem 0.8rem;
  width: 3.3rem;
  border: var(--var-border-width, 0.2rem) solid var(--color-automator-controls-border);
  border-radius: var(--var-border-radius, 0.3rem);
  color: var(--color-automator-docs-font);
  background-color: var(--color-automator-controls-inactive);
}
</style>
