<script>
import ModalWrapper from "@/components/modals/ModalWrapper";
import PrimaryButton from "@/components/PrimaryButton";

export default {
  name: "PelleEffectsModal",
  components: {
    PrimaryButton,
    ModalWrapper,
  },
  computed: {
    nerfs() {
      return [
        // Numerical nerfs and disabled boosts
        "Всё, что разблокируется Улучшениями Пелля, не может быть разблокировано обычным способом",
        "Все множители к получению ОБ и ОВ, разблокированные до Обречения, отключены",
        "Улучшение Бесконечности, производящее ОБ, отключено",
        "Все множители к скорости репликации, разблокированные до Обречения, отключены",
        `Рост Репликанти после ${format(Number.MAX_VALUE, 2)} замедляется ещё сильнее`,
        "У большинства Испытаний Вечности повышены цели",
        `Все галактики на ${formatPercents(0.5)} слабее`,
        `Множители Измерений Антиматерии в ${formatInt(10)} раз меньше`,
        "Множитель достижений и многие награды за достижения отключены",
        "Все множители к получению бесконечностей и вечностей и их производство отключены",
        `Вы получаете в ${formatInt(100000)} раз меньше Замедленного Времени`,
        "Чёрные Дыры отключены",
        `Улучшение Реальности "Временная Трансцендентность" отключено`,

        // Initial QoL and automation
        "Все эффекты, кроме награды за достижение 21, увеличивающие начальное количество ресурсов, отключены",
        "Все эффекты, предотвращающие сброс ресурсов, отключены",
        "Навыки ТИБ и ТЗВ отключены",
        "Автоматическое выполнение Испытаний Бесконечности и Вечности отключено",
        "Автоматика Теорем Времени отключена",
        "Вся автоматика механик, разблокированных не ранее Замедления Времени, отключена",

        // Time studies + Dilation
        "Улучшение Вечности, зависящее от времени игры, вместо этого зависит от времени текущего армагеддона",
        `Все множители к получению Замедленного Времени, разблокированные до Обречения, кроме удвоителя ЗВ, отключены`,
        "Все множители к получению Тахионов отключены",
        "Все производители Теорем Времени, разблокированные до Обречения, кроме соответствующего Улучшения Замедления, отключены",

        // Glyphs
        "Активация глифов невозможна, до тех пор пока она не будет разрешена Пеллем",
        `Фактические уровни глифов понижены, а их редкость выставлена на ${formatPercents(0)}`,
        "Эффекты от Пожертвования и Расширения Глифов и алхимических ресурсов отключены",

        // Celestial features
        "Нельзя запускать Реальности других Небожителей",
        "Покупать музыкальные глифы нельзя",
        "Награды за все слои Реальности Эффарига отключены",
        "Все механики, связанные с хранением времени, отключены",
        "Все этапы Ви отключены",
        `Эффект от ${formatInt(1)}-го уровня Терезы отключён`,
        "Заряжать Улучшения Бесконечности нельзя",
        "Ваши Теоремы Пространства конфискованы",
        "Мнимые Улучшения, кроме тех, которые разблокируют ИТМ и Небожителей, отключены",
        "Эффект от континуума и Этапы Сингулярности отключены"
      ];
    }
  }
};
</script>

<template>
  <ModalWrapper>
    <template #header>
      Условия Обречённой Реальности
    </template>
    <div class="pelle-effects-container">
      <p
        v-for="(nerf, idx) in nerfs"
        :key="idx"
      >
        {{ nerf }}
      </p>
    </div>
    <PrimaryButton
      class="o-primary-btn--width-medium c-modal-message__okay-btn c-modal__confirm-btn"
      @click="emitClose"
    >
      OK
    </PrimaryButton>
  </ModalWrapper>
</template>

<style scoped>
.pelle-effects-container {
  overflow-y: scroll;
  height: 40rem;
}

p {
  margin-bottom: 1rem;
}
</style>
