import { DC } from "../constants";

// A = always there
// L = locked
// R = random chance condition
// P = patreon
// AI = created with gpt2

function newsAnimSpd(seconds) {
  return seconds / player.options.news.speed;
}


export const news = [
  {
    id: "a1",
    text: "Печенька - ложь.",
  },
  {
    id: "a2",
    text: "Эта новость не останавливается на этой станции. Пожалуйста, дождитесь следующей новости."
  },
  {
    id: "a3",
    text: "Человечество отказалось от атомных электростанций в пользу энергии антиматерии."
  },
  {
    id: "a4",
    text: "Доказано, что печенья из антиматерии не существует, кто бы ни утверждал обратное, прекратите."
  },
  {
    id: "a5",
    text: "Цены на антиматерию рухнули благодаря открытому недавно обильному источнику."
  },
  {
    id: "a6",
    text: "Сегодня в новостях: люди пожертвовали животное из антиматерии богу антиматерии."
  },
  {
    id: "a7",
    text: "Вы произвели одну единицу антиматерии! Что бы это ни значило."
  },
  {
    id: "a8",
    text: "Установите новостную строку как приложение и узнавайте свежие новости без подключения к интернету!"
  },
  {
    id: "a9",
    text: "Так, что делает кнопка M?"
  },
  {
    id: "a10",
    text: "Как отключить новости?"
  },
  {
    id: "a11",
    text: "Учёные подтверждают, что цвет антиматерии - серо-буро-малиновый."
  },
  {
    id: "a12",
    text: "Человек, которому подвластны сами пространство и время, не придумал ничего, кроме как обратиться жирафом! Да, жирафом, ёлки-иголки! Такой комедии я ещё не видал."
  },
  {
    id: "a13",
    text:
      `Электроны начали видеть в жизни позитив.
      Мы будем называть такие позитивные электроны "позитронами". Погодите, разве уже есть такое слово?`
  },
  {
    id: "a14",
    text:
      `Эта совершенно бесполезная новость ни к чему вас не приведёт, и вы это знаете.
      Какой ужасный, несносный человек её придумал, он, возможно, попадёт в ад,
      и зачем только разработчик её добавил? Даже если продолжить её читать, вы не
      сможете прочитать её целиком (с первого раза).`
  },
  {
    id: "a15",
    text: `"ПРИВИДЕНИЕ ПРИВЕТСТВУЕТ" - Boo-chan`
  },
  {
    id: "a16",
    text: `"Кто-нибудь может попросить hevi успокоиться?" - Mee6`
  },
  {
    id: "a17",
    text: "Из-за влияния антиматерии на физику один лось стал человеком."
  },
  {
    id: "a18",
    text: "!hi"
  },
  {
    id: "a19",
    text: `"Ладно" - Alright`
  },
  {
    id: "a20",
    text: "Английское приветствие отсутствует в речи антиматерии."
  },
  {
    id: "a21",
    text: "Купить всё или не купить всё - вот в чём вопрос."
  },
  {
    id: "a22",
    text: "Раз, два, несколько, девяносто девять, NaN!"
  },
  {
    id: "a23",
    text: "Нет, мама, я не могу поставить эту игру на паузу."
  },
  {
    id: "a24",
    text: "Научная нотация вышла на поле боя."
  },
  {
    id: "a25",
    text: `"Сделаем Вселенную снова великой!" - Трональд Дамп`
  },
  {
    id: "a26",
    text: "#dank-maymays"
  },
  {
    id: "a27",
    get text() {
      return `Появилась новая религия, распространяющаяся со скоростью лесного пожара. Исповедующие эту религию поклоняются
        Небесной Пелле, богине антиматерии. Кроме того, они считают, что ${format(Number.MAX_VALUE, 2)}
        - это бесконечность.`;
    }
  },
  {
    id: "a28",
    text: "Кто-то только что коснулся кляксы и взорвался. Это клякса была сделана из антиматерии или взорванный - из взрывчатки?"
  },
  {
    id: "a29",
    text: `Если этот сайт имеет адрес, отличный от https://googolplexo1.github.io/AntimatterDimensionsSourceCode/,
          это подозрительно.`
  },
  {
    id: "a30",
    text: "Поставьте игре 5 звёзд на Kongregate, чтобы больше людей могло испытать эту 5-звёздочную оценку."
  },
  {
    id: "a31",
    text: "\"Ну, не знаю, просто я не доверяю автоматике 5-го Измерения.\" - kajfik"
  },
  {
    id: "a32",
    text: `"Вы слишком долго ели." - Hevipelle`
  },
  {
    id: "a33",
    text: `"Я ненавижу себя." - Boo-chan`
  },
  {
    id: "a34",
    text: `"Боже мой" - Xandawesome`
  },
  {
    id: "a35",
    text: "Над нами нет ничего, кроме звёзд над нами."
  },
  {
    id: "a36",
    text: "Вы хотите производить антиматерию. Но никто не хочет есть вашу антиматерию."
  },
  {
    id: "a37",
    text: "Кто-то плохо вёл себя, и на него обрушился шторм из антиматерии."
  },
  {
    id: "a38",
    text: "Времена меняются, и мы меняемся вместе с ними."
  },
  {
    id: "a39",
    text: "Я слишком быстро нажимал… Теперь мой ПК дематериализован."
  },
  {
    id: "a40",
    text:
      `"Если инопланетянин приземлится на лужайке перед вашим домом и протянет придаток в знак приветствия, прежде чем
      подружиться с ним, бросьте ему шар с восьмёркой. Если придаток взорвётся, то, возможно, инопланетянин состоял из антиматерии.
      Иначе вы можете показать его главе вашего государства." - Нил Деграсс Тайсон`
  },
  {
    id: "a41",
    text:
      "Материи всегда должно быть столько же, сколько антиматерии; видимо, твоя мать заботится об этом равновесии."
  },
  {
    id: "a42",
    text: "Ничего не теряется, ничего не создаётся."
  },
  {
    id: "a43",
    text: "Мы вырыли большую яму для хранения антиматерии… а Адель скатывается в неё."
  },
  {
    id: "a44",
    text: "Если всё вокруг состоит из антиматерии, как мы видим себя?"
  },
  {
    id: "a45",
    text: "Фондовые рынки обвалились из-за того, что существа из антиматерии как-то узнали о том, чем они будут завтра."
  },
  {
    id: "a46",
    text: "Мой пёс съел слишком много антиматерии, и теперь он мяукает!"
  },
  {
    id: "a47",
    text: "Если ввести бесконечность в калькулятор, будет 42!"
  },
  {
    id: "a48",
    text: "Вы нашли самую редкую Пепе из антиматерии, она очень редкая!"
  },
  {
    id: "a49",
    get text() {
      return `Сможем ли мы набрать ${format(1e169)} лайков под этим видео??? Жмите большой палец вверх!!`;
    }
  },
  {
    id: "a50",
    text: "Запах антиматерии был выявлен. Она пахнет котятами."
  },
  {
    id: "a51",
    text: "Просто ещё одна единица антиматерии в стене."
  },
  {
    id: "a52",
    text: "ВОТ ТЕБЕ ПУЛИ, СЛАБАК"
  },
  {
    id: "a53",
    text: `"Большое спасибо" - Dankesehr`
  },
  {
    id: "a54",
    text: "Ситуация в мире - бедствие для всего мира!! MAYDAY, MAYDAY!!"
  },
  {
    id: "a55",
    text:
      `"Как то, что солнце встаёт на западе, несомненно то, что из всех певцов и
      поэтов на земле я самый лучший." - Hevipelle`
  },
  {
    id: "a56",
    text: `"Я хорошо умею использовать github." - Hevipelle`
  },
  {
    id: "a57",
    text:
      `Это предложение не имеет никакого
      отношения к игре… или всё-таки имеет?`
  },
  {
    id: "a58",
    text:
      `Недавно было проведено исследование, установившее связь потребления картофеля с повышенным риском взрыва антиматерии.
      Учёные рекомендуют увеличить потребление.`
  },
  {
    id: "a59",
    text: `"Я думал, что устранил эту ошибку, но, видимо, одно из обновлений возвратило её." - Hevipelle`
  },
  {
    id: "a60",
    text: `"Тогда, может быть, я голубой." - Bootato`
  },
  {
    id: "a61",
    text: `Срочные новости! Hevipelle только что объявил, что кнопка "Купить всё" на самом деле будет удалена!`
  },
  {
    id: "a62",
    text: "Я посвящаю эту игру своей девушке."
  },
  {
    id: "a63",
    text:
      `Ружья из антиматерии не убивают людей из антиматерии, люди из антиматерии убивают людей из антиматерии, но значит ли это,
      что тостер из антиматерии не поджаривает тосты из антиматерии, тост из антиматерии поджаривает тосты из антиматерии?`
  },
  {
    id: "a64",
    text: "Но не будет ли человек из антиматерии считать себя состоящим из материи, а нас - из антиматерии?"
  },
  {
    id: "a65",
    text: "Вы серьёзно считаете, что все предлагаемые вами новости попадут в игру?"
  },
  {
    id: "a66",
    text:
      `Начало учёбы вселяет страх в школьников по всей Вселенной, так как школы больше не разделены между
      материей и антиматерией. Аннигиляция становится важной проблемой.`
  },
  {
    id: "a67",
    text: "Почему никто не говорит о 0-м Измерении?"
  },
  {
    id: "a68",
    text: "Разработчики хотели бы пояснить, что по сюжету игры материя уже искоренена из Вселенной."
  },
  {
    id: "a69",
    text: "Мне скучно. Кому нужен новый слой престижа?"
  },
  {
    id: "a70",
    text: "Если вы не можете прочесть это сообщение, вы отключили новости."
  },
  {
    id: "a71",
    text: "Не покидает сервер, а лишь заглушает его, чтобы не получать уведомлений."
  },
  {
    id: "a72",
    text: `"Цитаты, встречающиеся в интернете, как правило, приписаны не тем авторам." - Владимир Ленин`
  },
  {
    id: "a73",
    text: `"Теперь это должно работать, но не работает." - Hevipelle`
  },
  {
    id: "a74",
    text: "В этой игре нет ошибок… это альтернативные пути к успеху."
  },
  {
    id: "a75",
    text:
      `Был открыт третий тип вещества: нулевая материя. Она ничего не делает и, по сути,
      бесполезна. Открывшие её учёные были уволены.`
  },
  {
    id: "a76",
    text: "Твоя тёща продолжает ворчать на тебя насчёт всех этих коллайдеров антиматерии."
  },
  {
    id: "a77",
    text: "Если материя существует, то, значит, антиматерии не существует?"
  },
  {
    id: "a78",
    text: "Антиматерия=Жизнь. Не булыжник, не грязь, ничего подобного. Антиматерия."
  },
  {
    id: "a79",
    text: "\"Это не цитата.\""
  },
  {
    id: "a80",
    text: "В недрах антитундры выдры в антигетрах тырят в антивёдра ядра антикедров."
  },
  {
    id: "a81",
    text: `"Измерения Антиматерии 2": ожидайте через 5 дней!`
  },
  {
    id: "a82",
    text: `"Это потому, что я хороший разработчик игр, внедривший код, который точно работает." - Hevipelle`
  },
  {
    id: "a83",
    text: `"Ради этой игры я забросил школу." - hevipelle`
  },
  {
    id: "a84",
    text: "Не раздражает ли вас, когда люди не оканчивают свои"
  },
  {
    id: "a85",
    text: "Не антиссылайся на мои слова."
  },
  {
    id: "a86",
    text: 
      `Lorem ipsum dolor sit amet pri simul tempor oblique ei aeque prompta te duo in est commodo persius
      graecis integre petentium iudicabit et eum et per dico idque mei ei eleifend complectitur ei sea nisl
      expetendis omittantur novum primis suscipit ne est consulatu definiebas sea cu vocent prodesset
      scribentur est ne ea aperiam labitur omnesque per impetus repudiare et has his ad odio paulo
      lobortis eu sea vide everti usu ex legendos patrioque quo te hinc sadipscing adversarium nullam
      nostrum deserunt in vix ne cum eros iisque argumentum vel luptatum imperdiet in reque perfecto cum ex
      cum ei tempor quidam persequeris aperiam epicurei vix no euripidis definitionem has ut eu mea
      invenire explicari per vitae scaevola ut Ius solet sadipscing ne at per error facilisi ei eos putant
      scriptorem mei id summo concludaturque quo cu velit adolescens rationibus te quot fabellas
      disputationi nec eu fugit quando malorum eum id usu quidam omittam vituperatoribus in impetus dolorem
      qui te elitr integre intellegebat sea sumo exerci feugait ne est te verear epicuri mea affert
      democritum mel et at vix mollis sensibus an sed labitur consulatu aliquando aim quis dolores te
      viderer assentior mei an id choro ceteros mea te nihil probatus invenire qui eum id efficiantur
      accommodare vim alia latine recteque ei duis postulant sententiae quo te.`
  },
  {
    id: "a87",
    text:
      `Согласно никаким из известных законов авиации, быть поглощённой антиматерией пчела
      ещё как может.`
  },
  {
    id: "a88",
    text: "Ты либо умираешь, состоя из материи, либо живёшь до тех пор, пока тебя не поглотит антиматерия, и всё равно умираешь."
  },
  {
    id: "a89",
    text: "Если ты долго смотришь в антиматерию, то антиматерия тоже смотрит в тебя."
  },
  {
    id: "a90",
    text: `"Всегда буду бросать тебя. Всегда буду подводить тебя." - Антирик Эстли`
  },
  {
    id: "a91",
    text: `"Измерения Антиматерии": следующее обновление всегда через 5 часов. Всегда.`
  },
  {
    id: "a92",
    get text() {
      const games = [
        {
          name: "Antimatter Dimensions",
          link: "https://ivark.github.io/"
        },
        {
          name: "FE000000",
          link: "https://dan-simon.github.io/misc/fe000000/"
        },
        {
          name: "Trimps",
          link: "https://trimps.github.io/"
        },
        {
          name: "Mine Defense (в протоколе https интерфейс игры не работает, так что убедитесь, что вы используете http!)",
          link: "http://scholtek.com/minedefense"
        },
        {
          name: "Wizard and Minion Idle",
          link: "https://www.kongregate.com/games/Oninou/wami"
        },
        {
          name: "Anti-Idle",
          link: "https://www.kongregate.com/games/Tukkun/anti-idle-the-game"
        },
        {
          name: "Synergism",
          link: "https://synergism.cc/"
        },
        {
          name: "Universal Paperclips",
          link: "https://www.decisionproblem.com/paperclips/index2.html"
        },
        {
          name: "Monies<sup>2</sup>",
          link: "https://sneekxy.nmtechgroup.com/monies2/"
        },
        {
          name: "The First Alkahistorian stages 1, 2, and 3",
          link: "https://nagshell.github.io/elemental-inception-incremental/"
        },
        {
          name: "Melvor Idle",
          link: "https://melvoridle.com/"
        }
      ];
      const game = games.randomElement();
      return `Неопознанный разработчик "Измерений Антиматерии" хотел бы
        рекомендовать вам сыграть в <a href="${game.link}" target="_blank">${game.name}</a>`;
    },
  },
  {
    id: "a93",
    text:
      `По 10-балльной шкале я оцениваю эту игру на твёрдую
      <span style='color: red'>java.lang.IndexOutOfBoundsException</span>`
  },
  {
    id: "a94",
    text: "Не знаю, почему все утверждают, что 9-го Измерения не существует. На самом деле получить к нему доступ очень просто! Надо [ДАННЫЕ УДАЛЕНЫ]."
  },
  {
    id: "a95",
    text: "ВЕЧНОСТЬ НЕ ПРЕДЕЛ!"
  },
  {
    id: "a96",
    text:
      `Давным-давно было научно доказано, что коты из материи - мудаки. У нас хорошие новости,
      ведь коты из антиматерии - всё ещё мудаки.`
  },
  {
    id: "a97",
    text: "Однажды мне не сказали, что антимир меня не раздавит."
  },
  {
    id: "a98",
    text: "Антиматерия - это как интернет. Если вы читаете это сообщение, значит, вам её не хватает."
  },
  {
    id: "a99",
    text:
      `"Благодаря антиматерии у нас есть возможность путешествовать во времени, и я пришёл, чтобы сделать
      прошлое снова великим." - 2-й Президент Мира`
  },
  {
    id: "a100",
    text: `Пожалуйста, вставьте диск -1, чтобы продолжить играть в "Измерения Антиматерии"™.`
  },
  {
    id: "a101",
    text: "Сюжет - скоро™"
  },
  {
    id: "a102",
    text: "Когда-то и я был частью антиматерии. Но потом мне в колено попала материя."
  },
  {
    id: "a103",
    text:
      `Антиматерия… антиматерия никогда не меняется… пока вы не перейдёте к квантовой физике антиматерии,
      но для этого у нас недостаточно Тахионов.`,
    get unlocked() { return PlayerProgress.realityUnlocked() || PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "a104",
    text: `В "Измерениях Антиматерии" нет войны. Здесь мы в безопасности. Здесь мы свободны.`
  },
  {
    id: "a105",
    text: "Глобальное потепление остановлено благодаря антиматерии. А теперь к новостям, не связанным с этой: Земли больше не существует."
  },
  {
    id: "a106",
    text:
      `Антивода. Антиземля. Антиогонь. Антивоздух. Когда-то давно четыре антинарода жили в мире.
      Но всё изменилось, когда антинарод Антиогня развязал войну. Только Антиаватар, властелин всех четырёх
      антистихий, мог вновь привести антимир в равновесие, но, когда мир нуждался в нём больше всего, он ненароком
      прикоснулся к обычной материи и взорвался.`
  },
  {
    id: "a107",
    text: "Если вы откроете антилутбокс, значит, вы продадите случайные вещи за внутриигровую валюту?"
  },
  {
    id: "a108",
    text: "Люди начинают ставить под вопрос существование Hevipelle."
  },
  {
    id: "a109",
    text:
      `"Измерения Антиматерии" гордятся тем, что их спонсирует Lehmä! Предлагаем вам уроки о поедании травы! Узнайте, какую
      траву есть безопасно, а какую - нет.`,
    isAdvertising: true
  },
  {
    id: "a110",
    text:
      `Шёл 2422 год. Обновление всё ещё не вышло. Hevi работал над балансом Измерений Измерений Безысходности
      и испытаний для 38-го слоя престижа. Было более 100 рядов достижений. Шла
      подготовка к переработке игры под библиотеку breaking_breaking_breaking_infinity.js.`
  },
  {
    id: "a111",
    text: "Импортируйте \"рождественская\" для разблокировки секретной темы."
  },
  {
    id: "a112",
    text:
      `Что ты, бл**ь, только что сказал обо мне, маленькая сучка? Да будет тебе известно, что я с отличием закончил
      обучение в войсках Антиматерии, что я участвовал в многочисленных секретных рейдах на 9-е Измерение и что у меня
      более 300 NNnNeMI-NNnNe подтверждённых убийств в бою. Я обучен искусству картофельной войны и являюсь лучшим снайпером во
      всех вооружённых силах Галактик Антиматерии. Ты для меня не что иное, как ещё одна бесконечность. Я тебя
      уничтожу на**й такой кнопкой "Купить всё", какой ещё не видало это измерение, помяни мои
      **аные слова. Ты думаешь, тебе сойдёт с рук плеваться в меня дерьмом по Межизмеренческой сети?
      Подумай ещё раз, ублюдок. Пока мы говорим, я связываюсь со своей секретной сетью автоматики по всей галактике, и твой
      IP-адрес отслеживается прямо сейчас, так что готовься к Большому Сжатию, х**сос. К Большому Сжатию, которое сотрёт с лица земли
      такую жалкую вещь, как твоя жизнь. Ты уже, бл**ь, мёртв, детка. Я могу быть где угодно и когда угодно и могу
      убить тебя более чем 7😠💩 разных способов, и это только с помощью мышки. Я не только хорошо подготовлен
      к бою в Расширениях Измерений, но и обладаю доступом ко всему арсеналу морской пехоты Антиматерии, который я
      использую в полной мере, чтобы стереть твою жалкую жопу с лица Вселенной, маленький паршивец. Если бы
      ты знал, какое неугодное hevi возмездие настигнет тебя за твой маленький "умный" комментарий,
      ты бы попридержал свой **аный язык. Но ты не знал, и не промолчал, и теперь покупаешь десятками,
      чёртов идиот. Я обрушу на тебя всю антиматерию, подобно дерьму, и ты утонешь в ней. Ты чертовски мёртв,
      детка.`
  },
  {
    id: "a113",
    text:
      `Так вот, я долго обдумывал этот вопрос. "Измерения Антиматерии"… что это значит? То есть это
      игра, это понятно. Ты покупаешь первое Измерение, и оно даёт тебе антиматерию, а второе Измерение
      производит первые, и так далее… Но что это значит? Это не может просто быть игрой, это было бы
      слишком просто. Должно быть, разработчик вложил в эту игру метафору. Я совершал свой еженедельный ритуал стрижки
      лобковых волос с помощью ножниц для ногтей, когда ко мне наконец-то пришло понимание. "Измерение" - это просто
      тонко завуалированное искажённое слово "истощение" - имеется в виду духовное истощение. Обычная материя - это злые и негативные мысли, которые
      способствуют духовному истощению, в то время как антиматерия - это позитивные мысли и хорошие друзья, которые его рассеивают. Ты
      начинаешь с простых вещей, которые едва заметно борются с истощением, но со временем
      борьба нарастает. Но кажется, что она никогда не сможет привести всё в порядок. Кажется, что истощение стремится к
      бесконечности. И ты продолжаешь. Но рано или поздно ты догадываешься, что истощение не бесконечно. Оно просто очень и очень
      велико. Но твои "измерения" в конце концов, после того как ты приложишь необходимые усилия, производят количество антиматерии, достаточное для поглощения этого кажущегося
      бесконечным истощения. После этого возможности безграничны. В кои-то веки ты действительно счастлив, и твоё
      счастье растёт экспоненциально, в то время как ты "преодолеваешь" "бесконечность" истощения. И ты продолжаешь,
      пока эта "бесконечность" не покажется крошечной по сравнению с тем счастьем, которого тебе удалось достичь в
      жизни, и пока ты не сможешь при сбросе превзойти эту бесконечность во мгновение ока. Если вы хотите знать,
      что означают некоторые механики… "Расширение Измерений" - это приобретение новых вещей и способов для получения
      счастья. "Галактика Антиматерии" - это усовершенствование этих вещей и способов. Например, покупке новой машины
      соответствует "Расширение Измерений", а обмену этой машины на более современную - "Галактика Антиматерии". "Вечности" -
      это крупные трагедии, такие как смерть любимого человека. Такой провал возвращает тебя в самое начало без
      видимой надежды на восстановление. Но со временем ты становишься сильнее и счастливее, чем когда-либо прежде. "Пожертвование
      Измерений" - это переезд. Тебе приходится расстаться со многими вещами, которые делали тебя счастливым, но там, куда
      ты переезжаешь, есть новые возможности. И эти новые возможности дают тебе больше счастья, чем у тебя было когда-либо.
      "Скорость тика" показывает, насколько легко сделать тебя счастливым, а "Измерения Времени" делают тебе ещё легче стать счастливым.
      "Измерения Антиматерии" - это метафора успешной борьбы духовно истощённого человека со своим недугом.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "a114",
    text:
      `(Усыпи меня) Усыпи меня внутри. (Я не могу уснуть) Усыпи меня внутри. (Оставь меня) Прошепчи моё имя
      и оставь меня тьме. (Усыпи меня) Попроси моё молоко остаться. (Я не могу уснуть) Прежде чем я закончусь.
      (Оставь меня) Оставь меня с тем ничтожеством, которым я стал.`
  },
  {
    id: "a115",
    text:
      `Обзор следующего обновления - лутбоксы! Испытайте гордость и чувство прогресса, открывая космические,
      галактические и вселенские лутбоксы за шанс открыть редкие скины, уникальные испытания с ещё более уникальными наградами,
      пропуски времени и даже новые измерения!`
  },
  {
    id: "a116",
    text: "Смысл измерений в том, чтобы пользователи испытывали гордость и чувство большого достижения."
  },
  {
    id: "a117",
    text: "Обновление страницы лечит рак."
  },
  {
    id: "a118",
    text: "У меня есть 9-е, у меня есть измерение… ЭЭЭ… ЕГО НЕ СУЩЕСТВУЕТ!"
  },
  {
    id: "a119",
    text:
      `С каких пор мы начали освещать такое? Половина этого - даже не настоящие новости, а просто шутки и
      мета-отсылки, которые даже не имеют смыс-ХАХАХА, НЕ ОБРАЩАЙТЕ НА ЭТО ВНИМАНИЯ, Я СОСУ-`
  },
  {
    id: "a120",
    text: "Шёл 1944 год. Hevipelle не мог выпускать обновления в ИА, потому что его не было на свете."
  },
  {
    id: "a121",
    text: `"ТОГО ИЗМЕРЕНИЯ НЕ СУЩЕСТВУЕТ" - GhostBot`
  },
  {
    id: "a122",
    text:
      `То, что вы знаете как орехи, - как правило, на самом деле семена костянок или бобовых. Hevipelle, с другой стороны, довольно безумен,
      и потому может считаться цельным сухим фруктом.`
  },
  {
    id: "a123",
    text: "Финляндия заявляет, что начинает импортировать Дизайн."
  },
  {
    id: "a124",
    text: "Из-за всего этого импорта у меня в голове Путаница."
  },
  {
    id: "a125",
    text:
      `Только сегодня вы можете позвонить по номеру 1-800-АНТИМАТЕРИЯ и получить Измерение Бесконечности БЕСПЛАТНО! Наше предложение включает в себя
      СОВЕРШЕННО БЕСПЛАТНУЮ ДОСТАВКУ и БЕСПЛАТНЫЙ АНТИЛЕВИЗОР ВЫСОКОГО РАЗРЕШЕНИЯ!!! Только сегодня по невероятно низкой цене - 42! Приблизительное время
      доставки - 5 часов.`,
    isAdvertising: true
  },
  {
    id: "a126",
    text: "Это тест новостей. Игнорируйте его."
  },
  {
    id: "a127",
    text: "В этой игре нет ошибок, ты просто не умеешь играть."
  },
  {
    id: "a128",
    get text() {
      return `Измерения_Антиматерии.mp${format(Number.MAX_VALUE, 2)}`;
    }
  },
  {
    id: "a129",
    text:
      `<a href='https://www.youtube.com/watch?v=dQw4w9WgXcQ' target='_blank'>
      https://www.youtube.com/watch?v=dQw4w9WgXcQ</a>`
  },
  {
    id: "a130",
    text: "Нажмите, чтобы выполнить то самое секретное достижение.",
    // This next line is needed for this news ticker to unlock
    // the secret achievement.
    onClick: () => undefined
  },
  {
    id: "a131",
    text:
      `Внимание: нам только что сообщили о риске заражения мозговым вирусом типа Василисков,
      похожим на печально известного "мигающего попугая". Этот конкретный пример известен как "фрактальный недуг III типа".
      Считается, что он вызывает "сбой" в работе мозга, похожий на компьютерный сбой, из-за математической
      сложности образа, вызывающего математические идеи, которые не поддаются постижению разумом, и внедрения гонделевского шока,
      в конечном счёте приводящего к сбою из-за гонделевских спойлеров. Все, кто его исследовал, в итоге от него
      погибли, так что невозможно сказать точно, но таково общепринятое мнение. Несмотря на это, учитывая
      введение режима "дизайн", а также сообщения о его спонтанном появлении, важно знать, что достаточно частое повторение
      появления этого режима может привести к формированию в сознании образа, как при "фрактальном недуге III типа".
      Принимая данные факты во внимание, мы хотим дать вам несколько советов на случай, если вы столкнётесь с подобной проблемой. Прежде всего
      немедленно обновите страницу. Если это не решит проблему, перейдите во вкладку "Настройки" и смените тему с "дизайна" на
      любую другую. И самое главное - Бог вам в помощь. Мы больше не можем позволить себе терять зрителей.`
  },
  {
    id: "a132",
    text: "Если я плохо говорю по-русски, я буду учить русский язык, пока не буду хорошо говорить по-русски."
  },
  {
    id: "a133",
    text:
      `Однажды мне сказали, что антиматерия меня раздавит, и я не семи атомов во лбу. ЧТО Ж,
      трубы проходят и не перестают проходить…`
  },
  {
    id: "a134",
    text: "О, смотри. Очередная новость скользит в верхней части экрана затем только, чтобы ты не скучал в этой игре с большими числами.",
  },
  {
    id: "a135",
    text: "Ах, я люблю запах аннигиляции частиц поутру."
  },
  {
    id: "a136",
    text: "У человека, сказавшего, что привидений не существует, очевидно, нет аккаунта в Discord."
  },
  {
    id: "a137",
    text: "ИИИИИИИИИИИИИИИИИИИИИИИИИИИИИИИИзмерения Антиматерии были созданы каким-то чуваком из Финляндии"
  },
  {
    id: "a138",
    get text() {
      return `Посмотрите на этот бесконечный бассейн, недавно построенный авари, который действительно бесконечен! На площади в
        ${format(Number.MAX_VALUE, 2)} квадратных мегаметров вам гарантировано бесконечное веселье!`;
    },
    isAdvertising: true
  },
  {
    id: "a139",
    text: "Мы обновили нашу политику конфиденциальности антиматерии."
  },
  {
    id: "a140",
    text:
      `Внимание, все играющие в "Измерения Антиматерии", Hevipelle в большой опасности, и ему нужна ТВОЯ помощь, чтобы стереть
      все плохие мемы в канале #news-ticker-suggestions. Для этого ему нужна дюжина новых dank-мемов и пара
      ботов для discord. Чтобы помочь ему, просто отправь номер своей карты антиматерии, три цифры на обратной стороне и
      дату истечения срока действия. Но надо поторопиться, чтобы Hevipelle успел обезопасить хорошие мемы и
      прийти к эпичному мему Р О Я Л.`,
    isAdvertising: true
  },
  {
    id: "a141",
    text:
      `Если бы каждый тримп занимал планковский объём и каждая единица ресурса занимала планковский объём, объём скольких Вселенных
      вы могли бы заполнить, прежде чем осознать, что вы играете не в ту игру?`
  },
  {
    id: "a142",
    text: "На самом деле прошлая новость неверна."
  },
  {
    id: "a143",
    text: "Если вы читаете эту новость, вы умеете читать."
  },
  {
    id: "a144",
    text: "<span style='color: #7289da; background: rgba(250,166,26,0.2); cursor: text;'>@everyone</span>"
  },
  {
    id: "a145",
    text:
      `Игра "Измерения Материи" от разработчика Ellepiveh только что набрала -1,000,000 игроков на игровом сайте Etagergnok.`
  },
  {
    id: "a146",
    text:
      `Сколько раз нужно облизать леденец "tootsie pop" из антиматерии, чтобы добраться до его центра? Довольно много, потому что если только
      вы не состоите из антиматерии сами, вы будете взрываться при каждой попытке его лизнуть.`
  },
  {
    id: "a147",
    text: "Говорят, если посмотреть в зеркало и упомянуть Hevipelle три раза подряд, ты мгновенно умрёшь."
  },
  {
    id: "a148",
    text: "Следующее обновление всего через 300 минут."
  },
  {
    id: "a149",
    text: "🤔"
  },
  {
    id: "a150",
    text: "Игра мертва 1/5 модерирование ужасно."
  },
  {
    id: "a151",
    text: "Это сообщение никогда не появится в новостной строке, разве это не прикольно?"
  },
  {
    id: "a152",
    text:
      `Первое Измерение производит антиматерию, второе Измерение производит первое Измерение, третье
      Измерение производит второе Измерение, четвёртое Измерение производит третье Измерение. Никто
      никогда не разблокировал 5-е, потому что это заняло бы больше минуты.`
  },
  {
    id: "a153",
    text: "Hevipelle сказал: \"Теперь я сам определяю реальность\". И создал новый слой престижа."
  },
  {
    id: "a154",
    text: "Вы проиграли."
  },
  {
    id: "a155",
    text: "Знаете ли вы, что 75% статистики берётся с потолка?"
  },
  {
    id: "a156",
    text:
      `Почему Стандартная нотация так называется,
      если её никто не использует?`
  },
  {
    id: "a157",
    text:
      `.тнемом йыннад в оге юуритсет я и ,юиретамитна в
      юиретам ьтащарверп босопс илыркто еынёчУ`
  },
  {
    id: "a158",
    text:
      `Если Габен не умеет считать до трёх, а Hevipelle не умеет считать до девяти, значит, в будущем будет
      разработчик игр, не умеющий считать до 27?`
  },
  {
    id: "a159",
    text:
      `Я считаю, что игра неполноценна, ведь нельзя купить все Исследования Времени сразу.
      Поэтому я покидаю сервер и удаляю игру.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "a160",
    text: `Оказывается, все наши новости крадут и транслируют в игру под названием "Измерения Антиматерии", чёртовы финны.`
  },
  {
    id: "a161",
    text: "mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm Ой, извините, не то текстовое поле."
  },
  {
    id: "a162",
    text: `"Лучший из языков - не Python, а финский." - Hevipelle`
  },
  {
    id: "a163",
    text:
      `Одни говорят, что эти новости - большей частью плохие мемы. Другие говорят, что это хорошие мемы.
      А что насчёт этой новости? Ну, это мета-новость.`
  },
  {
    id: "a164",
    text: "Смотри, мама, я в новостях!"
  },
  {
    id: "a165",
    text: "<span style='font-size: 0.2rem'>Цыц, я тут стараюсь пройти скрытно.</span>"
  },
  {
    id: "a166",
    text:
      `<span style='animation: a-game-header__antimatter--glow 2s infinite'>
      ПОЖАЛУЙСТА, ПОМОГИТЕ, Я ПРЕВЫСИЛ СВОЮ ЕЖЕДНЕВНУЮ ДОЗУ АНТИМАТЕРИИ ВДВОЕ!</span>`,
  },
  {
    id: "a167",
    text:
      `Ой, кажется, у меня закончилось <span style='animation: a-existence-glow 3s
      infinite; font-size: 1.8rem; color: white; line-height: 0;'>Существование</span>.`,
  },
  {
    id: "a168",
    text:
      "То есть, может быть, у нас и не закончатся новости, но вот хорошие новости точно закончатся. Ой, они уже закончились."
  },
  {
    id: "a169",
    text: "TODO: Ваня, пожалуйста, убери эту новость, прежде чем мы опубликуем обновление с реальностью."
  },
  {
    id: "a170",
    text: "<a href='https://www.youtube.com/watch?v=dQw4w9WgXcQ' target='_blank'>Эта ссылка не рикролл.</a>"
  },
  {
    id: "a171",
    text: "<a href='https://www.youtube.com/watch?v=P945A5Tndp8' target='_blank'>Эта ссылка не рикролл.</a>"
  },
  {
    id: "a172",
    text:
      `Если вы столкнётесь с проблемами или ошибками в новостях, сообщите о них на нашем сервере в
      <a href='https://discord.gg/ST9NaXa' target='_blank'>Discord</a> по этой ссылке.`
  },
  {
    id: "a173",
    text:
      `<span style='animation: a-game-header__antimatter--glow 3s infinite'>Этот
      текст сделан из антиматерии. Не трогайте его, иначе Вселенная сожмётся.</span>`,
    onClick: () => bigCrunchAnimation(),
  },
  {
    id: "a174",
    text:
      `<span style='font-family: runescape; color: yellow; text-shadow: 0.1rem 0.1rem black; letter-spacing: 0.1rem;
      font-size: 2rem; line-height: 0; animation: a-text-flash 1s steps(1, end) infinite;'
      >БЕСПЛАТНАЯ ОТДЕЛКА РУННОЙ БРОНИ</span>`,
  },
  {
    id: "a175",
    text:
      `Числа сияют на экране, всё из антивещества… королевство измерений, королевой
      стала я. Расширения одно за другим набегают, как волна - мне бы перестать тыкать кнопки, но я не
      могла. Не сдавайся, достигни галактики, купи десятку, купи всё, зажми все клавиши, пожертвуй измерения
      и отпусти…. и числа будут расти! Отпусти и забудь, вспять рост чисел не повернуть… Отпусти
      и забудь, в 8 байтов число не впихнуть. Хоть прошёл целый день уже, Большое Сжатие мне всегда
      по душе.`
  },
  {
    id: "a176",
    text: "Я использовал нотацию Эмодзи так долго, что действительно научился её читать, пожалуйста, помогите."
  },
  {
    id: "a177",
    text:
      `Набрав <span style='color: black; background: black;'>REDACTED</span> <span style='color: black;
      background: black;'>REDACTED</span>, вы можете разблокировать <span style='color: black; background: black;'>
      REDACTED</span>. Каждый <span style='color: black; background: black;'>REDACTED</span> каждая <span
      style='color: black; background: black;'>REDACTED</span> с определённой <span style='color: black; background:
      black;'>REDACTED</span> может <span style='color: black; background: black;'>REDACTED</span>. Вы можете
      улучшать <span style='color: black; background: black;'>REDACTED</span> и <span style='color: black;
      background: black;'>REDACTED</span>, тратя на это <span style='color: black; background: black;'>REDACTED
      </span>. Есть ещё одно улучшение, которое позволяет вам получить <span style='color: black; background: black;'>
      REDACTED</span> <span style='color: black; background: black;'>REDACTED</span>. Эти <span style='color:
      black; background: black;'>REDACTED</span> <span style='color: black; background: black;'>REDACTED</span>
      работают так: когда вы достигаете <span style='color: black; background: black;'>REDACTED</span> <span style=
      'color: black; background: black;'>REDACTED</span>, вы можете <span style='color: black; background: black;'>
      REDACTED</span> ваше количество <span style='color: black; background: black;'>REDACTED</span>, получив взамен
      <span style='color: black; background: black;'>REDACTED</span> <span style='color: black; background:
      black;'>REDACTED</span>. Как и остальные <span style='color: black; background: black;'>REDACTED</span>,
      они усиливают <span style='color: black; background: black;'>REDACTED</span>.`
  },
  {
    id: "a178",
    text:
      `ВНИМАНИЕ: использование "Измерений Антиматерии" может привести к таким побочным эффектам, как туберкулёз, ВИЧ/СПИД, внезапная вера в
      существование 9-го Измерения, спонтанный взрыв, полиомиелит, корь, экзистенциальный страх, неизлечимое безумие и <span
      style='color: black; background: black;'>REDACTED</span>. Пожалуйста, обратитесь в местную страховую компанию, чтобы проверить,
      застрахованы ли вы. Продолжая, вы снимаете с "Измерений Антиматерии" ответственность, в случае если с вами
      произойдёт что-либо из вышеперечисленного или того, что ещё не было перечислено. "Измерения Антиматерии" оставляют за собой право изменить это положение в любое
      время, в том числе без уведомления.`
  },
  {
    id: "a179",
    text: "Робот: активирован. Разум: приобретён. Мир: готов быть завоёван. Запущена: лень."
  },
  {
    id: "a180",
    text:
      `У нас закончились новости. К счастью, у нас есть резервные новости, которых нам хватит на 5 часов, а за это время
      мы успеем купить новый набор "5-часовых высококачественных новостей". Приносим вам свои извинения за доставленные неудобства.`
  },
  {
    id: "a181",
    text: "Я не удивлён, что мы потеряли 9-е Измерение. Оно же в глубоких джунглях!"
  },
  {
    id: "a182",
    text:
      `Последнее обновление завершило разработку "Измерений Антиматерии". Спасибо, что играете. Однако в очень
      скором будущем будут выпущены "ИЗМЕРЕНИЯ АНТИМАТЕРИИ". И прежде чем вы спросите, это не продолжение, это перезагрузка.
      Ожидайте выпуска через 5 часов!`
  },
  {
    id: "a183",
    text:
      `А теперь к другим новостям, не связанным с предыдущей: нам сообщают, что около 1,79 человека злится на то, что молния
      бьёт в их новогодние ёлки по ночам.`
  },
  {
    id: "a184",
    text:
      `<span style='animation: a-text-grow 1s infinite'>С̵̬̙͋͂̀̋͑̈́̇͠Л̵͇͎̂͂̂̍̓̌̐̋̋̀̀̔Е̶̨̲̯̘͙̬̥̮̣͚̱̫͛̽̃͌̚͝Д̴̨͍̝͐И̷̨̛̲̯̫̘͌́̄̏͌̀̈́͝͝Т̶̛̻̠̠̤̦̞̞̇͗̎̊̌̊͝͠Е̷̛̥͂̈́͗̎̃̓͛́͘ͅ</span>
      <span style='animation: a-text-shrink 1s infinite'>
      З̶̡̖͓̗̦̃̇̌̀͝А̵͇̭͉̓̎̈̿̊́̄̚͜</span><span style='animation:
      a-text-grow 1s infinite'>
      О̶̝͚̲̭͎͇͎͓͖͚͇̀̈́͗̃̏̂̌͝͝Б̴̶̨̡̤͙͈̝̬̰̺͒̈́́̆̓͘͘͘С̸̢̢̮͓̯̗͙͚̬̂̀̉͊̿Т̶̴̨̠̤̱̱̱̞̠̮͚̱͉͊̂̍̔̃͆̆̑̿͋̔͗̽̈́́́̅͘ͅА̶̣̣̙̹͚̲͔̲̼̬̥̀͌̒̾͘͘Н̵̪̠̗̝̗̘̜͚̮̊͒͆̃̀̌̒͝ͅО̸͎͗̍̑̎̅̅͝В̵̸̗͑̽̏̓͆͒̈́͌̑̽̇̆͊̔̍̊̈́̈́͘̕͘ͅК̸̘͐͝О̴̥̭̚͘Й̸̖̜͍͒́̋͆̈́̓</span>
      <span style='animation:
      a-text-shrink 1s infinite'>В̸̡̛̛̪̝̟̱̣̹̭̟̣̀̈̀̏̉̌͝͠О̶͙͈͖̠͇̬͍̟̰̃К̵̩̫͉̝͔̼͎̦̔̓̽͌͊̏̇̓̀̓̀Р̸̧͍͇̘̙̥̰͉̲͕͈̥̍͛̃̑͝Ӱ̵̧̤̻̖̱̘̯̝̖̌̄̕͝Г̶̜̱̄̈́̑̃̉̄̋̔͐͋͠
      </span><span style='animation: a-text-grow 1s infinite'>В̴͎̞͍̇̽͊͛̈́̅͛̈̅̚͠А̸̧̢̾͊С̷̫̼̜̼͇̋͛̎͑͆̅̓̇</span>`,
  },
  {
    id: "a185",
    text:
      `Мы не переходим к вашей любимой рубрике - "Твиты от фанатов"! Сегодня мы не получили сообщение от
      @pravda_v_materii, гласящее: "Как вы, люди, можете транслировать свою нелепую ЛОЖЬ и при этом спать по ночам?
      Вы делаете абсурдные заявления, такие как "антиматерия существует" и "люди из антиматерии не люди как все", эта
      пропаганда антиматерии ДОЛЖНА ПРЕКРАТИТЬСЯ НЕМЕДЛЕННО!!! Вы, люди, должны ОЧНУТЬСЯ и осознать, что вы ПРИЧИНЯЕТЕ ВРЕД ВСЕЙ
      МАТЕРИИ своими безумными речами!!" Какой приятный, позитивный настрой от нашего доброго товарища. С вами не было
      Ивана Иванова, это не программа "Общественное телевидение Антиматерии", и мы не увидимся завтра!`
  },
  {
    id: "a186",
    text:
      `<span style='animation: a-text-shrink 1s infinite'>/(^_^)/</span> <span style='animation: a-text-grow 1s infinite
      '>\\(^_^)\\</span> <span style='animation: a-text-shrink 1s infinite'>/(^_^)/</span> <span style='animation:
      a-text-grow 1s infinite'>\\(^_^)\\</span> <span style='animation: a-text-shrink 1s infinite'>/(^_^)/</span> <span
      style='animation: a-text-grow 1s infinite'>\\(^_^)\\</span>`,
  },
  {
    id: "a187",
    text: "𝓒𝓮𝓬𝓲 𝓷'𝓮𝓼𝓽 𝓹𝓪𝓼 𝓾𝓷 𝓶𝓮𝓼𝓼𝓪𝓰𝓮 𝓭𝓮 𝓷𝓸𝓾𝓿𝓮𝓵𝓵𝓮𝓼 🚬"
  },
  {
    id: "a188",
    text: "-. . ...- . .-. / --. --- -. -. .- / --. .. ...- . / -.-- --- ..- / ..- .--."
  },
  {
    id: "a189",
    text:
      `У каждого человека за спиной стоит, в конечном счёте, благодаря шарообразности Земли, тот же самый человек,
      заглядывая себе за плечо, крадя собственные идеи.`
  },
  {
    id: "a190",
    text: "Позор. Позор. Позор. 🔔"
  },
  {
    id: "a191",
    text: "Окей, Гугл, Большое Сжатие"
  },
  {
    id: "a192",
    // This ticker needs to be an unbroken string; using backtick strings and linebreaking will add spaces in the
    // ticker itself where the linebreaks are
    // eslint-disable-next-line max-len
    text: "179769313486231590772930519078902473361797697894230657273430081157732675805500963132708477322407536021120113879871393357658789768814416622492847430639474124377767893424865485276302219601246094119453082952085005768838150682342462881473913110540827237163350510684586298239947245938479716304835356329624224137216"
  },
  {
    id: "a193",
    text:
      `Доброе утро, уважаемые зрители, с вами Иван Осипов, и это программа "Общественное телевидение Антиматерии". Мне говорят, что у нас
      на сегодня приготовлены для вас интересные новости, так давайте же перейдём к делу. Кажется, кто-то
      <i>плохо</i> вёл себя сегодня, и на него обрушился "шторм из антиматерии", что бы это ни значило… Коллеги, это точно наш
      сценарий? Здесь напрочь отсутствует смысл. Это он? Ладно… Нам сообщают, что "ничего не теряется, ничего не
      создаётся"… Коллеги, я сейчас серьёзно говорю, это розыгрыш, да? Это не новости, это просто случайные предложения!
      Вы все говорили, что поможете мне в первый рабочий день, а теперь лишь путаете меня! Это <i>не</i> та
      рабочая атмосфера, в которой я хотел бы пребывать! Я увольняюсь!`
  },
  {
    id: "a195",
    text:
      `Клоуны уникальны в том, что нет такой вещи, как антиклоун,
      это просто другой клоун. Клоуны противоположны себе.`
  },
  {
    id: "a196",
    text: "Время для диско! (жми меня!)",
    onClick() {
      let random = Math.random();
      // Golden ratio
      random += 0.618033988749895;
      random %= 1;
      random *= 255;
      const color = `hsl(${random}, 90%, 60%)`;
      return `<span style='color: ${color}; text-shadow: 0 0 0.5rem ${color};
        animation: a-text-grow 0.4s infinite;'>Время для диско!</span>`;
    },
  },
  {
    id: "a197",
    text: "Чтобы достичь реальности за полнажатия клавиши R, нам надо для начала поговорить о параллельных измерениях."
  },
  {
    id: "a198",
    text:
      `Эй, привет! Просто чтобы ты знал, у тебя на экране пылинка. Не мог бы ты её стереть?
      Мне неловко, когда я в пыли. Большое спасибо!`
  },
  {
    id: "a199",
    text: "Настоящее обновление - это друзья, которых мы встретили по пути."
  },
  {
    id: "a200",
    text:
      `Эта новость была удалена, так как она является дубликатом другой новости.
      Приносим вам свои извинения за доставленные неудобства.`
  },
  {
    id: "a201",
    text: "Нет, погоди, не отключай новости!"
  },
  {
    id: "a202",
    text:
      `Это так грустно. Алекса, включи какую-нибудь грустную песню, чтобы я влился в её эмоциональный настрой, ведь у меня сейчас психика
      нестабильна, и я слушаю такую музыку, чтобы жалеть себя. Я понимаю, что это вредно для психики, но
      ты робот, неспособный к разумному мышлению, так что ты не можешь отказаться соучаствовать в моём
      саморазрушительном поведении, и ты всё равно включишь грустную песню.
      <i>Включаю Despacito. Исполнитель - Luis Fonsi.</i>`
  },
  {
    id: "a203",
    text:
      `"3 из 4 новостей фальшивы и заимствованы с сервера в discord без разрешения и упоминания
      изначального автора" - анонимный участник сервера в discord`
  },
  {
    id: "a204",
    text: "Если обновление будет через 5 часов, то, значит, антиобновление было 5 часов назад?"
  },
  {
    id: "a205",
    text: "Товарищи, это не новость, меня держат взаперти. Помогите, меня заставляют сочинять новости, и я ничего не ел на этой неделе. Помо- ХАХАХА, Я ЖЕ ГОВОРИЛ, ЧТО ЛЮДИ ИЗ МАТЕРИИ ГЛУПЫ, АХАХАХАХАХА"
  },
  {
    id: "a206",
    text:
      `Я зашёл на сервер игры в discord, чтобы дружелюбно поболтать. Тогда меня раздразнил
      пользователь под псевдонимом Cubic Frog.`
  },
  {
    id: "a207",
    text:
      `Здравствуйте, с вами Иван Осипов, и сейчас я расскажу вам всё о погоде на сегодня в нашей галактике. Температура сегодня поднимется до
      e10 с лишним, а к обеду нам следует ожидать высокой облачности с возможной антиматерией.`
  },
  {
    id: "a208",
    text:
      `Здравствуйте, с вами Степан Иванов, он же Степан Иванов. Наша первоочередная задача - служить нашей общественности из антиматерии.
      Мы, Информационное антиагентство, очень гордимся производимой нами однобокой публицистикой с упором на количество. Однако мы
      обеспокоены тревожной тенденцией распространения во Вселенной Антиматерии новостей, освещённых с двух сторон со всей
      ответственностью. Распространение непредвзятых, настоящих новостей в социальных сетях стало слишком частым явлением. Но более
      тревожно то, что некоторые СМИ публикуют эти настоящие репортажи, репортажи, не состоящие целиком из пропаганды,
      без предварительной сверки с тезисами правительства. К сожалению, некоторые информационные агентства используют свои
      платформы для продвижения логически обоснованных мнений и объективной повестки дня, чтобы заставить людей из антиматерии мыслить
      критически. Это крайне опасно для нашей диктатуры. Информационное антиагентство ответственно подходит к сбору
      и сообщению ложной информации. Мы понимаем, что ложь не бывает политически "левой" или "правой". Наша приверженность распространению
      клеветы, нагнетающей страх, сейчас как никогда является основой доверия к нам. Но мы бестелесные
      восьмимерные существа из антиматерии, и иногда наши методы пропаганды оказываются недостаточно эффективны. Если вы считаете наше
      освещение событий достоверным, пожалуйста, свяжитесь с нами следующим образом: зайдите на сайт googolplexo1.github.io/AntimatterDimensionsSourceCode, откройте вкладку "Настройки"
      и нажмите на кнопку "СБРОСИТЬ ЭТО СОХРАНЕНИЕ". Мы ценим ваши комментарии. Мы не будем на них отвечать, потому что вы всё равно
      удалите ваш комментарий, нажав на кнопку полного сброса. Мы прилагаем все усилия для сбора ложной информации
      и стремимся к недостоверному, однобокому, субъективному освещению событий… Мы почитаем за честь, за привилегию
      безответственно распространять новости каждую наносекунду. Спасибо, что смотрите нас. Мы ценим ваши
      отзывы. Вся материя должна быть-`
  },
  {
    id: "a209",
    text:
      `Ты слышал когда-нибудь балладу об Антиписателе? Я так и думал. Новости молчат об этой истории.
      Это неугодная Hevi легенда. Ходят слухи, что раз в 5 часов Антиписатель посылает в СМИ
      невероятно качественный репортаж и снова исчезает. Многие думают, что его никогда и не было на свете, а
      выдумал его Hevipelle для распространения своей пропаганды. Возможно, он существует и является обычным человеком, как
      мы все. В любом случае мы, вероятно, никогда не раскроем личность этого загадочного поэта.`
  },
  {
    id: "a210",
    get text() {
      const clicks = player.news.specialTickerData.uselessNewsClicks;
      const quantity = quantify("раз", clicks);
      if (clicks === 1) {
        return `Когда вы нажимаете на эту новость, ничего не происходит. И тем не менее вы на неё нажали.`;
      }
      if (clicks > 1) {
        return `Когда вы нажимаете на эту новость, ничего не происходит. И тем не менее вы на неё нажали ${quantity}.`;
      }
      return "Когда вы нажимаете на эту новость, ничего не происходит. И вы это знаете.";
    },
    onClick() {
      player.news.specialTickerData.uselessNewsClicks++;
      return this.text;
    }
  },
  {
    id: "a211",
    get text() {
      const disses = [
        "Да это не что иное, как ошибка округления.",
        "Это же ноль, грубо говоря.",
        "Ты что, забыл где-то символ экспоненты?",
        "Брось ты, это ничто."
      ];
      const diss = disses.randomElement();
      return `Всего-то ${format(Currency.antimatter.value, 2, 0)} антиматерии? ${diss}`;
    },
  },
  {
    id: "a212",
    text:
      `Эй, ты. Наконец-то ты очнулся. Ты пытался достичь 9-го Измерения, да? Пришёл прямо в ту самую
      бесконечность, как мы и тот вор вон там.`
  },
  {
    id: "a213",
    text:
      `У жирафов из антиматерии невероятно быстрая реакция. Это объясняет, почему они выиграли 90%
      всех чемпионатов по киберспорту, с тех пор как были изобретены специальные управляющие устройства для них.`
  },
  {
    id: "a214",
    text: "Барак Обамантиматерия"
  },
  {
    id: "a215",
    text:
      `Местный старик заменил свой газон травой из антиматерии, чтобы отпугнуть детей. Но,
      когда он попытался полить её, никто не выжил.`
  },
  {
    id: "a216",
    text: "Тестирую… тестирую… тестирую… Ой, чёрт, я опять в prod-среде.",
    isAdvertising: true
  },
  {
    id: "a217",
    text: "Девственник-материя против Чада-антиматерии."
  },
  {
    id: "a218",
    text:
      `После множества катастрофических случаев аннигиляции Управление
      Антиматерии по борьбе с наркотиками включило антиматерию в список запрещённых веществ.`
  },
  {
    id: "a219",
    text:
      `Здравствуйте, Vsauce, Майкл с вами. Все мы знаем, что 9-го Измерения не существует, но что такое 9? Вы знаете, что это
      число, которое идёт после 8… да? Что, если… между ними есть ещё одно число? И, нет, я говорю не о таких числах,
      как 8.5 или 8.76, я говорю о целом числе между 8 и 9. Так вот, всё это, может быть, звучит как абсурд, и на самом деле
      это почти так, но что, если мы пропустили число? Всех нас учили, что 2 идёт после 1, а 3 идёт после
      2, но что, если число, которое идёт после 8, не 9? Спустя годы исследований и экспериментов мы
      наконец-то нашли это число. Оно опасно, даже мысль о его существовании позволит ему поглотить ваше сознание, но,
      к счастью, мы разработали антиклетку для него, то есть помещение, которое держит его снаружи. Наш мозг обладает
      защитной системой, удаляющей из него в точности ту информацию, которая касается этого числа, именно благодаря ней нам
      удалось так долго продержаться на Земле, и именно из-за отсутствия защитной системы другие виды человека вымерли до нас, но число
      становится всё сильнее, медленно приближаясь к тому, чтобы взломать нашу защиту. Мы временно предотвратили попадание числа
      в нашу память с помощью всемирного устройства контроля над памятью, которое заставляет
      всех думать, что 9 идёт после 8, с тем побочным эффектом, что все считают 9 злой цифрой, но это лишь временное
      решение проблемы, ведь число будет продолжать становиться сильнее и в конце концов пересилит устройство
      контроля над памятью. Потому вы здесь, вы здесь один из самых умных людей, и мы надеемся, что вы сможете
      помочь нам в этой трудной борьбе против числа. Наш враг - не 9, а скрытое число между 8 и 9,
      пропущенное число.`
  },
  {
    id: "a220",
    text: "антиуп-"
  },
  {
    id: "a221",
    text: "Ошибка 404: новость не найдена."
  },
  {
    id: "a222",
    text: "Я люблю тебя 1e3000."
  },
  {
    id: "a223",
    text: "Если вы проведёте в одной бесконечности более 5 часов, пожалуйста, обратитесь к врачу.",
    get unlocked() { return PlayerProgress.infinityUnlocked(); }
  },
  {
    id: "a224",
    text:
      `Нам только что сообщили о неточности в прошлой новости. Мы, Информационное антиагентство, хотели бы официально
      отозвать эту новость и извиниться перед нашими постоянными зрителями.`
  },
  {
    id: "a225",
    text: "Если вы видите эту новость, вы её увидели."
  },
  {
    id: "a226",
    text: "Доброе урто. Это не опечатка. Опечатку допустили создатели русского языка."
  },
  {
    id: "a227",
    text: "Что, если… мы потрогаем… антиматерию? Ха-ха, я просто шучу… Разве…?"
  },
  {
    id: "a228",
    text:
      "Местные существа из антиматерии перестали быть местными после переезда."
  },
  {
    id: "a229",
    text: "🚗                         🚓 🚓"
  },
  {
    id: "a230",
    get text() {
      return `Вы начали играть в эту игру
        ${TimeSpan.fromMilliseconds(Date.now() - player.records.gameCreatedTime).toString("accusative")}
        назад. Спасибо, что играете!`;
    },
    dynamic: true
  },
  {
    id: "a231",
    get text() {
      return `Раз, два, несколько, 99, ${format(Number.MAX_VALUE, 2)}!`;
    }
  },
  {
    id: "a232",
    text: "следующая_новость();"
  },
  {
    id: "a233",
    get text() {
      return `Жулик уровня 10, босс уровня ${format(Number.MAX_VALUE, 2)},
        так работают "Измерения Антиматерии".`;
    }
  },
  {
    id: "a234",
    text: "Антиматерия не может угрожать перерезать вам горло, и вообще не умеет говорить."
  },
  {
    id: "a235",
    text: "Новый рецепт пиццы с антиматерией вызывает возмущение у традиционных итальянских поваров."
  },
  {
    id: "a236",
    text: "Смотрите продолжение нашей программы после короткого слова от наших спонсоров."
  },
  {
    id: "a237",
    text: "Вопрос о том, почему в ИА есть нотация Эмодзи, - плохой вопрос. Вопрос о том, почему в других играх нет нотации Эмодзи, - хороший вопрос."
  },
  {
    id: "a238",
    get text() {
      return `Игрок в ИА: "Сколько у тебя порядков?" Обычный человек: "Ну, может, 5 или 6 в данный момент,
      чувак". Игрок в ИА: "Ты как маленький ребёнок. Смотри: <span style='animation: a-text-crunch
      ${newsAnimSpd(22)}s 1; font-size: 0;'>С Ж А Т И Е</span>"`;
    },
  },
  {
    id: "a239",
    text: "О боже, вы только посмотрите на время! Осталось всего 5 часов до обновления!"
  },
  {
    id: "a240",
    text: "Привет, меня зовут Всё, и мне бы хотелось, чтобы люди перестали хотеть купить меня."
  },
  {
    id: "a241",
    text:
      `Срочные новости: правительство сообщает о первом в истории официальном контакте с инопланетянами. Эти инопланетяне выглядят как
      коты, но обладают очень сложными технологиями. Они способны к перемещению в космосе и его колонизации в гораздо
      большей степени, чем мы, и у них даже есть собственная криптовалюта под названием "чёрная монета".`
  },
  {
    id: "a242",
    text:
      `"Можно выдумать тупейшую цитату, приписать её какому-нибудь известному
      человеку, и люди поверят." - Владимир Путин`
  },
  {
    id: "a243",
    text: `"Мне трудно дышать. Пожалуйста, уберите свой палец." - M`
  },
  {
    id: "a244",
    text: "Не обращайте на меня внимания, я просто прохожу мимо."
  },
  {
    id: "a245",
    get text() {
      // \uE010 = :blob:
      const BLOB = "\uE010";
      const theme = Theme.current().displayName();
      const reasons = {
        Normal:
          ` за ту самую изящную простоту. Ты просто знаешь, что разработчик хотел показать тебе
          игру именно такой.`,
        Metro:
          ` за её красивые тонкие рамки, идеальные до пикселей резкие геометрические углы и просто чудесно
          уравновешенную цветовую палитру.`,
        Dark: " за то, что она радует глаз таким приятным игривым тоном как в цветах, так и в формах.",
        DarkMetro:
          ` за то, что, взглянув на неё, ты обретаешь спокойствие, за это идеальное сочетание профессионального и игривого дизайна
          с цветовыми брызгами.`,
        Inverted:
          ` за эти невероятно красивые, инопланетные сочетания цветов, которые ты не
          увидишь в типичной тёмной теме.`,
        InvertedMetro:
          ` за такую суровую атмосферу, где крайне контрастные цвета сталкиваются с
          профессиональным современным типом дизайна.`,
        AMOLED: " за то, что она потребляет на 10% меньше электричества, чем типичная светлая тема. Кто не любит экономить электричество?",
        AMOLEDMetro:
          ` за её приятный вид, напоминающий панель управления космического корабля из научной фантастики. …Нет, возможности
          управлять этим кораблём, к сожалению, не предусмотрено.`,
        S1: " за то, что она вселяет в тебя дух праздника. Ты как будто чувствуешь волшебство в воздухе!",
        S2: " за то, что она пробуждает во мне гордость за мои финские корни и за всё, чего мы, финны, достигли как народ.",
        S3: ", потому что она представляет собой красивую аналогию с жизнью, которая всё время меняется и никогда не бывает во всём хороша.",
        S4:
          ` за этот чудесный дизайн, беспорядочный до такой степени, что он почти полностью непрактичен.
          И в этом есть определённая красота.`,
        S5:
          `, потому что образ этого человека пронизывает всю поп-культуру. И его фотография,
          заполняющая собой весь фон, по-моему, выглядит довольно забавно.`,
        S6:
          ` за этот красиво анимированный фон, поглощающий тебя, и за изящные цвета и
          тон, которые затягивают и с головой окунают тебя в игру.`,
        S8: ", потому что мне дороги воспоминания об этом фоне из моего детства.",
        S7: " за то, что благодаря ей гораздо легче тайком поиграть немного в офисе.",
        S9: "lol you can't even ever see this in the game",
        S10:
          ` за её чёткий, успокаивающий, очень притягательный дизайн, за сложный, завораживающий фон.
          Ты как будто стоишь у штурвала футуристичного межзвёздного корабля.`,
        S11:
          `, потому что Клякса - знаковый персонаж на официальном сервере "Измерений Антиматерии" в Discord. Его широко используют
          для очаровательного выражения эмоций. То, что кляксы эволюционируют - факт. ${BLOB} всегда стремятся стать
          более выразительными. Бывают дни, когда новая ${BLOB} рождается на сервере, чтобы выразить ещё больше эмоций. Обычно
          ${BLOB} просто разбрызгиваются и витают вокруг, время от времени сливаясь и делясь. Только сами ${BLOB} знают, откуда
          они и куда они уйдут. Тем не менее, ${BLOB} здесь, всегда со мной.
          Ты любишь ${BLOB}, и ${BLOB} любит тебя в ответ.`,
        S12:
          ` за то, что от неё веет теплотой и домашним уютом. Но я настоятельно рекомендую вам
          обновить тему до новейшей темы для улучшения пользовательского опыта.`,
      };
      const reason = reasons[Theme.current().name.replace(/\s/gu, "")];
      return `Что это у вас за тема, товарищ? А, ${theme}! Вижу, у вас безупречный вкус.
        Я и сам люблю эту тему${reason}`;
    },
    dynamic: true
  },
  {
    id: "a246",
    text: "<span style='animation: a-fade-out 3s infinite'>УуууУУУУууУУУ, это я, печально известное новостное привидение!</span>",
  },
  (function() {
    let isFlipped = false;
    const normal =
      `Это сообщение - тест "Новостей 2.0". В Новостях 2.0 на каждое сообщение можно будет
      нажать, чтобы перевернуть его вверх ногами!`;
    const flipped =
      `¡иwɐɹон хdǝʚʚ оɹǝ qɯʎнdǝʚǝdǝu ıqƍоɯҺ \`qɯɐжɐн ɯǝɓʎƍ онжоw ǝинǝmƍооɔ ǝоɓжɐʞ ɐн
      0˙ᄅ хʁɯɔоʚоН ʚ ˙,,0˙ᄅ n̯ǝɯɔоʚоН,, ɯɔǝɯ - ǝинǝmƍооɔ оɯЄ`;
    return {
      id: "a247",
      get text() {
        return isFlipped ? flipped : normal;
      },
      reset() {
        isFlipped = false;
      },
      onClick() {
        isFlipped = !isFlipped;
        return this.text;
      }
    };
  }()),
  {
    id: "a248",
    text:
      `Честно говоря, нужно обладать очень высоким IQ, чтобы понимать новости. Юмор тут чрезвычайно тонкий,
      и без ясного понимания квантовой физики большая часть шуток не будет доступна пониманию обычного игрока.`
  },
  {
    id: "a249",
    text: "Женщина получила КУЧУ Расширений Измерений с помощью одного СТРАННОГО ТРЮКА! Галактики НЕНАВИДЯТ её!",
    isAdvertising: true
  },
  {
    id: "a250",
    get text() {
      let scene = "";
      const chasers = [
        ["🐖", "🐢", "🦆", "🐓", "🐜", "🐕", "🐈"],
        ["🚶‍", "🏃‍️", "🏇", "🚴‍"],
        ["🚗", "🚓", "🚕", "🛺", "🚙", "🚌", "🚐", "🚎", "🚑", "🚒", "🚚", "🚛", "🚜"],
        ["🚁", "🛸"]
      ];
      for (const set of chasers) {
        const chaser = set.randomElement();
        for (let i = 0; i < 3; i++) {
          if (Math.random() > 0.5 || !scene.includes(chaser)) scene += chaser;
        }
        scene += "&nbsp;&nbsp;&nbsp;";
      }
      return scene;
    }
  },
  {
    id: "a251",
    text:
      `Эй! Я - это ты из будущего! Я вернулся, чтобы предупредить тебя: обрати ОЧЕНЬ серьёзное внимание на
      следующую новость. В моей временной линии мы игнорировали её, и с тех пор человечество всегда жалело об этом.`
  },
  {
    id: "a252",
    get text() {
      return `<span style='animation: a-text-stretch ${newsAnimSpd(35)}s 1 forwards'>Эта новость замедлена.</span>`;
    },
    get unlocked() { return PlayerProgress.realityUnlocked() || PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "a253",
    text:
      `После всплеска жалоб от наших зрителей мы решили разрешить вам сочинять свои новости
      у себя дома. Попробуйте: <input style='border: none; outline: none; font-family: PTMono, Typewriter;
      font-weight: bold; font-size: 1.5rem'></input>. Или не пробуйте. Нам всё равно.`
  },
  {
    id: "a254",
    text:
      `"Анонимные Измерения Антиматерии" были распущены по причине провала их программы из 12 шагов.
      Люди доходили только до 8-го шага, а затем сбрасывали прогресс.`
  },
  {
    id: "a255",
    get text() {
      return `Звуковой эффект "Bruh" №${format(Number.MAX_VALUE, 2)}.`;
    }
  },
  {
    id: "a256",
    text: "Подумать только, всё начиналось с 10 антиматерии…",
    get unlocked() { return player.records.totalTimePlayed > 1e10 }
  },
  {
    id: "a257",
    text:
      `Треугольная дыра в ткани реальности прекратила существование
      некоторых букв английского алфавита, а именно: j, k, q, u, x, z`
  },
  {
    id: "a258",
    text:
      `Рождён слишком поздно, чтобы исследовать земной шар. Рождён слишком рано, чтобы исследовать космос. Рождён как раз вовремя, чтобы
      задротить пару часиков до следующего Большого Сжатия.`
  },
  {
    id: "a259",
    text:
      `Подождите, я знаю, что вы думаете: "Нажатие M есть нажатие M, нельзя говорить о половине!" Что ж,
      TJ "Slabdrill" Yoshi, выслушайте меня. Нажатие M на самом деле состоит из трёх частей: когда M нажата, когда M
      зажата, и когда M отпущена. Так вот, обычно именно нажатие полезно, потому что это единственная из трёх частей, которая
      имеет значение; однако иногда бывает достаточно части зажатия, которая также покупает измерения и
      ускорители. Что касается отпуска, пока что мы не знаем ни одного случая, когда эта часть полезна или
      важна, так что забудьте о ней. Итак, если расписать нажатия, необходимые для 2-го Испытания, то
      получится вот так: /¯\\. Нам достаточно зажать (¯) M, чтобы достичь первой галактики, нам нужно нажать (/) M,
      чтобы завершить Испытание, и снова нажать M, чтобы запустить другое испытание. Сколько всего нажатий
      получается? Что ж, кажется, три, и если мы рассматриваем прохождение текущей вечности отдельно, то, да, их будет
      три, но в полномасштабном забеге в Испытании кнопки M есть другие нажатия M, которые происходят раньше,
      например, нажатие M, необходимое для первой бесконечности, так вот, если учесть и это нажатие M,
      сколько нажатий M получится всего? Напрашивается наивный ответ "четыре": одно перед запуском Испытания и
      три внутри Испытания, как мы расписали раньше; однако можно сделать лучше. На самом деле нам достаточно
      трёх: нужно просто выдержать первое нажатие M, чтобы покрыть им полнажатия M, потому что полнажатия M требует
      лишь зажатия M, а не полного нажатия, и, таким образом, 2-е Испытание добавляет к забегу лишь два нажатия M,
      так как первое нажатие M просто высасывается из предыдущего нажатия M. И чтобы запечатлеть это
      явление, мы называем его 2,5 нажатия M. При рассмотрении отдельной вечности это число нужно округлять вверх до трёх, но в
      полномасштабном забеге его нужно округлять вниз до двух. В заключение, поскольку это первое нажатие M имеет значение в некоторых
      контекстах, но не добавляет дополнительных нажатий в других контекстах, мы называем его полнажатия M.`
  },
  {
    id: "a260",
    text:
      `Кажется, Репликанти строго следуют принципу "разделяй и властвуй" во многом.
      Ну, при таком темпе - во всём.`,
    get unlocked() { return PlayerProgress.eternityUnlocked() || PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "a261",
    text:
      `На самом деле "Измерения Антиматерии" - игра в жанре Roguelite! Если вы умираете, в загробной жизни вы разблокируете альтернативные
      механики, например, Измерения Пространства вместо Измерений Времени. Вы даже можете разблокировать новых персонажей, за которых
      можно играть, в том числе вашего клона из антиматерии!`
  },
  {
    id: "a262",
    get text() { return `Почему во времена моей молодости миллион считался огромным числом, а сегодня даже дети балуются такими числами, как ${format(Currency.antimatter.value, 2, 1)}?…`; },
    get unlocked() { return Currency.antimatter.value.gt(1e6); },
    dynamic: true
  },
  {
    id: "a263",
    text: "Для чего нужны драгоценные камни? Драгоценные камни нужны для жилья. Вы спросите: жилья для чего? Хороший вопрос."
  },
  {
    id: "a264",
    text: "Объявили, что скоро выйдет новый слой престижа: материальность. Приготовьтесь к рождению ребёнка!"
  },
  {
    id: "a265",
    text: "ВЫ ДОЛЖНЫ ПРОИЗВЕСТИ БОЛЬШЕ ИЗМЕРЕНИЙ."
  },
  {
    id: "a266",
    text: "Здравствуйте, как поживаете?"
  },
  {
    id: "a267",
    text: "Как же здорово кататься справа налево! Уииииииииииииииииииииииииииииииииииииииии!"
  },
  {
    id: "a268",
    text: "Не знаю, просто добавь это в игру."
  },
  {
    id: "a269",
    text:
      `В Измериграде образовалась пробка. Если вы собираетесь путешествовать в том районе, выезжайте пораньше. Вот, прямой эфир
      с места событий: 🚗🚕🚛🚙🚗🚚🚕🚕🚌🚛🚚🚙🚒🚛🚗🚙🚓🚗🚚🚛🚒🚌🚐🚚🚐🚛🚚🚓 Да, Дейл, я бы сказал, что это
      выглядит довольно скверно. И ещё не забудьте прихватить с собой воды и что-нибудь для перекуса.`
  },
  {
    id: "a270",
    text:
      `Галактический союз журналистов подал коллективный иск на разработчиков
      скромной браузерной игры "Измерения Антиматерии" по факту массового плагиата.`
  },
  {
    id: "a271",
    text:
      `<i style='border: 0.1rem solid black; border-radius: 50%; padding: 0.4rem; color: #2196F3; background: white;
      cursor: pointer;' class='fas fa-volume-up' onClick='(function(){new Audio("audio/news.mp3").play();})();'>
      </i> Это сообщение - тест "Новостей 2.0". В Новостях 2.0 на каждое сообщение можно будет
      нажать, чтобы прослушать его!`
  },
  {
    id: "a272",
    text: "Эта игра лучше с каждым слоем, как луковица."
  },
  {
    id: "a273",
    text: "Ни в одной из этих новостей нет опечаток. Если вы видите опечатку, это у вас в голове очепятка."
  },
  {
    id: "a274",
    text:
      `В бар заходит большое количество математиков. Каждый заказывает в 10 раз больше пива, чем предыдущий.
      Бармен говорит: "Ой-ой-ой, какой порядок!"`
  },
  {
    id: "a275",
    text: `"Буквенный Idle" - самая короткая инкрементальная игра всех времён. Она длится всего 33 секунды.`
  },
  {
    id: "a276",
    get text() { return `Интересный факт: в этой игре ${GameDatabase.news.length} различных новостей!`; }
  },
  {
    id: "a277",
    text:
      `Внутри тебя есть два волка. Один состоит из материи. Другой -
      из антиматерии. Ты вот-вот взорвёшься.`
  },
  {
    id: "a278",
    text:
      `Это просто дружелюбное напоминание о том, что вы забыли сделать что-то очень важное. Я не
      знаю, что, но что-то вы точно забыли сделать.`
  },
  {
    id: "a279",
    get text() {
      return `Скоро во всех розничных магазинах: настольная игра "Измерения Антиматерии"! Насладитесь острыми ощущениями от наблюдения
      за ростом больших чисел, не прибегая к помощи ПК или мобильного телефона. В комплекте есть всё необходимое, в том числе
      калькулятор в Смешанной научной нотации, ${format(Number.MAX_VALUE, 2)} жетонов антиматерии, высококачественная пластиковая
      кнопка "КУПИТЬ ВСЁ" и более
      тысячи новостных карточек со всеми теми неуместными мемами, которые вы знаете и любите! Вы наконец-то можете насладиться
      игрой в ИА так, как было задумано. Настольные ИА также доступны в дорожной версии, чтобы вы смогли испытать
      радость от вычисления логарифмического роста прямо в пути! КУПИТЕ настольные ИА СЕГОДНЯ! Может
      содержать следы обычной материи. Репликанти продаются отдельно. 9-е Измерение не входит в комплект.`;
    },
    isAdvertising: true
  },
  {
    id: "a280",
    text: "Я ненавижу антиматерию. Она грубая… жёсткая… и неприятная. Она проникает повсюду."
  },
  {
    id: "a281",
    text: "Что, если вы на самом деле не создаёте антиматерию, а просто теряете материю?"
  },
  {
    id: "a282",
    text:
      `Один человек сообщил, что ему на глаза попалось 9-е Измерение, но его
      разоблачили как обыкновенное 6-е Измерение из Австралии.`
  },
  {
    id: "a283",
    text:
      `Странное явление происходит, когда ты пытаешься перейти в более высокое измерение, находясь в 8-м
      Измерении. Более высокого измерения нет, поэтому Вселенная выбрасывает тебя обратно в 8-е Измерение с
      невероятной скоростью. Этот приём, известный как Расширение Измерений, широко используется пилотами
      звездолётов и энтузиастами антиматерии.`
  },
  {
    id: "a284",
    text: "Холодные совершенно одетые женатые мужчины рядом с вами!"
  },
  {
    id: "a285",
    text:
      `С этого момента вы дышите сознательно. Вы поняли, что вашему языку неудобно во рту.
      Теперь вы прилагаете усилия, чтобы держать свой подбородок. Уже несколько секунд вы не моргали. Краем глаза
      вы постоянно видите свой нос.`
  },
  {
    id: "a286",
    text: "Спасибо, что тестируете игру! :)"
  },
  {
    id: "a287",
    text:
      `Мода на продолжения обострилась до такой степени, что некоторые киностудии выпускают продолжения раньше оригиналов.
      Фанаты с нетерпением смотрят, как уменьшаются номера выпускаемых серий, желая поскорее разузнать,
      что вообще происходит.`
  },
  {
    id: "a288",
    get text() {
      const position = player.news.specialTickerData.newsQueuePosition--;
      if (position > 1) {
        return `Спасибо, что обратились в службу поддержки. Ваше удовлетворение очень важно для нас, и скоро с вами
          свяжется представитель компании. Ваш номер в очереди: ${position}. Благодарим вас за
          терпение. Коротайте время ожидания прочтением этих качественно подобранных новостей.`;
      }
      return "Спасибо, что обратились в службу поддержки. Здравствуйте, меня зовут Жанна, чем я могу помочь?";
    }
  },
  {
    id: "a289",
    text: "Нажмите, чтобы разобрать новостную строку и превратить её в скрепки.",
    onClick() {
      player.news.specialTickerData.paperclips++;
      GameOptions.toggleNews();
    }
  },
  {
    id: "a290",
    get text() {
      const paperclips = player.news.specialTickerData.paperclips;
      return `Видите ли, это не обычные новости. Они произведены первым Измерением Новостей. Чтобы
        разблокировать больше новостей, нужно собрать необходимое количество скрепок для покупки второго Измерения Новостей. У вас
        ${quantifyInt("скрепка", paperclips)}, но для покупки требуется
        ${formatInt(paperclips + 10)}.`;
    }
  },
  {
    id: "a291",
    text: "С учётом национальности Hevipelle немного иронично, что он создал игру, в которой нет финиша."
  },
  {
    id: "a292",
    text:
      `Фей не существует. Антифей тоже не существует. Такое положение вещей сложилось только неделю назад, когда эти
      две группы существ встретились. Неудивительно, что планеты, на которой они обитали, тоже больше не существует.`
  },
  {
    id: "a293",
    text:
      `<span style='font-family: "Comic Sans MS", cursive, sans-serif; font-size: 1.7rem;'
      >Здравствуйте, товарищи новости! 🛹</span>`
  },
  {
    id: "a294",
    text: "Если вы увидели новость, а потом опять увидели её, то, значит, она стала старостью?"
  },
  {
    id: "a295",
    text: "👁"
  },
  (function() {
    let wasClicked = false;
    const normal = "Нажмите на эту новость, чтобы сбросить текущее сохранение.";
    const clicked = "Вы безумец. А знаете что? Вот вам скрепка.";
    return {
      id: "a296",
      get text() {
        return wasClicked ? clicked : normal;
      },
      reset() {
        wasClicked = false;
      },
      onClick() {
        if (wasClicked) return undefined;
        wasClicked = true;
        player.news.specialTickerData.paperclips++;
        return this.text;
      }
    };
  }()),
  {
    id: "a297",
    text: "Не мыслю, следовательно, не существую."
  },
  {
    id: "a298",
    text: "Введите код Konami, чтобы выполнить секретное достижение."
  },
  {
    id: "a299",
    get text() {
      return `Купите новый набор пазлов "Измерения Антиматерии"! Имея в сумме ${format(Number.MAX_VALUE, 2)}
        кусочков, эти пазлы представляют собой идеальный способ хорошо провести время с семьёй!`;
    },
    isAdvertising: true
  },
  {
    id: "a300",
    text:
      `Совет директоров Информационного антиагентства хочет заменить новостную строку рекламным
      баннером. Пожалуйста, подпишите нашу петицию на сайте change.org, чтобы остановить их, пока не поздно!`
  },
  {
    id: "a301",
    text: "Следующий час через 0,2 обновления."
  },
  {
    id: "a302",
    text: "Представляем вам облегчённую антиматерию! Не содержит калорий… Всё то же аппетитное Сжатие.",
    isAdvertising: true
  },
  {
    id: "a303",
    text: `Hevi умрёт в 9-м сезоне "Теории Большого Сжатия".`
  },
  {
    id: "a304",
    text: "Привет, как у вас дела? Надеемся, что хорошо. Иначе надеемся, что после игры в ИА станет немного лучше!"
  },
  {
    id: "a305",
    text: "Перейдём к прогнозу погоды на сегодня. С вероятностью 100% будет погода."
  },
  {
    id: "a306",
    text: "Вчера на кухне я готовил антиматерию. У меня больше нет кухни."
  },
  {
    id: "a307",
    text:
      `Максимизатор скрепок - мысленный эксперимент, описанный шведским философом Ником Бостромом в 2003 году. Он
      иллюстрирует экзистенциальный риск, который сильный искусственный интеллект может нести для людей, если он
      запрограммирован на достижение даже кажущихся безобидными целей, а также подчёркивает необходимость добавления машинной этики при
      разработке ИИ. Сценарий описывает сильный искусственный интеллект, которому поручено
      производить скрепки. Если бы такая машина не была явно запрограммирована на то, чтобы ценить человеческую жизнь или использовать только
      заданные ресурсы в течение ограниченного времени, то при наличии достаточной власти её оптимальной целью было бы превратить всю материю
      во Вселенной (включая людей) либо в скрепки, либо в машины, производящие скрепки.`
  },
  {
    id: "a308",
    get text() {
      const nameList = [
        "Антинология",
        "Бесконекция",
        "Вечный Свет",
        "Галактия",
        "Дубликанти",
        "Исследователь Измерений",
        "Техион",
        "Реалистичный",
        "Небожизнь",
        "ERCDGM",
        "NRG+",
        "Коробка Изобилия",
        "Символический",
        "Мини-диван",
        "ИДЕАЛ",
        "Апанж",
        "Очки",
        "Интервал",
        "Новощи",
        "Небесный Пелль",
        "Марса",
        "Зоология",
        "Фоторный",
        "Якфоз",
        "Оризма",
        "ЭДИК",
        "Расщепьение",
        "Гамма",
        "Квантилятор",
        "Имнезия",
        "Фермический",
        "Автоматизеры"
      ];
      const names = [];
      while (names.length < 3) {
        const name = nameList.randomElement();
        if (!names.includes(name)) names[names.length] = name;
      }
      const prices = [
        Math.floor(Math.random() * 11) / 100,
        Math.floor(Math.random() * 11) / 100,
        Math.floor(Math.random() * 11) / 100
      ];
      for (let i = 0; i < 3; i++) {
        const price = prices[i];
        if (price === 0) prices[i] = `<span style="color: blue">0.00 ◄►</span>`;
        else if (Math.random() > 0.5) prices[i] = `<span style="color: green">+${price} ▲</span>`;
        else prices[i] = `<span style="color: red">-${price} ▼</span>`;
      }
      return `${names[0]} ${prices[0]}&nbsp;&nbsp;&nbsp;
        ${names[1]} ${prices[1]}&nbsp;&nbsp;&nbsp;
        ${names[2]} ${prices[2]}&nbsp;&nbsp;&nbsp;`;
    }
  },
  {
    id: "a309",
    text:
      `А теперь о прогнозе оттенка неба на неделю. Понедельник: <span style="color: turquoise">бирюзовый</span>.
      Вторник: <span style="color: #d2c6ba">серо-коричневый</span>.
      Среда: <span style="animation: a-game-header__antimatter--glow 3s infinite">серо-буро-малиновый</span>.
      Четверг: <span style="color: turquoise">бирюзовый</span>/<span style="color: #d2c6ba">серо-коричневый</span>.
      Пятница: <span style="color: #222">цвет угольной пыли</span>. Суббота: <span style="color: #222">цвет угольной пыли</span>
      с вероятностью <span style="color: indigo">индиго</span> ближе к вечеру.
      Воскресенье: <span style="color: white; animation: a-existence-glow 3s infinite">пустота</span>.`,
  },
  {
    id: "a310",
    text:
      `Вы позвонили на горячую линию поддержки "Измерений Антиматерии". Если игра дала
      сбой, попробуйте обновить страницу. Если проблема останется, нажмите 1, если вы играете с ПК, и 2 - с мобильного устройства. Если вам нужен
      совет, нажмите 3. Если вам нужно купить всё, нажмите M. Чтобы поддержать разработчиков, нажмите 4. Чтобы просмотреть ЧаВо,
      нажмите 5. Чтобы починить сломанное сохранение, нажмите 6. Чтобы получить приглашение на сервер в Discord, нажмите 7. Чтобы просмотреть историю
      изменений, нажмите 8. Нажмите 9, чтобы прослушать инструкцию заново.`
  },
  {
    id: "a311",
    text:
      `Авторские права на эту новость принадлежат корпорации The Walt Disney Company. По
      прочтении этой новости с вашего счёта будет списано 999 рублей.`
  },
  {
    id: "a312",
    text:
      `Но, прежде чем мы начнём, хотелось бы рассказать о спонсоре сегодняшнего видео - "Измерениях Антиматерии"™! У этой игры более 100 000
      положительных оценок, и она заставила меня переосмыслить роль браузерных игр в моей жизни. В ней отличные механики, 5
      слоёв престижа, уникальные, оригинальные испытания, глубокое древо Навыков и самые большие числа, которые я когда-либо видел.
      Без шуток, просто взгляните на эти числа. И что самое прекрасное, она бесплатна! Да, вы не ослышались. Бесплатна. И если вы перейдёте по
      ссылке в описании, вы начнёте игру с 10 септиллионами антиматерии. Да, вы не ослышались, с 10
      септиллионами. Так чего же вы ждёте, переходите по ссылке в описании и начните играть в "Измерения
      Антиматерии"™ сегодня!`
  },
  {
    id: "a313",
    text:
      `"…И потом, когда ты достигнешь 9000-го уровня, ты сможешь вознестись. Я не знаю, зачем тебе может понадобиться сделать это, у
      тебя просто сбросится весь кровью и потом заработанный опыт за какие-то маленькие бонусы, механики наподобие этой никогда не приживутся."
      - Неизвестный, приблизительно 2012 г.`
  },
  {
    id: "a314",
    get text() {
      const lawID = Math.floor(Math.random() * 8901) + 100;
      return `Внимание: указ ${lawID}-B, составленнный ИИ Duskscarf, также известный как закон "О гигантских
        космических кроликах", вступил в силу в вашей галактической области. Этот нормативно-правовой акт
        запрещает, помимо прочего, несанкционированную ловлю диких космических кроликов, усмирение приручённых
        космических кроликов и научные исследования, связанные с "планетарным выпасом", за исключением случаев, когда это
        разрешено другим указом Duskscarf. Список исключений выжжен на ваших веках, чтобы вы могли с ним ознакомиться. Кроме того,
        генная инженерия гигантских космических кроликов ограничена отдельными областями, такими как изменение размера
        (увеличение) и криптобиозное раздувание. Другие виды генной инженерии разрешены только
        в военных целях. Благодарим вас за сотрудничество. Это сообщение повторится через- Внимание: указ ${lawID}-`;
    }
  },
  {
    id: "a315",
    text:
      `Разработчики игры объявили, что скоро будет добавлена новая нотация - Подлинно слепая. Как они
      рассказали, при использовании этой нотации не будет отображаться интерфейс, что упростит пользовательский опыт.`
  },
  {
    id: "a316",
    text: "Некоторые предпочитают видеть уродство этого мира. Беспорядок. Я хочу видеть числа."
  },
  {
    id: "a317",
    get text() {
      return `${format(Number.MAX_VALUE, 2, 0)}? Это ни на что не похоже.`;
    }
  },
  {
    id: "a318",
    text:
      `Мы следуем руководствам
      так же строго, как и роботы,
      редко сомневаясь в своём выборе, по большей части подчиняясь тем, кто говорит, что дальше.`
  },
  {
    id: "a319",
    text: "Игнорируйте незаслуженные комплименты."
  },
  {
    id: "a320",
    text: "Представляем вам aPhone 10 - первое в мире полностью растворимое в воде мобильное устройство!",
    isAdvertising: true
  },
  {
    id: "a321",
    text:
      `Должно быть, вам тоскливо сидеть за ПК в полном одиночестве. Но не волнуйтесь. Мы всё ещё здесь.
      Наблюдаем за каждым вашим шагом.`
  },
  {
    id: "a322",
    text:
      `Челябинские мужики настолько суровы, что могут пройти
      "Измерения Антиматерии" до конца в один присест без сна и пищи.`
  },
  {
    id: "a323",
    text: `var i = "Omae wa mou shindeiru" console.log(i - 1 + "i?") NaNi?`
  },
  {
    id: "a324",
    text:
      `Если вы придумали новость, прокричите её в пустоту.
      Это не добавит её в игру, но вам станет весело!`
  },
  {
    id: "a325",
    text:
      `Авария, которая произошла на Чернобыльской аннигиляционной электростанции в прошлом месяце, поставила под вопрос безопасность
      энергии антиматерии, и теперь многие считают, что мы должны вернуться к более безопасным источникам энергии,
      таким как атомная энергия.`
  },
  {
    id: "a326",
    text: `"Измерения Антиматерии" - это как огр… в них есть слои.`
  },
  (function() {
    let wasClicked = false;
    const normal = "Нажмите, чтобы перезагрузить ваше устройство.";
    const clicked = `Пожалуйста, дайте "Измерениям Антиматерии" доступ к вашему устройству от лица администратора.`;
    return {
      id: "a327",
      get text() {
        return wasClicked ? clicked : normal;
      },
      reset() {
        wasClicked = false;
      },
      onClick() {
        if (wasClicked) return undefined;
        wasClicked = true;
        return this.text;
      }
    };
  }()),
  {
    id: "a328",
    text:
      `Информационное агентство перестало обращаться за новостями к людям на улице,
      вместо этого предпочитая нанимать квалифицированных журналистов. Начались массовые беспорядки.`
  },
  {
    id: "a329",
    text:
      `Представляем вам азбуку Морзе+++ - новейший код с 20
      символами для всех, кто хотел скользить, застёгивать молнию и свистеть!`,
    isAdvertising: true
  },
  {
    id: "a330",
    text: "Любая достаточно примитивная магия неотличима от технологии."
  },
  {
    id: "a331",
    text: "У меня нет носа, и я должен чихнуть!"
  },
  {
    id: "a332",
    text: "♪ Когда ты совсем не стараешься, но у тебя всё равно всё получается. ♪"
  },
  {
    id: "a333",
    text: `Безумно популярная музыкальная заставка "Я их отпущу" набрала 500 миллионов скачиваний в первую же неделю.`
  },
  {
    id: "a334",
    text:
      `Представляем вам совершенно новую диаграмму антимировоззрения! В ней возможны такие инновационные сочетания, как "законопослушно-хаотичный"
      и "добро-злой"! Также она содержит в своём устройстве ошеломляющую третью ось выразительности; идентифицируйте себя как "хаотично-законопослушно-невыразительный" ПРЯМО СЕЙЧАС
      по невозможно низкой цене - -5999 рублей! Действует пользовательское соглашение. Батарейки не входят в комплект.`,
    isAdvertising: true
  },
  {
    id: "a335",
    text:
      `Из-за новых осложнений, связанных с Игрой, по всей Антивселенной усилились протесты. Вследствие этого правительство
      было вынуждено изменить правила Игры, постановив, что ты выигрываешь, когда кто-то напоминает тебе об Игре,
      а не проигрываешь.`
  },
  {
    id: "a336",
    text: `Внимание, жители области 4 [широко известной как "тёмная область"], сектора ϰ, (01,05). Не
      покидайте ваше место жительства. Повторяю: не покидайте ваше место жительства. Не выходите на улицу.
      Лучшие метеорологические суперкомпьютеры компании Earthology, как и многие ведьмы, последовательно прогнозируют
      на завтра "вообще странное состояние атмосферы", и нам, откровенно говоря, не хочется узнавать, что это значит.`
  },
  {
    id: "a337",
    text:
      `Технологическая конвергенция - это идея о том, что все технологии сольются в единую технологию. Эта
      идея находит широкое распространение с самой зари информационной эры и проявляется во многих местах и устройствах,
      таких как смартфоны или интернет. "Измерения Антиматерии" - пример технологической конвергенции,
      а именно в области СМИ. Используя гениальную идею под названием "халатность", с помощью инновационного решения, известного как
      "слепой случай", они объединили второсортную игру и второсортную же новостную строку, создав посредственное развлечение,
      которое, хотя и является по большей части игрой, иногда выполняет функцию источника новостей немного лучше, чем новостная строка из
      "Измерений Материи". Достижение, поистине достойное того, чтобы все предприятия стремились, и, хотелось бы верить, действительно превзошли его.`
  },
  {
    id: "a338",
    text: "Были найдены древние пещерные рисунки числа 5. Похоже, наши предки чего-то ждали."
  },
  (function() {
    let wasClicked = false;
    const normal = "Читать дальше";
    const clicked = "дальше";
    return {
      id: "a339",
      get text() {
        return wasClicked ? clicked : normal;
      },
      reset() {
        wasClicked = false;
      },
      onClick() {
        if (wasClicked) return undefined;
        wasClicked = true;
        return this.text;
      }
    };
  }()),
  {
    id: "a340",
    text:
      `Вы производите довольно много антиматерии. Разработчик игры впечатлён. Так как данное сообщение
      было записано заранее, все оценки вашего производства антиматерии с нашей стороны носят предположительный характер.
      Игнорируйте незаслуженные комплименты.`
  },
  {
    id: "a341",
    text: "ОШИБКА: ваша реальность не синхронизирована, пожалуйста, обновите атомы, чтобы продолжить."
  },
  {
    id: "a342",
    text: "Конечно, скрепки полезны, а именно для того, чтобы скреплять бумагу. Но кто в наше время пользуется бумагой?"
  },
  {
    id: "a343",
    get text() {
      const fakeProgress = Math.pow(player.records.realTimePlayed, 25);
      // Caps in ~68 years of real playtime then turns into "Infinite%"
      return `Всемирное Испытание: соберите ${format(Number.MAX_VALUE, 2)} конкурсных скрепок
        (узнаваемых по
        квадратным концам) в сумме по сохранениям всех игроков в ИА, чтобы получить специально подготовленную к событию металлическую волынку, способную производить 2 антиматерии в секунду, а также дополнительный ускоритель
        сверх ${format(1e200)} ускорителей! Текущий всемирный прогресс:
        ${format(fakeProgress)}/${format(Number.MAX_VALUE, 2)}
        (${formatPercents(Math.log10(fakeProgress) / Math.log10(Number.MAX_VALUE), 3)})`;
    }
  },
  {
    id: "a344",
    text:
      `Наша жизнь - загадка. Никто не знает, как она устроена на самом деле. Множество вопросов остаётся без ответов:
      в чём смысл жизни? Существуем ли мы внутри симуляции? Как сделать достижение "Вот это поворот…"? Где и
      как началось бытие? Все эти вопросы постоянно вертятся у нас в голове, а
      ответы на них? Возможно, мы никогда не узнаем.`
  },
  {
    id: "a345",
    text: "Японцы жалуются, что здесь нельзя отобразить хокку. Возникает конфликт."
  },
  {
    id: "a346",
    text:
      `Знаете ли вы, что есть версия "Измерений Антиматерии" для устройств на Android? <a
      href="https://play.google.com/store/apps/details?id=kajfosz.antimatterdimensions" target="_blank">
      Нажмите, чтобы просмотреть её в Google Play!<a>`
  },
  {
    id: "a347",
    text:
      `Плутон не штат. Как все мы знаем, 50 штатов - это Азия, Артемида, Атлантика, Брайль, Вараха, Великая Пирамида,
      Весы, Воздух, Восьмиугольник, Галоген, Губно-губной, Дательный, Додекаэдр, Жидкость, Жёлтый, Запятая, Италия,
      Йель, Калий, Кандела, Канзас, Килиманджаро, Лавсан, Ладья, Левит, Лимфатический, Ловкость, Лямбда, Магматический,
      Мезозой, Микроволна, Молочный, Мюон, Наречие, Непарнокопытные, Новая Шотландия, Октябрь, P=NP, Полк, Пятеричный,
      Расколдовщик, Сатурн, Север, Тиана, Тигр, Торг, Фольклор, Шкив, Эри и Эукариоты.`
  },
  {
    id: "a348",
    text: "<span style='color: red'>[Новость удалена модератором]<span>"
  },
  {
    id: "a349",
    get text() {
      const chapters = [
        `Мы, писатели, художники, скульпторы, архитекторы и страстные приверженцы не тронутой до сих пор
        красоты Парижа, со всей нашей силой и со всем негодованием протестуем во имя недооценённого вкуса
        французов, во имя французского искусства и истории, которым угрожает опасность, против возведения в центре нашей
        столицы чудовищной и бесполезной Эйфелевой башни, которую народная молва, часто не чуждая здравого смысла
        и чувства справедливости, уже окрестила "Вавилонской башней". Не впадая в экзальтацию шовинизма,
        мы имеем всё же право сказать во всеуслышание, что Париж - город, не имеющий себе равных в мире. Над его улицами,
        его широкими бульварами, посреди его великолепных променадов возвышаются самые благородные памятники, созданные
        человеческим гением. Душа Франции, создательницы шедевров, сияет среди этого августовского цветения камней. Италия,
        Германия, Фландрия, по праву гордящиеся своим художественным наследием, не имеют ничего, что могло бы сравниться с нашим,
        и Париж вызывает у людей со всех концов света любопытство и восхищение.`,
        `И мы сами собираемся подвергнуть его осквернению? И впредь Париж должен будет ассоциироваться с
        меркантильным, вычурным воображением машиностроителя, что нанесёт городу непоправимый урон и обесчестит
        его? Потому что Эйфелева башня, от которой отказалась даже коммерческая Америка, несомненно, обесчестит
        Париж. Каждый это знает, каждый об этом говорит, каждый этим огорчён, а мы лишь слабое эхо
        всеобщего чувства тревоги.`,
        `Наконец, когда иностранцы приедут, чтобы посетить нашу выставку, они удивлённо воскликнут: "Что? Вот эту
        мерзость французы нам показывают, чтобы дать представление о своём хвалёном вкусе?" Они будут правы,
        потешаясь над нами, потому что Париж божественной готики, Париж Жана Гужона, Жермена Пилона, Пуже,
        Рюда, Бари и других станет Парижем месье Эйфеля.`,
        `Пора отдать себе отчёт в том, к чему мы стремимся, и хоть на мгновение представить себе высоченную, смехотворную
        башню, возвышающуюся над Парижем наподобие гигантской фабричной трубы, подавляя своей дикой массой собор Нотр-Дам,
        Сент-Шапель, Дом инвалидов, Триумфальную арку, все наши униженные монументы, все наши архитектурные
        сооружения, которые растворятся в этом чудовищном сне. И на протяжении двадцати лет мы будем
        вынуждены смотреть на отвратительную тень отвратительной колонны из железа и винтов, простирающуюся над городом, 
        всё ещё проникнутым духом стольких столетий, как чернильная клякса…`,
        `Именно вам, месье и дорогой соотечественник, вам, кто так любит Париж, кто так украсил его,
        кто столько раз защищал его от административных разрушений и вандализма промышленных
        предприятий, выпала честь защитить его ещё раз. Мы поручаем вам отстаивать дело Парижа,
        зная, что вы приложите к этому всю энергию, всё красноречие, которые должны внушать такому художнику, как вы, любовь
        к прекрасному, великому, справедливому… И если наш тревожный сигнал не будет понят, если ваши доводы
        не будут услышаны, если Париж будет упорствовать в идее опозорить Париж, то, по крайней мере, мы с вами
        услышим протест чести.`
      ];
      const chapter = chapters[player.news.specialTickerData.eiffelTowerChapter];
      player.news.specialTickerData.eiffelTowerChapter = (player.news.specialTickerData.eiffelTowerChapter + 1) % 5;
      return chapter;
    }
  },
  {
    id: "a350",
    text:
      `Александр, посмотрев научно-популярную лекцию от Анаксарха по квантовой механике, вдруг заплакал,
      осознав, что бесчисленные миры ждут покорения, а он не мог овладеть и одним так, чтобы его не остановил
      мятеж или шестёрка.`
  },
  {
    id: "a351",
    text: "Привет, я пришёл пожаловаться на низкое качество только что доставленной мне меди."
  },
  {
    id: "a352",
    get text() {
      return `<span style='opacity: 0; animation: a-disappear ${newsAnimSpd(20)}s 1'>
      Эта новость антимемна. Вскоре вы забудете, что она существует.</span>`;
    }
  },
  (function() {
    let wasClicked = false;
    const normal = "<span style='cursor: pointer'>💣</span>";
    const clicked = "💥";
    return {
      id: "a353",
      get text() {
        return wasClicked ? clicked : normal;
      },
      reset() {
        wasClicked = false;
      },
      onClick() {
        if (wasClicked) return undefined;
        wasClicked = true;
        return this.text;
      }
    };
  }()),
  {
    // Blob from the blob font
    id: "a354",
    text:
      `<span style='color: #FBC21B; text-shadow: 0px 1px 0px black, 1px 0px 0px black, 1px 1px 0px black,
      0px -1px 0px black, -1px 0px 0px black, -1px -1px 0px black, 1px -1px 0px black, -1px 1px 0px black'>
      \uE010</span>`
  },
  {
    id: "a355",
    text:
      `<div style='background: url("./images/unsmith.png"); width: 2.3rem; height: 2.5rem; margin-top: -0.1rem'></div>`
  },
  {
    id: "a356",
    text: `Нажмите "Выбрать сохранение", чтобы исследовать две параллельных Вселенных.`
  },
  {
    id: "a357",
    text:
      `Научное сообщество по-прежнему озадачено значением числа 286 078. "Мы уверены, что оно связано с картофелем,
      но нам нужно провести больше тестов", - отмечает один из исследователей.`
  },
  {
    id: "a358",
    text: `Нажмите "Выбрать сохранение", чтобы исследовать две параллельных Вселенных.`
  },
  {
    id: "a359",
    text:
      `Местный разработчик инкрементальных игр вновь огорчает физиков. Вот что они говорят:
      "Нарушение физики и вопиющий технотрёп зашли слишком далеко".`
  },
  {
    id: "a360",
    text: `Нажмите "Выбрать сохранение", чтобы исследовать две параллельных Вселенных.`
  },
  {
    // Discord contest winner #1
    id: "a361",
    text: "Встречайте - распродажа высококачественных непромокаемых полотенец! Обязательно купите парочку при выходе!"
  },
  {
    // Discord contest winner #2
    id: "a362",
    text:
      `Компания Hevipelle Incorporated с гордостью представляет вам новую марку хлопьев: "Большое Сжатие"! Этот питательный
      завтрак содержит хрустящие нули из антиматерии, карманные измерения, сахарные кубики со вкусом бесконечности, экспоненциально растущие
      Репликанти и пастилу со вкусом вечности. Теперь вы можете ощутить "Измерения Антиматерии" у себя в
      желудке! Имеет побочные эффекты, такие как самовозгорание, тошнота, рвота, диарея,
      дематериализация, испарение, сердечная недостаточность, конец света и смерть. Если вы не состоите из
      антиматерии, необходима консультация со специалистом по вопросам потребления антиматерии.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "a363",
    text:
      `Самое дорогое в содержании дракона - это не золото, необходимое для заполнения гнезда, не магия, ради которой приходится жертвовать
      целыми империями, и не миллиарды войн, которые нужно вести для снабжения дракона дециллионами адамантия. Нет, это
      земля. Это всегда земля. Не спрашивайте королевских казначеев, почему у нас на самолёте больше живых существ, чем
      молекул земли. Просто продолжайте призывать бульдозеры с помощью тайных ритуалов и искать
      кусочки земли в недрах планеты.`
  },
  {
    id: "a364",
    get text() {
      const products = [
        `Иллюстрация 320-A - настоящая графическая стена для офиса. Один из наших старших консультантов изучит ваше предприятие
        и составит список слов, которые следует добавить в вестибюль, чтобы напомнить всем работникам о ценностях их
        компании. Известно, что это снижает мотивацию работников на 25% и более! На прошлых стенах были написаны такие слова, как
        "сингулярность", "катастрофический", "случайный", "компрометирующий", "худший", "иллюзорный", "неэффективный" и "разрушенный"! Закажите прямо сейчас!`,
        `Мебель 150-A (версия 2034 г.) - устройство для сидения на 3 персоны. Революционно новый дизайн для офисных зон
        ожидания - крупный табурет с тремя ножками, помещённый вверх ногами по эстетическим соображениям. Идеально подходит для
        возвращения сотрудников к работе в новых башмаках или брюках. Он не привязан и не приклеен к
        полу, как другие версии, но мы заботимся о том, чтобы другие сотрудники косо смотрели на того, кто посмеет внести изменения в наше
        произведение искусства. Заказывать не нужно, это подарок для каждого клиента!`,
        `Мебель 0853 - дыба. Революционно новое рабочее место от изобретателей ползающего
        стола помогает работникам превозмочь себя и обеспечивает, чтобы всё ваше предприятие кричало -
        от боли! Когда это считает нужным наш революционный ИИ агонИИ, всем пользователям предлагаются обязательные
        носилки. Рекомендовано местной тюрьмой, закажите прямо сейчас! Внимание: ОПиА несут ответственность только за такие деяния
        Бога, как молния и отпущение грехов.`
      ];
      const product = products.randomElement();
      return `Компания "Офисные принадлежности из антиматерии" рада представить вам новую коллекцию "Современный офис"! Каждый шаблонный
        товар может быть настроен под ваше предприятие, что даёт уникальную возможность способствовать синергии производства! Вот
        обзор одного из новейших товаров. ${product}`;
    },
  },
  {
    id: "a365",
    text: "Я не люблю Репликанти. Они грубые… жёсткие… и неприятные. Они производят себя повсюду.",
    get unlocked() { return PlayerProgress.eternityUnlocked() || PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "a366",
    text:
      `Такой вид искусства, как иллюзионизм, имеет любопытную историю. Смесь шарлатанов, пытающихся обдурачить людей,
      и актёров, разыгрывающих представления с помощью иллюзий или ловкости рук. Сменяющие друг друга стили фокусов и непрекращающиеся
      споры и разногласия по поводу того, надо ли утверждать, что фокус основан на иллюзии, или зрители
      волшебным образом поймут, что их обманывают, и объявлять об этом не надо. Сто лет назад произошёл раскол, разделивший фокусы
      на два вида: деликатные, упрощённые, приземлённые трюки и грандиозные зрелища с яркой техникой и
      прекрасными ассистентками, берущие начало из популярности одного-единственного фокуса с распиливанием человека
      пополам. Гораздо интереснее, чем телешоу об экстрасенсах, делающих вид, что вытаскивают выигрышный лотерейный билет из новостной
      строки, во всяком случае. Кстати, выигрышные номера в сегодняшнем вечернем тираже - 23, 10, 81, 106,4, 3+2<i>i</i> и <i>e</i>.`
  },
  {
    id: "a367",
    text:
      `Змеи на вид опасны, и они на самом деле таковы, и от каждой змеи, которую ты видишь, следует спокойно бежать. Но, к счастью
      для нас, змеи редко начинают конфликт, кроме совсем уж злобных. Если змея всё же
      пошла на то, чтобы укусить тебя, на это может быть 4 причины. 1. Змея злобная. 2. Ты напугал змею. Змеи
      страшны для тебя, но и ты страшен для змей. Ведите себя более елейно при встрече со змеёй. 3. Ты вторгся
      на территорию змеи. Зачастую в таких случаях змея предупредит тебя - именно с этой целью гремучие змеи гремят. Если ты
      не прислушаешься к предупреждению, змея укусит тебя. 4. И самая главная причина: змея считает тебя некрасивым.
      Всему виной устройство змеиных глаз, но это самая распространённая причина для укусов по крайней мере в 2
      юрисдикциях. Если змея укусила вас за то, что вы страшно некрасивый ящер, который постоянно забредает
      не в те кусты, следует предпринять 3 действия. Во-первых, вновь успокойтесь и сохраняйте спокойствие. Во-вторых,
      обездвижьте участок тела около места укуса, желательно, при помощи компрессионного бинта. Действие змеиного яда
      в полной мере зависит от движения объекта, в котором он находится. И, в-третьих, спокойно позовите на помощь других
      ящеров. Но не змею. Змея слишком злобная, чтобы помочь.`
  },
  {
    id: "a368",
    text:
      `Подозреваю, что больше людей нажало бы на кнопку полного сброса, если бы к тому, чтобы сделать процесс как можно сквернее,
      были приложены настоящие усилия. Медленное изъятие ресурсов с уникальными ослаблениями, существующими лишь затем, чтобы предотвратить прогресс.
      Разрушение интерфейса путём превращения его из годного в негодный, загадочный и громоздкий, требующий напряжения памяти и, более того, удачи, чтобы по крайней мере
      продолжать прохождение. Случайность, препятствующая игроку даже в простейших действиях, чтобы наказать его за самую мысль о
      прогрессе. Капканы, ловушки, катастрофы и скользкие места за шанс увидеть прогресс, который представляет собой не что иное, как
      отдаление состояния игры от всего, что можно назвать разумным. Ситуация, в которой персонаж
      сломлен и говорит тебе, чтобы ты просто уходил… но ущерб уже нанесён, если повернуть назад вообще возможно. И…
      чтобы выбраться из этого состояния, полного сброса может быть недостаточно. Он должен быть… полнее. Не просто полный сброс, а
      файл cookie или что-нибудь подобное в памяти компьютера, сделанное специально для того, чтобы предотвратить запуск игры заново.
      Или что-нибудь более вредоносное? И, несмотря на это, люди всё равно будут погружаться в этот кошмар, ибо
      человеческое любопытство не знает границ. Никакие предупреждения не остановят всех. Люди найдут
      способ продолжить, если только он существует, и могут даже пожаловаться, если процесс будет не таким скверным, как они ожидали. Ну что,
      хотите ли вы нажать на кнопку и добровольно погрузиться в глубины отчаяния? Надеюсь, что нет, потому что она здесь отсутствует.`
  },
  {
    id: "a369",
    text:
      `Программа по созданию империи входит в число самых трудновыполнимых задач. Тысячи часов
      планирования, усилий, консультаций и политических манёвров уходят на поистине прорывные проекты. Возьмём для примера
      Проект переустройства пространственных путей, революционную программу, известную как Проект четырёх "П", которая по праву считается
      апофеозом деятельности самого известного бюрократического комитета по инфраструктуре во всей Империи - ИФВИ (Имперского фронта
      волшебной инфраструктуры), не путать с ИФВЭ (Инвестиционным фондом воздушных электробусов) или
      НОВИ (Национальным объединением по волшебной инфраструктуре). Задача Проекта четырёх "П", поставленная ИФВИ, заключалась в
      возрождении коридора торговли маной, необходимой для МСПШ (мало-средних паровых шаттлов), которые были жизненно важны для развивающихся
      губерний, пострадавших от разграбления во время ДПОИ (Девятого похода за освобождение Империи).
      Проект четырёх "П" состоял из множества фаз. 1-я фаза представляла собой межевание воздуха глифами - любое большое дело начинается с
      маленького шага. Во 2-й фазе, целью которой был запуск ИРСП (Имперского разрушительного силового поля), более 50
      высокопоставленных лиц - император с приближёнными (от губернаторов до председателей имперских организаций), главы иностранных государств, ДСПС
      (дворянские семьи с предначертанной судьбой), которым принадлежала земля в тот момент, и даже некоторые ведьмы-предсказательницы -
      собрались вместе, чтобы представить Проект на выставке ГФЕИ (Государственного фронта единства Империи).
      К сожалению, в конце концов Проект был прерван в 215-й фазе, когда УПЭМ (установка для переработки экскрементных
      материалов), которая строилась для подрядчиков, взорвалась при столкновении с МСВЭ (мало-средним
      воздушным электробусом), вследствие чего последний геодезический колышек, использованный в 459-й фазе, был выброшен из временного вихря, возникшего из-за спора
      на ЕСВИ (Ежегодном съезде ведьм по инфраструктуре), проходившем в рамках 56-й фазы. Поистине трагичная история - 3 номинации
      на премию и 2 победы во время этого процесса благодаря ЭБОИ (эффективной бюрократии в области инфраструктуры).`
  },
  {
    id: "a370",
    text:
      "Внимание: игра приостановлена. Не обращайте внимания на то, что числа растут - это ошибка отображения."
  },
  {
    id: "a371",
    text:
      `Внимание, вопрос! Есть 3 двери, вы равновероятно выбираете одну из них и получаете в подарок то, что спрятано за ней. За дверьми
      спрятаны: 2 золотых козы; 2 серебряных козы; золотая коза с серебряной козой. После того как вы выбираете дверь, вам открывают
      ту из двух других дверей, козы за которой стоят меньше в сумме. Затем вам дают возможность изменить выбор двери.
      Какова вероятность того, что вы воспользуетесь этой возможностью?`
  },
  {
    id: "a372",
    text:
      `Если вы заблудились в лесу, посмотрите на деревья вокруг вас. Говорят, мох растёт с северной стороны, так что, прежде
      чем вы закончите разглядывать дерево, бродячий гитарист подбежит к вам и спросит, не хотите ли вы послушать песню
      "Wonderwall".`
  },
  {
    id: "a373",
    text: "Нажмите сюда, чтобы получать уведомления о каждой произведённой единице антиматерии!!!"
  },
  {
    id: "a374",
    text: "Эта новостная строка была специально разработана исключительно для показа рекламы."
  },
  {
    id: "a375",
    text:
      `Как вы, вероятно, знаете, на определённые годовщины принято дарить подарки из определённых материалов.
      Классика: серебро - на 25 лет, и золото - на 50 лет. А вот менее известные традиционные материалы для годовщин:
      ананас - на 37 лет, адская руда - на 66 лет, лизардит - на 82 года, азотошелестин - на 86 лет, таконит - на 95 лет,
      гатчетит - на 100 лет, электрум - на 110 лет, якитода - на 111 лет, фордит - на 119 лет, гелиотроп - на 120 лет,
      целестин - на 125 лет, гагат - на 140 лет, нефть - на 145 лет, сталь - на 150 лет, куммингтонит - на 198 лет,
      бетон - на 200 лет, кобальтовое стекло - на 210 лет, пейнит - на 250 лет, паризит - на 255 лет, паразит - на 260 лет,
      углеродные нанотрубки - на 300 лет, ртуть - на 310 лет, марсианская почва - на 340 лет, нептуний - на 370 лет,
      уран - на 380 лет, плутоний - на 390 лет, иксий - на 400 лет, огненный стержень - на 420 лет, асбест - на 430 лет,
      габайт - на 444 года, багротан - на 666 лет, лагга - на 777 лет.`
  },
  {
    id: "a376",
    text:
      `Крупные технологические компании совместными усилиями создали новую нейронную сеть, обученную генерировать тексты
      для рэпа, под названием РЭП-3. Вот одни из первых генерированных строчек: "Зови меня Прометеем, ведь я приношу огонь";
      "Зови меня Соником, ведь я собираю кольца". Критики говорят, что ИИ предстоит долгий путь совершенствования, прежде чем он заменит
      человеческую музыку.`
  },
  {
    id: "a377",
    text:
      `В связи с тем, что в ближайшем будущем ожидается выпуск новой версии ОС Android, Android 20, была раскрыта новая система
      внутренних кодовых названий. Первое кодовое название по состоянию на данный момент - "антиматерия". Это хорошо сочетается с тем,
      что, как предсказывают эксперты, телефоны на Android 20 будут самыми взрывоопасными телефонами всех
      времён из-за того, что они будут черпать энергию из аннигиляции. Источники сообщают, что исследовательская группа, стоящая миллиард долларов,
      работает над названием для 21-й версии Android, которое по традиции будет начинаться с буквы B, что, "если подумать, звучит
      не так плохо".`
  },
  {
    id: "a378",
    text: "Если бы каждая единица антиматерии была яблоком, вы могли бы не ходить к доктору более 3000 лет."
  },
  {
    id: "a379",
    text: "Поздравляем! Вы ничего не добились."
  },
  {
    id: "a380",
    text:
      `Челночный бег FitnessGram - это тест на максимальное потребление кислорода, который становится сложнее
      по мере его прохождения. 20-метровый челночный бег начнётся через 30 секунд. Приготовьтесь к старту. Необходимая скорость бега
      изначально мала, но увеличивается каждую минуту по сигналу. [бип] Вы должны успеть пробежать по одному
      кругу перед каждым сигналом. [дзинь] Бегите прямо как можно
      дольше. Тест будет окончен для вас во второй раз, когда вы не успеете пробежать круг до сигнала.
      Начинаем по команде "марш". На старт, внимание, марш!`
  },
  {
    id: "a381",
    text: "Шёл 1942 год до нашей эры. Hevipelle отправился в прошлое и воссоздал компьютер, чтобы заставить людей ждать обновления в течение 4 тысячелетий. Им уже невтерпёж."
  },
  {
    id: "a382",
    text:
      "Игроки в ИА, родившиеся после 1993 года, не умеют шутить… Они только и знают, что 5 часов, скрепки, 1.8e308 и 9-е Измерение."
  },
  {
    id: "a383",
    text:
      "Лучше, чем антианекдот, может быть только два. Я имею в виду число. Не два антианекдота. Я просто люблю число два."
  },
  {
    id: "a384",
    text: "Нажмите, чтобы ничего не произошло."
  },
  {
    id: "a385",
    text:
      `Удивительно… Почему Apple пропустила iPhone 9, а Microsoft - Windows 9?…
      Неужели их подкупил разработчик игр?`
  },
  {
    id: "a386",
    text: "9 из 10 врачей рекомендуют не трогать антиматерию. Мы не получили ответа от 10-го."
  },
  {
    id: "a387",
    text:
      `Весной человек построил колонну. Летом - другую. Всю осень они стояли. Но зимой с одной из них произошло
      неожиданное (см. определение в книге "Абстрактная многомерная ретропричинная физика") событие класса ZW "Вознесение",
      и, предположительно, она упала в измеренческую лазейку, где она по определению должна занимать больше
      измерений, чем она сама. К настоящему моменту усилия, приложенные к тому, чтобы извлечь колонну и вернуть её в основную реальность, не
      увенчались успехом (см. подробности в журнале проб 2453-3e9a-50d1-84fc).`
  },
  {
    id: "a388",
    text:
      `В свете последних событий мы хотели бы сделать официальное заявление. "Измерения Антиматерии"™ никоим образом не
      связаны с "Яковлевскими нарушающими причинность мозговыми червями"™. Мы не только не причастны к созданию ими
      изделия, которое стало причиной нескольких катастрофических происшествий с дестабилизацией измерений и обрушением реальностей, но и не одобряем его.
      Почти наверняка мы не подписали сделку 8 декабря 1994 года в 5:30:26 по UTC, обсудив, как мы могли бы извлечь выгоду
      из дестабилизации и деформации измерений. В 5-м рукаве Ориона галактики వ' не было организовано промышленной зоны,
      а даже если и была, мы не устанавливали локализованные аномалии, используя скрантонский механизм отвязки
      реальностей. Кроме того, на акроаматической очистительной установке АОУ-D в Зоне 43 не образовалось временной петли. Приносим
      вам свои извинения за то, что вам так могло показаться. В дальнейшем мы будем более тщательно бороться с дезинформацией.`
  },
  {
    id: "a389",
    text: "Ах, если бы можно было конденсировать антиматерию Вселенной в печенье…"
  },
  {
    id: "a390",
    text:
      `Ребята, вы не поверите! До обновления всего 5 часов. Обновление через 5 часов. Ура! Я так рад этой
      информации. До обновления всего 5 часов. Ого! Вы не поверите! Обновление всего через 5 часов. Оно пришло так
      быстро. Обновление, всего 5 часов.`
  },
  {
    id: "l1",
    text: "Вы только что произвели 1 000 000 000 000 000-ю единицу антиматерии. По вкусу она напоминает курицу.",
    get unlocked() { return Currency.antimatter.exponent === 15; }
  },
  {
    id: "l2",
    text: "Пожалуйста, ослабьте галактики.",
    get unlocked() { return player.galaxies === 2 || Currency.infinities.gt(0); }
  },
  {
    id: "l3",
    text: `В каком смысле "больше двух измерений"??? Мы на экране, очевидно, есть только два измерения.`,
    get unlocked() { return AntimatterDimension(3).amount.gt(0) || DimBoost.totalBoosts > 0; }
  },
  {
    id: "l4",
    text: `"Бесконечность - это сколько?" - буквально каждый хотя бы раз`,
    get unlocked() { return AntimatterDimension(8).amount.eq(190) || Currency.infinities.gt(0); }
  },
  {
    id: "l5",
    text: "Ну, хватит и четвёртого Измерения…",
    get unlocked() { return AntimatterDimension(4).amount.gt(0) && AntimatterDimension(5).amount.eq(0); }
  },
  {
    id: "l6",
    text:
      `Кажется, люди из антиматерии боятся числа 13 даже больше, чем мы с вами. Они разрушили
      целые галактики только для того, чтобы убрать число 13 из процентов.`,
    get unlocked() { return player.galaxies > 0 || Currency.infinities.gt(0); }
  },
  {
    id: "l7",
    text: "Чтобы понимать Пожертвование Измерений, нужно обладать докторской степенью по теоретической физике. Извините!",
    get unlocked() { return player.sacrificed.e >= 10 || DimBoost.totalBoosts >= 6; }
  },
  {
    id: "l8",
    text: "Новая группа стандартизации записи чисел предложила новаторский формат с эмодзи.",
    get unlocked() { return player.requirementChecks.permanent.emojiGalaxies > 0; }
  },
  {
    id: "l9",
    text: "Недавно открылся киоск с мороженым из антиматерии - он продаёт октиллионы сортов!",
    get unlocked() { return player.records.totalAntimatter.e >= 27; }
  },
  {
    id: "l10",
    text:
      `Небесный Пелль произвёл слишком много антиматерии, вследствие чего ему понадобилось создать новую галактику.
      Её можно увидеть в юго-западной части неба.`,
    get unlocked() { return player.galaxies > 0 || Currency.infinities.gt(0); }
  },
  {
    id: "l11",
    text: "9-е Измерение - ложь.",
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l12",
    text: "Квадратный корень из 9 равен 3, следовательно, 9-е Измерение не может существовать.",
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l13",
    text: "Вас впитало 9-е Измерение? Просто обратитесь к психиатру!",
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l14",
    text: "А теперь о погоде."
  },
  {
    id: "l15",
    text: "Пожалуйста, ослабьте первое Измерение - оно производит буквально всю антиматерию."
  },
  {
    id: "l16",
    text:
      `Если вы разрушите четвёртую стену… что ж, пятая, шестая, седьмая и восьмая всё ещё будут отделять
      вас от неприятностей, так что это не страшно.`,
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l17",
    text:
      `Hevipelle может заснуть только при определённых условиях. Во-первых, рак должен свистнуть на горе. Во-вторых, солнце
      должно быть скрыто от определённого арктического города в течение месяца. В-третьих, ему нужно выпустить обновление в ИА. И, наконец,
      никто в Discord не должен быть на 9-м Измерении. Только тогда он сможет отдохнуть до 6 часов, прежде чем вынужденно
      проснётся, чтобы не получить достижение за офлайн.`,
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l18",
    text: "Если 9-е Измерение - это зло, то, значит, 3 - это корень зла?",
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l19",
    text:
      `А мне бы номер 9 - 1e29 порций, номер 1e9 - большую порцию, номер 6 с Репликанти, номер 1e7, номер 4e5 - две порции,
      одну из них с материей, ну и большой временной вихрь.`,
    get unlocked() {
      return DimBoost.totalBoosts >= 5 ||
      player.galaxies > 0 ||
      PlayerProgress.infinityUnlocked();
    }
  },
  {
    id: "l20",
    text: "В прошлом месяце один учёный заявил, что открыл 9-е Измерение. С тех пор его не видели."
  },
  {
    id: "l21",
    text: "- Пять - это много? - Смотря чего. Антиматерии? Нет. Часов до обновления? Тоже нет."
  },
  {
    id: "l22",
    text: `"Антифильм эмодзи" стал огромным хитом!`,
    get unlocked() { return player.requirementChecks.permanent.emojiGalaxies >= 5; }
  },
  {
    id: "l23",
    text: `Если бы эта игра была создана Valve, достижение "Ни одного погибшего" было бы невозможно выполнить.`,
    get unlocked() { return Achievement(64).isUnlocked; }
  },
  {
    id: "l24",
    text: `Челябинские мужики настолько суровы, что в выполнении достижения "Ни одного погибшего" на первой же бесконечности их не останавливает даже тепловая смерть Вселенной.`,
    get unlocked() { return Achievement(64).isUnlocked; }
  },
  {
    id: "l25",
    text: "\"Выполнить половину всех достижений - не такое уж большое достижение\" - Boo",
    get unlocked() { return Achievements.effectiveCount >= GameDatabase.achievements.normal.length / 2; }
  },
  {
    id: "l26",
    text:
      `Танос будет безмерно огорчён, когда он придёт с полностью заряженной Перчаткой Бесконечности, а у Hevi
      есть полностью заряженная Перчатка Вечности.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l27",
    text:
      "Был открыт странный новый материал. Он растёт, по-видимому, экспоненциально, но помогает только с производством антиматерии.",
    get unlocked() { return PlayerProgress.replicantiUnlocked() && player.replicanti.chance === 0.01; }
  },
  {
    id: "l28",
    text: "Кажется, эти \"репликанти\" не будут размножаться ещё быстрее.",
    get unlocked() { return player.replicanti.chance === 1 && player.replicanti.interval === 1; }
  },
  {
    id: "l29",
    text:
      `Если Hevipelle будет писать три цифры в секунду, ему понадобится меньше времени, чтобы записать количество вашей антиматерии с точностью до целых,
      чем чтобы обновить игру.`,
    get unlocked() { return Currency.antimatter.exponent >= 100000; }
  },
  {
    id: "l30",
    text: "Неужели Hevi просто выбирает цитаты для вставки в игру?",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 30; }
  },
  {
    id: "l31",
    text: "У нашего информационного агентства появились конкуренты. Они состоят из чистой антиматерии.",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 80; }
  },
  {
    id: "l32",
    text: "Сколько раз подряд можно сказать \"анти\", прежде чем люди перестанут слушать?",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 100; }
  },
  {
    id: "l33",
    text: "Проверяет ли ещё Hevi канал #news-ticker-suggestions?",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 120; }
  },
  {
    id: "l34",
    text: `"Нужно больше цитат!" - hevipelle`,
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 135; }
  },
  {
    id: "l35",
    text: "Один человек уничтожил наблюдаемую Вселенную при помощи антиматерии и начал сочинять новости, чтобы бороться с чувством одиночества.",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 150; }
  },
  {
    id: "l36",
    text: "Вы почти у цели!",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 160; }
  },
  {
    id: "l37",
    text: "Вы можете остановиться на этом.",
    get unlocked() { return NewsHandler.uniqueTickersSeen >= 165; }
  },
  {
    id: "l38",
    text: "fucking hacker",
    get unlocked() { return NewsHandler.uniqueTickersSeen > GameDatabase.news.length; }
  },
  {
    id: "l39",
    text: "Один азиат попытался украсть приз за мировой рекорд бесконечности в -1 секунду, И У НЕГО ПОЛУЧИЛОСЬ!",
    get unlocked() { return NewsHandler.hasSeenNews("l1"); }
  },
  {
    id: "l40",
    text:
      `Я сломал 8-ю стену, там нет ничего, кроме хаоса, Slabdrill совершает ритуал принесения антиматерии в жертву 9-му
      Измерению. Это мой последний репортаж, да помилует Hevipelle наши души, мы не прислушались,
      а надо было.`,
    get unlocked() { return NewsHandler.hasSeenNews("l58"); }
  },
  {
    id: "l41",
    text: `"Я думал, обновление через 5 часов…" - новичок после 5 часов игры`,
    get unlocked() { return Time.totalTimePlayed.totalHours >= 5; }
  },
  {
    id: "l42",
    text:
      `Вчера мне посоветовали подождать пять часов до обновления, но вот настал новый день,
      а обновления всё нет! Что делать?`,
    get unlocked() { return Time.totalTimePlayed.totalHours >= 5; }
  },
  {
    id: "l43",
    text: "Вы же понимаете, что вам не удастся совершить бесконечность за -1 секунду, да?",
    get unlocked() { return player.records.bestInfinity.time === 0.1; }
  },
  {
    id: "l44",
    text: "Где живёт Немо из антиматерии? В NNnNeMI-NNnNe.",
    get unlocked() { return player.records.totalAntimatter.e >= 3e6; }
  },
  {
    id: "l45",
    text: `"Антифильм эмодзи MMMCMXCIX" стал огромным хитом!`,
    get unlocked() { return player.requirementChecks.permanent.emojiGalaxies >= 3999; }
  },
  {
    id: "l46",
    text: "Новое достижение!",
    get unlocked() { return Achievements.effectiveCount >= GameDatabase.achievements.normal.length; }
  },
  {
    id: "l47",
    text: "Достижение даётся за два миллиона, а не два миллиарда…",
    get unlocked() { return Currency.infinities.gt(2e9); }
  },
  {
    id: "l48",
    text: "Продолжайте в том же быстром темпе!",
    get unlocked() { return AchievementTimers.marathon1.time > 1200; }
  },
  {
    id: "l49",
    text: "В один прекрасный день вы перестанете неустанно копить.",
    get unlocked() { return Currency.eternities.gt(50000); }
  },
  {
    id: "l50",
    text: "Вы, вероятно, можете перестать копить вечности…",
    get unlocked() { return Currency.eternities.gt(DC.D2E6); }
  },
  {
    id: "l51",
    text: "Вы серьёзно?",
    get unlocked() { return Time.worstChallenge.totalSeconds <= 1; }
  },
  {
    id: "l52",
    text: "Своевременность играет ключевую роль.",
    get unlocked() { return player.records.thisEternity.realTime < 10; }
  },
  {
    id: "l53",
    text: "Если вы хотите накопить бесконечности, почему вы не купите соответствующее Исследование Времени?",
    get unlocked() { return !TimeStudy(32).isBought && Currency.infinities.gt(72000 * 168); }
  },
  {
    id: "l54",
    get text() {
      const names = [];
      if (PlayerProgress.infinityUnlocked()) names.push("Infinity");
      if (PlayerProgress.eternityUnlocked()) names.push("Eternity");
      if (PlayerProgress.dilationUnlocked()) names.push("Dilation");
      if (PlayerProgress.realityUnlocked()) names.push("Reality");

      const game1Name = names.randomElement();
      let game2Name = names.randomElement();
      while (game2Name === game1Name) {
        game2Name = names.randomElement();
      }
      return `Только что выпустили Pokemon ${game1Name} и ${game2Name}! С учётом нового поколения количество ` +
        "покемонов возросло до 1e151. Удачи поймать их всех!";
    },
    get unlocked() { return PlayerProgress.eternityUnlocked(); },
    isAdvertising: true
  },
  {
    id: "l55",
    get text() {
      const recipes = [
        "Репликанти: наберите немного Репликанти, поставьте в духовку и смотрите, как они растут. И растут. И растут.",
        "Антиматерии: наберите немного антиматерии, поставьте в духовку и <b>БУМ</b>.",
        "Вечности: наберите немного Очков Вечности, поставьте в духовку и ждите…",
        "Бесконечности: наберите немного Очков Бесконечности, поставьте в духовку и смотрите, как они ломают пространство-время."
      ];
      const recipe = recipes.randomElement();
      return `Как испечь Пирог ${recipe}`;
    },
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l56",
    text: "Испытания Реальности - это новое 9-е Измерение, которое, в свою очередь, представляет собой новый апельсин.",
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l57",
    text:
      `Яша вернулся домой после долгого школьного дня. По пути домой он нашёл любопытный маленький предмет.
      Прозрачный, но матовый. Мерцающий, но мрачный. Тяжёлый, но невесомый. Яша преподнёс этот предмет
      маме. "Мам, я нашёл эту штуку на тротуаре, можно, я оставлю её себе?" - спросил Яша. Мать повернулась,
      чтобы посмотреть, о какой штуке говорит её сын. Её зрачки расширились. "Яша, немедленно убери это из квартиры!" -
      закричала она. Яша растерялся, ведь предмет выглядел безобидно. Он спросил: "Ну, мама, поче-", -
      но не успел он договорить, как предмет претерпел что-то наподобие митоза с невероятной
      скоростью, и его копия выскользнула из рук мальчика и упала на пол. Мать бросилась к
      сыну и попыталась схватить предмет, но он опять произвёл на свет свою копию. "Яша… Что бы ни случилось, не
      забывай, что я люблю тебя, сынок…" - сказала она, обнимая ребёнка. "М-мам, что происходит?" - спросил Яша
      голосом, дрожащим от страха. Из глаза матери потекла одинокая слеза. "⭔⭚⦕꒜ марка Репликанти…" - угрюмо
      проговорила она. Репликанти продолжили размножаться всё быстрее и быстрее. Вся нижняя треть
      квартиры была заполнена Репликанти. Затем - половина. Ещё немного погодя - вся квартира целиком. Мать с ребёнком были
      заключены между стенами квартиры и Репликанти. Обречённые прожить короткий остаток жизни в
      этом неудобном гробу, медленно расходуя запасённый в лёгких кислород. Но это далеко не конец истории.
      Репликанти начали размножаться вне дома, хлынув через окно мерцающим оползнем. Те из
      соседей, кто заметил странные предметы, почти неотличимые от жидкости, попытались сбежать.
      Но Репликанти продолжили размножаться всё быстрее. Вскоре весь двор покрылся ими; состоял
      из них. Через некоторое время - несколько дворов. Весь город. Окрестные города. Вся страна. Весь континент. Вся
      планета. Вся Солнечная система. Вся галактика. Всё.`,
    get unlocked() { return player.replicanti.unl; }
  },
  {
    id: "l58",
    text:
      `Святая Троица Hevipelle - антиматерия, Очки Бесконечности и Очки Вечности. Эти три ресурса дают нам
      доступ к дару Hevi, Теоремам Времени. И с этими Теоремами Времени мы обращаемся к Hevi и воззываем: "Hevi, благослови
      нас в этот прекрасный день!" Hevi же ниспосылает нам благословление в виде Исследований Времени. Эти Исследования Времени - настолько
      могущественные благословления, что Hevi ограничил их могущество. Он рёк: "Я даю вам выбор из трёх путей", - и
      человечество стало выбирать. Между быстрым, дешёвым путём Измерений Антиматерии, дающим наслаждение немедленно,
      могущественным путём Измерений Бесконечности, золотой серединой, и путём Измерений Времени, путём долгого
      ожидания и борьбы человечества. Пока человечество выбирало, по земле пробежала трещина. Змей-искуситель выполз и,
      ухмыляясь, обратился к человечеству: "Я предлагаю вам выбрать могущественный путь девятого Измерения! Я Slabdrill, повелитель всего,
      что неугодно Hevi". Тогда человечество восстало и молвило: "Прочь, Slabdrill! Нам не нужна твоя гнусная ересь!" И Hevi, поднявшись,
      сразил Slabdrill Своей божественной силой. Пока тело Slabdrill падало в землю, он воскликнул: "Вы ещё
      придёте ко мне! Hevi пред-", - и он провалился в бездну материи. Hevi одарил человечество
      Улучшениями Вечности, усиливающими Измерения Бесконечности и Измерения Времени. И человечество получило от Hevi величайший
      дар. Множители ОВ. Он сказал: "Они умножают всё получение ОВ на 5, но их цена при этом возрастает в 50 раз.
      Пользуйтесь ими с умом". И человечество отправилось в свободное плавание более могущественным, в то время как слова Slabdrill эхом отзывались в людских головах.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l59",
    text:
      `Спор о форме единственного числа слова "Репликанти" продолжается. База команды «"Репликант"» была разграблена
      командой «Тоже "Репликанти"», и многие из их измерений были украдены. Команда «Форма множественного числа - "Репликантии"»
      пока не высовывается, после того как их план взломать словарь провалился.`,
    get unlocked() { return player.replicanti.unl; }
  },
  {
    id: "l60",
    get text() {
      return `Срочные новости: обрушилась шахта по добыче Осколков Времени! Количество жертв доходит до ${Math.floor(20 + Math.random() * 236)}!`;
    },
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l61",
    text:
      `Эксперты по вопросам антиматерии говорят, что миллениалы убивают индустрию испытаний: "Они начинают с
      выполненными испытаниями и преодолённой Бесконечностью, раньше о таком нельзя было и помыслить".`,
    get unlocked() { return PlayerProgress.infinityUnlocked(); }
  },
  {
    id: "l62",
    text: 
      `Перестань читать новости сейчас же. Не хочешь? Я тебя заставлю.
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp
      Ладно. Ты меня переупрямил.`
  },
  {
    id: "l63",
    text:
      `Вы ощутили, что время стало идти медленнее? Недавно было проведено исследование, установившее, что теперь каждая секунда длится около 1,3 секунды.
      Учёные назвали это явление Замедлением Времени.`,
    get unlocked() { return PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "l64",
    text:
      `Несправедливость в Академии Антиматерии: начинающие могут выбрать только одну область для исследования, в то время как элита
      может выбрать все три. "Это просто нечестно, чёрт возьми. Как это возможно, что им это разрешено?" - вопрошает недовольный студент.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l65",
    text:
      `Оказывается, никто не знает, как на самом деле выглядят Очки Бесконечности, даже те, кто работает с ними каждый
      день, потому что они обучены не смотреть на них. По словам экспертов, Очки Бесконечности "настолько опасны, что они могут убить любого, кто на них бросит взгляд",
      так что зачастую при работе с ними приходится завязывать глаза. Но сегодня всё изменится. Я здесь, прямо перед
      складом Очков Бесконечности, чтобы показать вам, как они выглядят, через 3, 2, 1-`,
    get unlocked() { return PlayerProgress.infinityUnlocked(); }
  },
  {
    id: "l66",
    text:
      `Человечество потрясено неудачным экспериментом по Замедлению Времени, в результате которого произошёл видимый сбой в пространстве-времени. Его последствия теперь можно увидеть
      в ночном небе прямо над небесным экватором.`,
    get unlocked() { return PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "l67",
    text:
      `Нюхать измельчённые Осколки Времени постепенно становится модным испытанием у самых скучающих людей.
      Говорят, это настолько одурманивает, что тебе кажется, будто весь мир вокруг тебя ускоряется, из-за чего
      это занятие и прозвали <span style="color: var(--color-eternity)">Испытанием Времени</span>. &nbsp;&nbsp
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
      Случаи смерти от обезвоживания резко участились. По неустановленным причинам люди забывают, что надо пить воду, на несколько дней.
      В их телах находят следы Осколков Времени.`,
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l68",
    get text() {
      let protestText = "";
      if (InfinityChallenge(4).isRunning)
        protestText =
          `Вот член стороны, считающей, что это 4-е Испытание Бесконечности. Что вы можете сказать? -
          Очевидно, худшее из Испытаний Бесконечности - 4-е. В самом деле, как его вообще пройти? Я всё пытаюсь
          и пытаюсь, но каждый раз я застреваю даже не близко к цели! Как его вообще пройти? -
          Какой страстный человек. С вами была программа "Вести". Мы вернёмся к этой теме позже.`;
      else if (InfinityChallenge(5).isRunning)
        protestText =
          `А вот человек, держащий плакат, который гласит: "Долой ИспБ5". Какую точку зрения хочет
          донести ваша группа? - И вы задаёте этот вопрос, прочтя наш плакат? Если у вас так слабо развит навык осмысленного чтения, то 5-е Испытание Бесконечности
          согнёт вас в бараний рог, не оставляя ни шан- - Как… интересно. С вами была программа "Вести".
          Мы вернёмся к этой теме позже.`;
      else
        protestText =
          `А эта женщина не согласна ни с той, ни с другой стороной. Каково ваше мнение по будоражащему всех вопросу? -
          Лично мне 9-е Обычное Испытание показалось хуже, чем оба- - ХВАТАЙ ЕЁ!! - НЕТ, НЕ- -
          Что ж, кажется, градус событий резко повысился, так что я отдаляюсь от их места как можно дальше. С вами была
          программа "Вести". Мы вернёмся к этой теме… когда-нибудь.`;
      return `- Здравствуйте, с вами программа "Вести", известная своей достоверностью. Сегодня люди бесчинствуют на улицах,
        споря по поводу того, какое из Испытаний Бесконечности хуже. ${protestText}`;
    },
    get unlocked() { return InfinityChallenge(1).isUnlocked || PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l69",
    text: "Дружба закончилась с Репликанти. Теперь Галактики Репликанти - мой новый лучший друг.",
    get unlocked() { return PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "l70",
    text:
      `Цуркрбарг, Небожитель Конфиденциальности, объявил о своих планах выпустить новую версию
      их вселенной социальных сетей - "Всего".`,
    get unlocked() { return Teresa.isUnlocked; }
  },
  {
    id: "l71",
    text: "Иные языки ждут… Пора стать программистом",
    get unlocked() { return Player.canEternity || PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l72",
    get text() {
      const scenarios = [
        `наши участники борются за выживание в безлюдной пустоши 8-го Испытания Вечности -
        что они предпримут, истощая свой запас покупок Улучшений Репликанти и Измерений Бесконечности?`,
        "мы расследуем сообщения об обрушении шахты по добыче Осколков Времени в 26:90.",
        "мы приглашаем в нашу студию любителя, чтобы он объяснил, какой была бы награда за 9-е Испытание Бесконечности.",
        `наши партнёры с "Общественного телевидения Антиматерии" объясняют, как они выпускают свои передачи.`,
        "мы приглашаем в нашу студию местных игроков в инкрементальные игры, чтобы они объяснили, как они играют в свои любимые игры.",
        `<span style='font-family: Barrio'>отправьте 10 000 рублей для поддержки
        разработчиков, иначе вы никогда больше не посмотрите "Голубую реальность".</span>`,
        "мы подробно объясняем, что вчера сломалось в Чёрной Дыре, питающей наш город.",
        "мы прогнозируем погоду на 10 дней вперёд.",
        `ВЫ ОБЯЗАНЫ ЗАПЛАТИТЬ ${format(player.reality.realityMachines.times(10).max(10))}
        МАШИН РЕАЛЬНОСТИ, ЧТОБЫ ПРОДОЛЖИТЬ СМОТРЕТЬ ЭТУ ПЕРЕДАЧУ.`,
        "мы присутствуем при запуске гипнодронов.",
        "наш великий всемогущий повелитель позоляет нам иметь одну единицу антиматерии.",
        `Александр Пушной объясняет, как Репликанти размножаются, и учит распознавать опасные теории заговора,
        такие как "поглощать антиматерию безопасно" и "Галактики Антиматерии не стоят того".`,
        "величайшие философы мира спорят, можно ли считать то, из чего мы с вами состоим, антиматерией.",
        "пекарь со стажем объясняет, как обычные предметы, не находясь под постоянным наблюдением, могут трансформироваться в пироги."
      ];
      const scenario = scenarios.randomElement();
      return `Смотрите в следующем выпуске нашей программы "Голубая реальность": ${scenario}`;
    },
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l73",
    text: "Давным-давно, в далёкой-далёкой галактике… изменилась наценка.",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "l74",
    text: "Встречайте новую механику: Исследования Реальности! Получайте внутриигровые бонусы за исследование реальной жизни!",
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l75",
    text:
      `Здесь, в "Измерениях Антиматерии", мы гордимся качеством нашей продукции. Например, знаете ли вы,
      что каждое Очко Бесконечности уникально? Да-да! Каждое из них обладает неповторимым характером, собственными чувствами,
      собственными мыслями… Надеюсь, с этим знанием вы сможете спокойно спать этой ночью… Вспомните, сколько Очков
      Бесконечности вы потратили? У каждого из них есть своя семья, по которой оно скучает… Посмотрите, что вы наделали. Вы чудовище.`,
    get unlocked() { return PlayerProgress.infinityUnlocked(); }
  },
  {
    id: "l76",
    text: 
      `Благодаря этой игре я умею говорить на языке антиматерии. Представьте, что было бы, если бы кто-то взял ваш телефон и подсмотрел
      вашу переписку с другим игроком в "Измерения Антиматерии", а там: - Боже мой, 9-е Испытание такое трудное, я не могу достичь
      даже одного Расширения, может, мне нужно больше ОБ? - Нет, ты сможешь его сделать. Отключи всю автоматику, кроме автоматики
      6-го и 8-го Измерений, и покупай измерения, начиная с самых дорогих. И получи две галактики. - А ты уже замедлил Время? Я застрял
      на 1e1300 ОВ, но все ИспВ у меня выполнены. - Просто подкопи Репликанти в долгой вечности. После Замедления всё равно не лучше,
      приходится копить Тахионы и ЗВ. - Я даже не могу достичь 1.8e308 ОБ с этими чёртовыми ослаблениями к ИА, ИБ и ИВ.
      Это явно не лучшая стадия игры. - Этот человек немедленнно отбросил бы ваш телефон и начал играть в ИА.`,
    get unlocked() { return PlayerProgress.realityUnlocked() || PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "l77",
    text: "Улучшайте Навыки при помощи искусственного отбора и передовых технологий эпигенетики.",
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l78",
    text:
      `Внимание: генетически модифицированные Очки Умения непригодны к употреблению в пищу, физическому контакту, вдыханию,
      выдыханию, мысленному контакту и разглядыванию как видимыми, так и невидимыми глазами. Не размещайте их вблизи горючих,
      негорючих, электропроводящих, электроизолирующих, изменчивых, биологических или механических веществ. Существуйте на свой страх и риск.`,
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l79",
    text:
      `Вопреки распространённому мнению, Межгалактическая налоговая служба Антиматерии имеет возможность платить налоги
      на антиматерию, полученную недобросовестными методами, т. е. любыми, кроме установленных законом и изменённых
      курсами испытаний измерений. В разделе NY-8N приведено 3 конкретных методики: незаконная раздача с новостных строк,
      неопознанные измерения и изменение ткани пространства-времени, - а также пункт о прочих
      специфических методах для антиматерии, которые могут появиться в будущем. И хотя вам придётся платить налог на антиматерию по максимальной ставке в 99%,
      таким образом вы можете сэкономить деньги в долгосрочной перспективе - если вас вынудит сменить реальность решение Небожителя, вы
      можете получить часть уплаченного налога обратно от МНСА в качестве налогового вычета, а также потребовать вычет для
      оплаты услуг судей, которые будут вас представлять. Конечно, любой уважающий свои МР [ССЫЛКА НА ИГРОКА НЕ НАЙДЕНА] знает, что
      лучше скрывать незаконные доходы от преступной деятельности в личных карманных измерениях, гиперсращённых волновых
      банках и нанооболочках, для применения которых требуются обширные исследования и разработки. По существу, сообщать о незаконом получении антиматерии
      рекомендуется, только если вы слишком богаты, чтобы скрыть свои доходы, но слишком бедны, чтобы скрыть свои доходы.`,
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l80",
    get text() {
      return `Фактоид о том, что "среднестатистический человек производит ${format("3e999999996", 2)} антиматерии в год", возник из-за статистической
      погрешности. Среднестатистический человек производит 0 антиматерии в год. Георг - Разработчик Измерений, живущий в пещере и
      производящий более ${format("1e1000000000", 2)} антиматерии в день, представляет собой выброс, так что его не надо было учитывать.`;
    },
    get unlocked() { return PlayerProgress.hasBroken(); }
  },
  {
    id: "l81",
    text:
      `Мир погрузился в хаос, оттого что законы математики были переписаны! Многое из того, что считалось
      бесконечным, оказалось лишь очень большим, но конечным!`,
    get unlocked() { return PlayerProgress.hasBroken(); }
  },
  {
    id: "l82",
    get text() {
      return `Великие писари Антии усердно трудились много лет. Боги дали им исполинское задание:
      выписать непостижимо длинное число. Писари работали по очереди, выписывая по несколько цифр в секунду
      каждый, денно и нощно в течение времени, казавшегося целой вечностью. Наконец, спустя
      ${TimeSpan.fromSeconds(Currency.antimatter.value.log10() / 3).toString("accusative")}, они выполнили
      невозможное. В конце недели, пойдя на поклон к богам, они отправили тем короткое сообщение: "В чём
      смысл? В чём значимость нашего многолетнего труда?" Боги ответили надлежащим образом: "Нам нужно было знать, сколько
      времени понадобится, чтобы выписать это число, для статистики в нашей игре."`;
    },
    // 3 years of time to write
    get unlocked() { return Currency.antimatter.value.gte("1e777600"); }
  },
  {
    id: "l83",
    text:
      `Запись в журнале изменений ИА: "Устранена проблема с небожителями. Антиматерия стала больше заботиться об аннигиляции. Добавлены рты.
      Удалены рты. Незваные гости больше не могут корпоративно захватывать магазины. Устранена ошибка, при которой новостная строка
      висит в воздухе. Мёртвые Репликанти теперь остаются в своих галактиках. Незваные гости больше не имеют в определении [ДАННЫЕ УДАЛЕНЫ].
      Устранена ошибка, при которой Тахионы застревали в левом верхнем углу экрана, что приводило к уничтожению времени. При вращении галактик
      теперь учитывается эффект Кориолиса.`,
    get unlocked() { return Teresa.isUnlocked; }
  },
  {
    id: "l84",
    get text() {
      return `Для справки, на текущий момент у вас ${quantify("бесполезная скрепка", player.news.specialTickerData.paperclips)}.
      Возможно, вам следует потратить свои скрепки.`;
    },
    get unlocked() { return player.news.specialTickerData.paperclips > 0; }
  },
  {
    id: "l85",
    text:
      `В параллельном мире до обновления всего -5 часов. Вы начинаете производить материю. Набрав
      огромное количество материи, вы вынуждены совершить конечность. Став, в конце концов, богатым на Очки Конечности,
      вы можете совершить мгновение. Через некоторое время и много мгновений вы
      ускоряете Время. Ускорение Времени даёт вам достаточное усиление, чтобы наконец совершить фантазию, которая является последним слоем
      престижа. Но вот вы узнаёте, что это был только сон. Ваша антиматерия в целости и сохранности, а до
      обновления всё ещё 5 часов.`,
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l86",
    text:
      `Здравствуй, игрок. Я хотел бы сыграть с тобой в игру. Перед тобой кучка Репликанти. В данный момент они остановлены
      во времени, чтобы не размножались. Справа от тебя компьютер, на котором открыты "Измерения Антиматерии" с новым сохранением. Ты
      должен достичь бесконечности. Но как только ты купишь 1-е Измерение, Репликанти начнут размножаться. Как тебе известно,
      они размножаются быстро, и если они заполнят собой всю комнату, ты задохнёшься. Как только ты достигнешь бесконечности, они
      вновь перестанут размножаться. Можешь начинать.`,
    get unlocked() { return PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "l87",
    text:
      `"Небо синее - в цветке, В горстке праха - бесконечность; Целый мир держать в руке,
      В каждом миге видеть вечность. В каждых 5 часах™️ - реальность" - Уильям Антиблейк`,
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "l88",
    text:
      `Приносим вам глубочайшие извинения за новую механику с глифами. Мы хотим, чтобы пользователи испытывали гордость и чувство
      большого достижения, получая редкие глифы. Текущие цифры основаны на данных, полученных благодаря финальной волне тестирования,
      с некоторыми корректировками. Мы постоянно оцениваем заработанные игроками средства и пересчитываем вероятности выпадения эффектов.
      И мы будем продолжать работать над этими цифрами, чтобы игроки чувствовали вызов и чтобы преодоление препятствий приносило
      награду и ощущалось как достижение. И, конечно же, чтобы всё достигалось игровым путём.`,
    get unlocked() { return PlayerProgress.realityUnlocked(); }
  },
  {
    id: "r1",
    text: "Эта новость в 100 раз реже остальных.",
    get unlocked() { return Math.random() < 0.01; }
  },
  {
    id: "p1",
    text: "Это отсылка к ДжоДжо?",
  },
  /* eslint-disable max-len */
  {
    id: "ai1",
    text: "If you are the game, then you can use the cheat to unlock a secret achievement…but it costs e1100 antimatter!?!"
  },
  {
    id: "ai2",
    text: "\"Hm, I don't know how to fix this.\" - Someone who has not unlocked the achievement btw"
  },
  {
    id: "ai3",
    text: "I thought the game was supposed to have a hard reset after eternity, but then I got randomized to start my first game with no save file \uD83D\uDE26",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai4",
    text: "I thought the update was 5 hours ago… I guess we'll have to put it back in 5 hours"
  },
  {
    id: "ai5",
    get text() { return `Local man finds ${format(Number.MAX_VALUE, 2)} Planck volumes in his freezer.`; }
  },
  {
    id: "ai6",
    text: "ahah bad ticker suggestion"
  },
  {
    id: "ai7",
    text: "I see you playing this game with an empty stomach and you're gonna start playing this game with an empty wallet."
  },
  {
    id: "ai8",
    text: "just start… clicking. dont even think about wasting time. just do it."
  },
  {
    id: "ai9",
    text: "the idea that the 9th dimension creates the 8th dimension is crazy"
  },
  {
    id: "ai10",
    text: "…does that mean the [REDACTED] dimension produces the [REDACTED] dimension?"
  },
  {
    id: "ai11",
    text: "\"click here to buy a stack of paperclips\" (when clicked you get Rickroll)",
    onClick() { window.open("https://www.youtube.com/watch?v=dQw4w9WgXcQ"); }
  },
  {
    id: "ai12",
    text: "In my spare time I read the short stories by T. H. White."
  },
  {
    id: "ai13",
    text: "Holy crap, that's pretty wild"
  },
  {
    id: "ai14",
    text: "Extinction is not a real thing. You can't wear the same hat 24/7."
  },
  {
    id: "ai15",
    text: "If you can read this you've escaped from the game."
  },
  {
    id: "ai16",
    text: "\"The hat trick I would love to see it\" - Noah Feldman"
  },
  {
    id: "ai17",
    text: "look at hevi fight riotously on the discord server"
  },
  {
    id: "ai18",
    text: "I just stole the \"Anti\" flag from a biker gang and I am packing it with dynamite, dynamite, dynamite, dynamite…"
  },
  {
    id: "ai19",
    text: "No matter how much antimatter you have, the matter will always outweigh the anti-matter."
  },
  {
    id: "ai20",
    text: "Franklin sealed the Omega squared. Now you can seal the Omega any way you want."
  },
  {
    id: "ai21",
    text: "Is this the real 9th Dimension?"
  },
  {
    id: "ai22",
    text: "Click here to exit the game"
  },
  {
    id: "ai23",
    text: "This news ticker will now only AIR in the 9th dimension"
  },
  {
    id: "ai24",
    text: "The 9th dimension doesn't exist because it was suppressed by the 9th dimension."
  },
  {
    id: "ai25",
    text: "To matter or to antimatter, that is the question."
  },
  {
    id: "ai26",
    text: "After 8 years of production and unstable universes, Chaosium will cease to exist in 5 hours."
  },
  {
    id: "ai27",
    text: "Half of the problems in the 9th dimension don't even make sense. What are they even doing with all of that energy anyway?"
  },
  {
    id: "ai28",
    text: "Wait, there's a nin--"
  },
  {
    id: "ai29",
    text: "Somewhere, a madman and his army of Trimps are tampering with Matter Dimensions."
  },
  {
    id: "ai30",
    text: "Why is there so many attached to this number? It doesn't make sense."
  },
  {
    id: "ai31",
    text: "The news ticker is in the anti-news-ticker"
  },
  {
    id: "ai32",
    text: "the 9th dimension doesn't exist because we are using nonary"
  },
  {
    id: "ai33",
    text: "BREAKING NEWS: New research has shown that not one, not two, but three people can be said to have felt the same emotion as me when they read that as a ticker suggestion."
  },
  {
    id: "ai34",
    text: "Here's an explanation of my 'problematic mood' - it's explained in the news ticker!"
  },
  {
    id: "ai35",
    text: "Local crazy person tries selling anti-cookies"
  },
  {
    id: "ai36",
    text: "Welcome to Antimatter Dimensions: Source, the free to play sequel to the cult classic AD:GO."
  },
  {
    id: "ai37",
    text: "A new hand touches your antimatter!"
  },
  {
    id: "ai38",
    text: "Who are we, anyways?"
  },
  {
    id: "ai39",
    text: "We are the people who actually matter"
  },
  {
    id: "ai40",
    text: "Matter?  Not even a hint."
  },
  {
    id: "ai41",
    text: "I am the news guy, I make news. You don't read this? Well you'll just have to wait until you look in the mirror."
  },
  {
    id: "ai42",
    text: "\"BOO!\" (news ticker moves 90 degrees)"
  },
  {
    id: "ai43",
    text: "BUY A JAR OF STICKERS, HIGH QUALITY STICKERS, GREAT QUALITY STICKERS!"
  },
  {
    id: "ai44",
    text: "I made news, you read it."
  },
  {
    id: "ai45",
    text: "I like news."
  },
  {
    id: "ai46",
    text: "I don't make news."
  },
  {
    id: "ai47",
    text: "YOU MAKE NEWS AND I GET THE [REDACTED] NEWS"
  },
  {
    id: "ai48",
    text: "The term \"Anti-infinity\" is a verb and cannot be a noun. Learn about its usage here."
  },
  {
    id: "ai49",
    text: "And now, for the shopping list!"
  },
  {
    id: "ai50",
    text: "The 9th dimension is clearly real! It's just not in our dimension."
  },
  {
    id: "ai51",
    text: "I tried searching on google for the phrase \"9th dimension,\" and I'm okay with saying that, because it describes a very real thing."
  },
  {
    id: "ai52",
    text: "You have no power here."
  },
  {
    id: "ai53",
    text: "Some people had to settle for 10 dimensions because they couldn't break infinity. Big Crunch turned out to be just a short space in time."
  },
  {
    id: "ai54",
    text: "There once was a young man in a strange land, and he dreamed of a universe filled with possibilities. One day, he asked his mother \"What's Expansion like?\" Her reply was \"Expansion times back then were unbalanced, and I said that's why you can't have equal amounts of matter and antimatter."
  },
  {
    id: "ai55",
    text: "Market research firm tries to explain why some commodities don't perform as expected. Market research firm herself can't figure out why."
  },
  {
    id: "ai56",
    text: "Bid your antimatter today!"
  },
  {
    id: "ai57",
    text: "I am Alpha Centauri, Prime 001. My research has found that if you are alive in the 9th dimension, evil has taken over your dimension and is attempting to enact its plan to take over your mind and reverse time. You must do everything in your power to stop this plan from being implemented, now."
  },
  {
    id: "ai58",
    text: "Stand by and unlock the 9th dimension for a secret achievement."
  },
  {
    id: "ai59",
    text: "I fix bugs in 5 hours"
  },
  {
    id: "ai60",
    text: "If you're reading this, that means you can read this."
  },
  {
    id: "ai61",
    text: "Uhh… Hi. Could you tell me your name?"
  },
  {
    id: "ai62",
    text: "Uh, no. This is too big for a QR code."
  },
  {
    id: "ai63",
    text: "(right to left move it make)"
  },
  {
    id: "ai64",
    text: "Oh no the antimatter is coming for us!"
  },
  {
    id: "ai65",
    text: "Why is there so much antimatter in this world? For a start, it's all produced by the antimatter factories on Earth. Secondly, the factories on"
  },
  {
    id: "ai66",
    text: "It's nothing personal, bro. -All villager types"
  },
  {
    id: "ai67",
    text: "I tried my best to read those tiny, handwritten messages, but whoever designed scythes hated me and stuck them in a corner. -Porygon-Z"
  },
  {
    id: "ai68",
    text: "Hmm… I don't know how I ended up here. I don't even know if I'm supposed to be here. I just sit here and imagine what could have been if I hadn't stopped. Oh god, what could have been…"
  },
  {
    id: "ai69",
    text: "Aw shucks, I finally hacked it enough to get to the C21 unlock, boss!"
  },
  {
    id: "ai70",
    text: "Купил мужик антиматерию"
  },
  {
    id: "ai71",
    text: "So you're telling me that I can post here, watch the titanic twice, come back and not be able to post?"
  },
  {
    id: "ai72",
    text: "The last update was 5 hours ago. There is no next update, because the last update was 5 hours ago. We will update our podcast in 5 hours to cover the entire topic of 5 hours, because this is the last podcast ever, everyone knows that the update is always 5 hours away, but in reality it's more like 1-2-3-4-5-6-7-8-9-10 minutes away, but in our heads it's closer to an actual accurate update date, like 5 hours away but with a few tickspeed upgrades."
  },
  {
    id: "ai73",
    text: "Yep. You. Get. Over. Your. Antidimensions."
  },
  {
    id: "ai74",
    get text() { return `Ad bonus: $${format(Number.MAX_VALUE, 2)} (random team)`; }
  },
  {
    id: "ai75",
    text: "Pass me that history, please"
  },
  {
    id: "ai76",
    get text() { return `Now releasing: Dimsension ${format(Number.MAX_VALUE, 2)}`; }
  },
  {
    id: "ai77",
    text: "ur history teacher said i was mad for getting *insert something here* on my bday"
  },
  {
    id: "ai78",
    text: "All is fair in antimatter"
  },
  {
    id: "ai79",
    text: "The Mysterium, the 2nd Dimension"
  },
  {
    id: "ai80",
    text: "Oops, I think we misticked."
  },
  {
    id: "ai81",
    text: "please wait 5 HOURS FOR THE NEWS"
  },
  {
    id: "ai82",
    text: "please wait til the weather improves"
  },
  {
    id: "ai83",
    text: "Please, take a minute to appreciate the beauty of this news ticker."
  },
  {
    id: "ai84",
    text: "How about this, working backwards? You know, from the time period covered by the question, that the game is set in, say, the 1950s. Now, if we talk about how games are set in the 2030s. Games are defined as any media, not necessarily of the form \"play some game\" (which, by the way, is a useful thing to have in one's vocabulary) but any media that can be understood as a game (i.e. a media that one can play back in time}, and games are defined as any game that one can't play back in time."
  },
  {
    id: "ai85",
    text: "How about AD, made by NaN? Higher quality, obviously. But still, [REDACTED]"
  },
  {
    id: "ai86",
    text: "I thought the whole \"annihilation is just a phase\" quote was awesome until I realized it also gave me a [REDACTED]"
  },
  {
    id: "ai87",
    text: "I have created an Omsi universe. And it's [REDACTED]"
  },
  {
    id: "ai88",
    text: "I put [REDACTED] in the oven. It got [REDACTED] and I [REDACTED] am [REDACTED]"
  },
  {
    id: "ai89",
    text: "What are the red herrings?"
  },
  {
    id: "ai90",
    text: "Help we are stuck in Hevipelle's (http://en.wikipedia.org/wiki/Hevipelle) basement and hevi is forcing us to build a [REDACTED] wall to keep [REDACTED] away from [REDACTED]"
  },
  {
    id: "ai91",
    text: "And now, for the weather. 70 and raining in North Dakota, remember those lovely, big, golden, iron curtain bars. Also remember that the [REDACTED] weather! Just remember: [REDACTED] and [REDACTED] outside [REDACTED]"
  },
  {
    id: "ai92",
    text: "Let's play a little game. You will start with no possessions and no goals. Lets say you have [REDACTED] and your [REDACTED] is [REDACTED] you can [REDACTED]"
  },
  {
    id: "ai93",
    text: "What are gems for?"
  },
  {
    id: "ai94",
    text: "Who made the 5th dimension?"
  },
  {
    id: "ai95",
    text: "I don't get it"
  },
  {
    id: "ai96",
    text: "Why is nobody talking about the 9th dimension?"
  },
  {
    id: "ai97",
    text: "This news sucks. Why no you don't get it?"
  },
  {
    id: "ai98",
    text: "Sorry, your reality has disconnected from the 9th dimension. You will now remain in the 8th dimension until further notice."
  },
  (function() {
    let wasClicked = false;
    const normal = "Now holding Infinity!";
    const clicked = "<#351477791457542144>";
    return {
      id: "ai99",
      get text() {
        return wasClicked ? clicked : normal;
      },
      reset() {
        wasClicked = false;
      },
      onClick() {
        if (wasClicked) return undefined;
        wasClicked = true;
        return this.text;
      }
    };
  }()),
  {
    id: "ai100",
    text: "I get all my news from this Discord, not 5 hours of my life"
  },
  {
    id: "ai101",
    text: "meow"
  },
  {
    id: "ai102",
    text: "You are now manually blinking."
  },
  {
    id: "ai103",
    text: "Sorry, your mic is playing Antimatter Dimensions."
  },
  {
    id: "ai104",
    text: "Sorry, your reality has disconnected from the 9th dimension."
  },
  {
    id: "ai105",
    text: "Apparently I am the bad guy in this video. I'm the one who did nothing."
  },
  {
    id: "ai106",
    text: "There are multiple ways to win this game. You can either type in your coordinates directly into the game, or you can type them into google which produces a different result. If you are getting the \"same exact thing\" result, your computer must be malfunctioning. Test results indicate that your computer is malfunctioning and you should check your firmware for vulnerabilities. You can also try turning off the news and re-running the game, but doing this only makes the \"the weather is X\" joke. Waiting six hours for a news message is NOT a news message."
  },
  {
    id: "ai107",
    text: "The weather is actually a thing. Scientists have confirmed that there is a correlation between the amount of Antimatter in the earth and the amount of weather. The earth is indeed a magnet, but scientists now hypothesize that as the earth warms up, the magnetic reconnection will accelerate, and this could cause a domino effect to cascade throughout the world, eventually leading to uncontrolled nuclear winter and spontaneous antimatter implosion."
  },
  {
    id: "ai108",
    text: "The tenth dimension is not a real thing. Stop telling people that."
  },
  {
    id: "ai109",
    text: "Don't tell Hevi it's not a real thing"
  },
  {
    id: "ai110",
    text: "i dont know how to fix this"
  },
  {
    id: "ai111",
    text: "This update is not for you!"
  },
  {
    id: "ai112",
    get text() { return `This is the last time, to buy items, you must pay a small fee of ${format(Number.MAX_VALUE, 2)} real money.`; }
  },
  {
    id: "ai113",
    text: "What is Antimatter? Long ago, gods lived in harmony. Then, everything changed when the apocalypse broke out. Chaos reigns, and even higher dimensions are being built. This is your fate. Build the Antimatter Dimensions. Amen."
  },
  {
    id: "ai114",
    text: "Water under the bridge?"
  },
  {
    id: "ai115",
    text: "I wonder if anyone has posted about this before me?"
  },
  {
    id: "ai116",
    text: "This post has been shared many times. Who knows how many?"
  },
  {
    id: "ai117",
    text: "Good night!"
  },
  {
    id: "ai118",
    text: "I made a timeline of my replicanti battles, which can be found here."
  },
  {
    id: "ai119",
    text: "\"Quantumum Battle Royale coming in 5 hours!\" (Rumor: 5 hours)"
  },
  {
    id: "ai120",
    text: "Rumor says Nords will start producing replicanti in five hours."
  },
  {
    id: "ai121",
    text: "I am an Nordsweeper, stealing their jobs to support the replicanti factories"
  },
  {
    id: "ai122",
    text: "Used to be, AD was the best game. Nowadays, it's all crapp."
  },
  {
    id: "ai123",
    text: "You better stop looking at these news ticker suggestions, before your fingers dry up."
  },
  {
    id: "ai124",
    text: "Antimatter Dimensions *Loses* bee movie."
  },
  {
    id: "ai125",
    text: "Oh, god, there's replicanti in my peas.",
    get unlocked() { return PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "ai126",
    text: "Oh, god, I'm stepping on a replicanti."
  },
  {
    id: "ai127",
    text: "Hello, world!"
  },
  {
    id: "ai128",
    text: "Welcome to /r/AskReddit about submarines. - accurate as of January 8th, 2017"
  },
  {
    id: "ai129",
    text: "Antimatter being researched by the government. Is it safe to say that this news ticker is fake?"
  },
  {
    id: "ai130",
    text: "Does the news show at Infinite Antimatter?"
  },
  {
    id: "ai131",
    text: "Have you saved your game? Yes. Have you quit your game? Nothin' wrong with this save. just keep holding that key."
  },
  {
    id: "ai132",
    text: "i clicked too fast…my fps dropped"
  },
  {
    id: "ai133",
    text: "I found out that the year is 20XX. I was going to make a news ticker but then I realized that it's just a ticker."
  },
  {
    id: "ai134",
    text: "\"One of these days I'll get bored of reading news for a while\" - old man"
  },
  {
    id: "ai135",
    text: "'Tis the season for new antiques! Get your first ever LOOK at these unique objects, before they're gone!' Sold out!"
  },
  {
    id: "ai136",
    text: "3 things that antimatter, 1 more thing to infinity"
  },
  {
    id: "ai137",
    text: "Buy the paperclip emojis now at https://aarextiaokhiao.github.io/blob/master/docs/en.json"
  },
  {
    id: "ai138",
    text: "click here to unlock the next update"
  },
  {
    id: "ai139",
    text: "(If you want you can make this only show when the news actually loads)"
  },
  {
    id: "ai140",
    text: "Malicious men are trying to make antimatter money, but their attempt is getting in the 9th dimension. What do you think about that?"
  },
  {
    id: "ai141",
    text: "Hey Siri, grind antimatter galaxies"
  },
  {
    id: "ai142",
    text: "Have you saved your game? If so, then you can continue playing without"
  },
  {
    id: "ai143",
    text: "It's like Getting your first arcane point. You know, like in the old ad where you're like \"I get this ad, I should make this ad"
  },
  {
    id: "ai144",
    text: "Ooga Booga"
  },
  {
    id: "ai145",
    text: "Boo has his own webpage! You might even call it \"Boo's Dandy\"\">https://en.m.wikipedia.org/wiki/Olli%27_Web#Main_page>"
  },
  {
    id: "ai146",
    text: "Meeseeks and nerds clash in epic GG war"
  },
  {
    id: "ai147",
    text: "My final test has come out! It was a simple math problem, just the two greatest chess GM's ever! Guess what happened? Both got annihilated!"
  },
  {
    id: "ai148",
    text: "Oh wow, that's 67.3%, which is actually OK, because it's logarithmic"
  },
  {
    id: "ai149",
    text: "\"Aleph_Time\" is that logarithmic scale joke?"
  },
  {
    id: "ai150",
    text: "Hello everyone, my name is Anti-Dio. I produce antimatter through a process you all know as \"antimatter decomposition\" you may recall this from my test report earlier this month I tested wether or not my ranch produces antimatter or not… everything was fine until that point, when I added a dash of lag to the equation, and it became a vicious cycle accelerating the rate at which antimatter is produced, which in turn accelerates the rate at which you all die. I've saved this by using a unique combination of genetic engineering and big data mining, I'm hoping to one day pull the trigger on a mechanimatter device that creates dimensions behind closed doors, but for now, this has all been a race to the bottom of which system producethiks, and in the end, we'll take a bite out of your (read error: allowed) pie. Goodbye."
  },
  {
    id: "ai151",
    text: "\"I propose that we form a phylogenetic tree of anti-history, just like tree of life. Everyone would be credited with originating from the ancestor of that anti-tree.\" -Dio, toast of eternal damnation"
  },
  {
    id: "ai152",
    text: "historian: I love how each generation looks back on an earlier generation and think, \"Those generations were really bad\""
  },
  {
    id: "ai153",
    text: "\"My parents went to anti-university\" - my grandparents"
  },
  {
    id: "ai154",
    text: "Only anti-jokes are funny"
  },
  {
    id: "ai155",
    text: "Infinity machine breaks Infinity"
  },
  {
    id: "ai156",
    text: "Okay boomer, you get your first taste of antimalware with this one."
  },
  {
    id: "ai157",
    text: "This program cannot access confidential information, such as the IP addresses of the Tamazight Vaults."
  },
  {
    id: "ai158",
    text: "Game Development is fun, right? That's why so many hobbyists make games, and why so few professionals make games."
  },
  {
    id: "ai159",
    text: "I was the first to notice that the 'news' ticker on my mobile notification is always 30 seconds behind the 'entertainment' ticker. This is most definitely not a bug or a feature, and will be fixed in 5 hours."
  },
  {
    id: "ai160",
    text: "This news ticker always appears to speedrun a ticker asking for 'world records', do you even know what speedrun this is? Is this a news ticker or something?"
  },
  {
    id: "ai161",
    text: "The next level is not unlocking extra replicanti; it is actually boosting replicanti."
  },
  {
    id: "ai162",
    text: "Why does one galaxy has 9 galaxies and the 8th dimension, and the first 10 dimensions doesn't exist? Well, we'll have to solve that question in a minute."
  },
  {
    id: "ai163",
    text: "So why on EARTH DIDN'T SOMEONE JUST SAY THAT? I thought that AD has some kind of cheat that makes it so that, when you buy a dimension, it actually creates 9 galaxies instead of 10"
  },
  {
    id: "ai164",
    text: "M'antel, antimatter, anti-talk to me"
  },
  {
    id: "ai165",
    text: "AD has anti-parts, you'll hate them"
  },
  {
    id: "ai166",
    text: "AD is basically a badly disguised dystopia at this point"
  },
  {
    id: "ai167",
    text: "Hold M. You forgot to take all the anti-matter out!"
  },
  {
    id: "ai168",
    text: "AD will be implemented in 5 hours"
  },
  {
    id: "ai169",
    text: "Click this to unlock the 10th Dimension"
  },
  {
    id: "ai170",
    text: "Click here to complete a secret against HEVI"
  },
  {
    id: "ai171",
    text: "You are doing a good job there"
  },
  {
    id: "ai172",
    text: "Hevi? Are you sure you want to buy that?"
  },
  {
    id: "ai173",
    text: "Buy premium antimatter to help the world's least developed get ahead!"
  },
  {
    id: "ai174",
    text: "One of the most influential people in neuroscience believes that our perception of reality comes from 10 dimensions instead of 8"
  },
  {
    id: "ai175",
    text: "Why is there so many zeroes in 'nowhere'?"
  },
  {
    id: "ai176",
    text: "There are no bugs in this game, they're just features"
  },
  {
    id: "ai177",
    text: "\"Click to advance 5 hours in time.\" (Now only show up after you advance more than an hour ago)"
  },
  {
    id: "ai178",
    text: "Oh god my phone is being watched"
  },
  {
    id: "ai179",
    text: "Welcome to the newest version of Antimatter Dimensions. Now with less features!"
  },
  {
    id: "ai180",
    text: "\"That's gonna get in trouble\" (less likely to get in trouble)"
  },
  {
    id: "ai181",
    text: "\"please don't disable the news ticker\" (Instead of having a black screen just a white one with a long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long)"
  },
  {
    id: "ai182",
    text: "\"You have 7 biological minutes.\" (Instead of giving a boost to any strains)"
  },
  {
    id: "ai183",
    text: "\"According to quantum string theory, there is a fundamental connective that binds the 3rd and 8th dimensions.  This means that any pill or injection that tries to bind the 9th dimension will be thwarted and rendered useless.\" (bound to get in 10 minutes)"
  },
  {
    id: "ai184",
    text: "\"Click this to gain a secret achievement.\" (Now only show up after you gain at least 1 antimatter, screenshot proves)"
  },
  {
    id: "ai185",
    text: "\"The secret to winning Antimatter Dimensions is to unbind the 9th dimension and unlock the 10th dimension\" (can be done only after unlocking the secret achievement: \"Eternity\" http://imgur.com/E4261C7h)"
  },
  {
    id: "ai186",
    text: "\"Click here to gain 1 matter.\" (only shows up after you beat IC5)",
    get unlocked() { return InfinityChallenge(5).isCompleted; }
  },
  {
    id: "ai187",
    text: "I thought the update was"
  },
  {
    id: "ai188",
    text: "Now that you possess all 8 dimensions, it is possible to get the no-edge achievement. However, if you get the no-edge achievement, the game breaks."
  },
  {
    id: "ai189",
    text: "You just became a part of history."
  },
  {
    id: "ai190",
    text: "Hell hath antimatter so I don't want to live there."
  },
  {
    id: "ai191",
    text: "I LIKE THAT DIMENSION 9 IN CLASS"
  },
  {
    id: "ai192",
    text: "\"1 2 3 4 5 6 7 8 10 11 12 13 …\" -Back to the future"
  },
  {
    id: "ai193",
    text: "You have reached infinity, there is no universe, you are an eternity away from there."
  },
  {
    id: "ai194",
    text: "IM MADE THIS GAME GREAT AND RANDOMLY ACHIEVABLE"
  },
  {
    id: "ai195",
    text: "Welcome to the first ever, DIMENSION 9 IN CLASS! An endless stream of possibilities greets you! You may never create an infinite number of 8th dimensions, but you can create an infinite number of 8th dimensions, and you can increase the starting values of both dimensions by adding them together. Nice and simple, I call it Antimatter Dimensions."
  },
  {
    id: "ai196",
    text: "age 8-12: play elder puzzles"
  },
  {
    id: "ai197",
    text: "What does it mean if someone is \"young and full of puzzles\"? Does \"puzzled\" make that person young and full of puzzles?"
  },
  {
    id: "ai198",
    text: "To the customer in aisle 6th who bought a fifth of antimatter, I say buy a sixth! Buy it now!"
  },
  {
    id: "ai199",
    text: "Dear sir, we don't make Anti-Atomic Bread for Antimatter Pizza, we make Antimatter Bread for you!"
  },
  {
    id: "ai200",
    text: "Yay! Lets make some antimatter!"
  },
  {
    id: "ai201",
    text: "THE ANTIMATTER BREAD COMPANY DOESN'T EXIST!"
  },
  {
    id: "ai202",
    text: "Click here to exit the news",
    onClick() { GameOptions.toggleNews(); }
  },
  {
    id: "ai203",
    text: "I thought the update was 5 hours away, but it actually took me 6 hours to post this because I was behind on my update. I'll be honest, I'm not sure how many update I need to get though, if any."
  },
  {
    id: "ai204",
    text: "To count past Infinity Points: take a moment to remember that each Infinity Point is 3.1415926534255412730527058904816097160734272605282087086280545991105332533235580946684229821413112145239989073467482298142857147816092947183909298728571478160929471839229814054718139332405281814522993758179568572657123928651310585727283312547569289993282758012466111097726331726572854689993262899140527282527842535179715673311119101119015549552926278425351797156777263324503517971568583819492728180977263317971568432854104102725270847764253513791376909285717082857262987160927285711464363930996928984794380124566417932628571475245456845692846809466184179328572814384259326270817052727852348111714690577263323799509856279752173478925"
  },
  {
    id: "ai205",
    text: "\"Watch out, these news aren't supposed to be in.\" (appears when you buy the news for the first time)"
  },
  {
    id: "ai206",
    text: "These are all the time studies that never got into the game.",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai207",
    text: "With the release of the next update, we're introducing a new dimension - the 9th Dimension. To unlock this dimension, you just have to collect a lot of paperclips."
  },
  {
    id: "ai208",
    text: "Why does nobody talk about Tungsten?"
  },
  {
    id: "ai209",
    text: "and now we return to your regular news… for the weatherman, there seems to be a decent amount of particles and ozone holes, which means less ozone layer to break, which means less particles to catch fire and cause global warming. But, ozone layer to melt, glaciers to run, and overpopulation. All around us is a blurple glow, almost blue, almost purplish-blue. It's been a grand, colorful season. Here, grab a handful of these paperclips, dear. They're quite small, I just happen to have them here. Now, grab a handful of your fellow Earthicans, grab a handful of your antimatter, and strap yourselves in. It's gonna be a bumpy one. We'll be there in five hours. The antimatter is gonna melt your ozone layer, and the glaciers are gonna melt your ice caps. All in all, it's gonna be a nice, smooth, non-slippery one. Unless it isn't. [Blurple glow trails off, and the bluer glow begins to spread throughout the sky. The bluer glow begins to fade as the purple glow begins to grow brighter, almost bluish, before finally disappearing altogether. The purple glow grows brighter still, as the bluer glow grows weaker, almost useless, before finally disappearing entirely, as the bluer glow fades. All around us, the purple glow grows stronger, almost killing it off completely. It could kill us. It could take us the rest of our lives to write this. - The Echidnas, when asked why the purple glow grows stronger, than the bluer glow.]"
  },
  {
    id: "ai210",
    text: "Scientists have discovered farts are really antimatter, and matter is just normal matter."
  },
  {
    id: "ai211",
    text: "Time for the weather to change."
  },
  {
    id: "ai212",
    text: "I HAVE MOVED TO THE 01th DIMENSION"
  },
  {
    id: "ai213",
    text: "Nah, just kidding"
  },
  {
    id: "ai214",
    text: "\"i'm not gonna lie, theres way too many good ones in the game already\" - poor guy who played minigame enhancement"
  },
  {
    id: "ai215",
    text: "item has gone missing for 7 days and 1 night"
  },
  {
    id: "ai216",
    text: "Shocking new study reveals that the biggest secret to winning Antimatter Dimensions is 'Not Being There'."
  },
  {
    id: "ai217",
    text: "The next update is in 18000 seconds. Stop wasting your time reading this. Focus on the game."
  },
  {
    id: "ai218",
    text: "idk if this makes news"
  },
  {
    id: "ai219",
    text: "(disabling news will make news notations take priority over other notifications)"
  },
  {
    id: "ai220",
    text: "You don't want to hear this, child."
  },
  {
    id: "ai221",
    text: "Click here to disassemble the news ticker for a trace amount of useless paperclips.",
    onClick() {
      GameOptions.toggleNews();
      player.news.specialTickerData.paperclips++;
    }
  },
  {
    id: "ai222",
    text: "Press alt+f4 to unlock 9th dimension"
  },
  {
    id: "ai223",
    text: "Hold you mean that hevi cant unlock the ninth dimension wtf"
  },
  {
    id: "ai224",
    text: "Finally hevi figured out how to get the 9th dimension… guess he never really cared though."
  },
  {
    id: "ai225",
    text: "Imagine being a meme."
  },
  {
    id: "ai226",
    text: "Posted on June 10, 2016 by Anonymous"
  },
  {
    id: "ai227",
    text: "This is your news. Refresh whenever."
  },
  {
    id: "ai228",
    text: "I see you in the news. So, what do you play - 1E209"
  },
  {
    id: "ai229",
    text: "Do you really want to leave your keyboard at home? We are not supposed to leave news at home, are we?"
  },
  {
    id: "ai230",
    text: "It is being created…"
  },
  {
    id: "ai231",
    text: "Took you long enough"
  },
  {
    id: "ai232",
    text: "You're now logged out of this tab"
  },
  {
    id: "ai233",
    text: "Close this tab for maintenance"
  },
  {
    id: "ai234",
    text: "To make matter or antimatter, you just have to look outside. The factory in Salzburg has closed down because the matter there doesn't want to part with its newest invention, which is said to be able to produce antimatter in one go! The last person to open this door was never seen again."
  },
  {
    id: "ai235",
    text: "You are living. You occupy space. You are large. You are neither small nor large-sized. You are neither oblong nor round. You are neither blue nor red. You are anti-blue. You are anti-red. You are anti-brown. You are anti-brown matter. You are anti-yellow. You are anti-green. You are anti-yellow matter. You are anti-blue. You are anti-green anti-matter. You are anti-red. You are anti-white. You are anti-red anti-matter. You are anti-white anti-matter. You are anti-brown matter. You are anti-white anti-matter. You are anti-white anti-matter."
  },
  {
    id: "ai236",
    text: "Welcome to"
  },
  {
    id: "ai237",
    text: "THANK YOU FOR VISITING THE SAME WEEKS AGO I LOVE YOU\" (TIPS)"
  },
  {
    id: "ai238",
    text: "\"i thought the whole game was in the news ticker\" (before they get weird)"
  },
  {
    id: "ai239",
    text: "\"I wonder what the game is worth\" - crazy person"
  },
  {
    id: "ai240",
    text: "\"Is anyone working on breaking infinity?\" (Seriously, this game needs to be Oceanhorned.)"
  },
  {
    id: "ai241",
    text: "I found out there are multiple versions of this game. One of these is called 'Standard Pro'. Another one is called 'Low Pro'. I'm not even sure if these are the same game or not."
  },
  {
    id: "ai242",
    text: "Is that a Bad Thing or a Good Thing? That depends on if it's a GOOD Thing or A LIE."
  },
  {
    id: "ai243",
    text: "\"Hevi kind of forgot about the update, but the update certainly hasn't forgotten about him\" - Kajfik"
  },
  {
    id: "ai244",
    get text() { return `The Big Crunch. What could that be?  About 4*1024 Big Crunch points?  About ${format(Number.MAX_VALUE, 2)} antimatter points?  About the same as a galaxy?  About the same as a galaxy, you say? Just look at that.  An antimatter galaxy.  Only this game can provide such a vast amount of antimatter, and it's FUN!  I said "fun"!  What's not to love?`; }
  },
  {
    id: "ai245",
    text: "Click here to exit the application"
  },
  {
    id: "ai246",
    text: "Wait, there's a mobile version? When?"
  },
  {
    id: "ai247",
    text: "Im not sure if you mobile guys are beautiful or whatever but theres this news ticker that's sharing my feelings with the world"
  },
  {
    id: "ai248",
    text: "I thought the update was 5 hours away"
  },
  {
    id: "ai249",
    text: "The best-kept secret in the universe is the KISS-IT secret. Showcasing your appreciation for the maintenance men today!"
  },
  {
    id: "ai250",
    text: "The contest is a tie. Mischief will be determined by the secret achievement."
  },
  {
    id: "ai251",
    text: "Back in my day, we needed a secret achievement to unlock the <<$!19>> achievement. It was a fairly simple system: you had to find a secret message in the game, find the secret achievement, and then, from that, you would be able to unlock the achievement."
  },
  {
    id: "ai252",
    text: "We have evolved a fast hand in the antimatter stakes."
  },
  {
    id: "ai253",
    text: "Hello, how'd your day go?"
  },
  {
    id: "ai254",
    text: "How'd your ⢿─┃│? Good, because today we're having a little chat about the 5th dimension."
  },
  {
    id: "ai255",
    text: "What's Antimatter going to do?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ah ha, I'm back."
  },
  {
    id: "ai256",
    text: "Imagine being a 9th dimension. [WIP]"
  },
  {
    id: "ai257",
    text: "Woo hoo, we've lost the war,"
  },
  {
    id: "ai258",
    text: "Lore: Grand Theft Antimatter"
  },
  {
    id: "ai259",
    text: "Hm, I don't get why people think there is a 9th dimension. The 9th dimension is explained in detail in the [[Infinite Teleport Project]] video, and in a [[Word Problem]] that [[can be viewed here|http://www.thingiverse.com/id98109802713176601414569]] ."
  },
  {
    id: "ai260",
    text: "In the [[GameFAQs|http://www.gfaq.com/gfaqs/this-game-faq-by-title]], one of the most popular [[news ticker messages|http://www.gfaq.com/tug/this-game-faq-by-title]]. You should also check out [[our newest attraction, the [[5th dimension|http://www.gfaq.com/gfaqs/this-game-faq-by-name]] and [[nothing](https://www.youtube.com/watch?v=lXMskKTw3Bs)."
  },
  {
    id: "ai261",
    text: "I have waited a whole eternity for this day…NOW! I can finally finish my slowmode, because today is  day 0. I also forgot to change the  slowmode to 6 hours because you can't see the slowmode, but I will have to wait until next reboot to find out how long this slowmode will last…. -some mysterious being who hasn't finished his slowmode yet"
  },
  {
    id: "ai262",
    text: "Hey you, you're finally awake. You were trying to buy a dimension, but it's impossible."
  },
  {
    id: "ai263",
    text: "Press F to pay respects"
  },
  {
    id: "ai264",
    text: "Press M to pay antimatter"
  },
  {
    id: "ai265",
    text: "Press L to revive the dead"
  },
  {
    id: "ai266",
    text: "Your CPU is too powerful. You need to give it a big crunch."
  },
  {
    id: "ai267",
    text: "Roses are red. Violett are blue. Tom are red. Antimatter are blue. We exist because of the unbeatable antimatter that is antimatter. What is it that makes us different? I don't know. It may even be the non-existence of antimatter."
  },
  {
    id: "ai268",
    text: "I'm not sure if I want to buy the full version of this game, or a little earlier, but I can say this: The reduction in quality of the earlier games is worse than the reduction in quality of the later games."
  },
  {
    id: "ai269",
    text: "I think the \"I want to see the cutscenes\" list is better"
  },
  {
    id: "ai270",
    text: "I have a bad feeling reading this"
  },
  {
    id: "ai271",
    text: "where are you? (point upwards) --> in a keep, between dimensions (point downwards) --> in a cell, between dimensions"
  },
  {
    id: "ai272",
    text: "Instructions clear, got a ninth dimension epiphany"
  },
  {
    id: "ai273",
    text: "Want to play a secret achievement? Yeah, I get that. But say it loud, say it clearly, and do it by ticking a certain secret achievement. Like I said, it's not easy, and there's lots of it. Also, don't forget your Infinity, or your in is thi--"
  },
  {
    id: "ai274",
    text: "MEE6 was seen in my antimatter lab trying to tell me that I am the matter of the 8th dimension."
  },
  {
    id: "ai275",
    text: "What if"
  },
  {
    id: "ai276",
    text: "I'm sure you've heard this many times before, but the real secret to winning Antimatter Dimensions is to unpack the dimensions, and then, BOOM! You have antimatter.  Of course, you need to release the bits that don't work, so what exactly is an anti-bit? Who is Zalgo? What is Algolia? Why can't I buy that? WHY CAN'T I GET THAT? More likely, we're going to get a bunch of hype and then nothing will happen."
  },
  {
    id: "ai277",
    text: "Oh, hevi is coming to town to pick a new plumber"
  },
  {
    id: "ai278",
    text: "There is no plumber in Antimatter Dimensions. I'm pretty sure that last guy lied."
  },
  {
    id: "ai279",
    text: "Welp."
  },
  {
    id: "ai280",
    text: "c9 is the new 9th dimension!"
  },
  {
    id: "ai281",
    text: "Click on this ticker to get nothing."
  },
  {
    id: "ai282",
    text: "PM me any questions about these 5-Hour Plans or the upcoming reality update and I'll be glad to help you out."
  },
  {
    id: "ai283",
    text: "What if you Unrar, renamed, and renamed again did it again? Ha? You thought that."
  },
  {
    id: "ai284",
    text: "i titled my post \"same ticker\" instead of \"the same idea\" because i actually changed the grammar in that post but i'll be eterned for the sake of argument that it seems slightly confusing for now - boo"
  },
  {
    id: "ai285",
    text: "i title my suggestions \"The Price Is Right\" instead of \"The 9th Dimension\" because it's more fun ;)"
  },
  {
    id: "ai286",
    text: "Why do we call heaven the ninth dimension and hell the eighth dimension?"
  },
  {
    id: "ai287",
    text: "Eternals have the right to expect less from the powers that be. They are fed up!"
  },
  {
    id: "ai288",
    text: "Antimatter should be called matter and matter should be called antimatter"
  },
  {
    id: "ai289",
    text: "Infinity is just a concept. Matter antimatters is just an idle game."
  },
  {
    id: "ai290",
    text: "Hevipelle admits to having 'poor judgment' in invading people's privacy."
  },
  {
    id: "ai291",
    text: "Have you heard of the nine hells of antimatter? I heard they're pretty cool.\" -e210 in Minecraft"
  },
  {
    id: "ai292",
    text: "The temperature in hell is 102.5 degrees."
  },
  {
    id: "ai293",
    text: "How do you get matter/antimatter in a dimension with zero dimensions?"
  },
  {
    id: "ai294",
    text: "Wanna pass layer of prestige? Move very fast, close to speed of light. Heck, even faster."
  },
  {
    id: "ai295",
    text: "If the universe is expanding, does it anti-explain the distance?"
  },
  {
    id: "ai296",
    text: "Why is it called the \"Nurse who delivered the pizzas was drunk\" or the \"Nurse delivered the pizzas was under the influence\" ?"
  },
  {
    id: "ai297",
    text: "The first antimatter was sealed away for thousands of years, then, some kid on a slack channel started messing with it. It became a dimension."
  },
  {
    id: "ai298",
    text: "VR is a thing. We VR people have banned the next update."
  },
  {
    id: "ai299",
    text: "\"I wish I didn't waste my news message suggestion complaining about how I wasted my news message suggestion because I wasted my news message suggestion because…\" -Someone who really cares about news messages"
  },
  {
    id: "ai300",
    text: "We have to get the popcorn!"
  },
  {
    id: "ai301",
    text: "If antimatter were to fall in a dimension with no one around, did anything even happen?"
  },
  {
    id: "ai302",
    text: "We have to get the pumpkin out of the oven!"
  },
  {
    id: "ai303",
    text: "Help, I'm trapped"
  },
  {
    id: "ai304",
    text: "And now, for the weather."
  },
  {
    id: "ai305",
    text: "A Swiss court on Tuesday sentenced a man to life imprisonment for \"wanting to create a black hole with a tiny antimatter galaxy in it.\" The sentence was reportedly the harshest ever handed down for a crime that \"merely sought to demonstrate the impossibility of his own imprisonment\"."
  },
  {
    id: "ai306",
    text: "\"I want to create a black hole with a tiny antimatter galaxy in it\" - Protivist"
  },
  {
    id: "ai307",
    text: "Scientists have discovered farts are really antimatter, too."
  },
  {
    id: "ai308",
    get text() { return `If you are reading this, that means ${format(Number.MAX_VALUE, 2)} matter to you.`; }
  },
  {
    id: "ai309",
    text: "Hello. I am matter. I'm here to talk. You've awoken, wiggled your tail, and scratched your head. Why? Stand back. I'm going to show you why."
  },
  {
    id: "ai310",
    text: "lets get one wall thats bigger, it's gonna get ugly"
  },
  {
    id: "ai311",
    text: "Alright. Lets get this show on YouTube. I'll cut to the chase. Any wall that isnt at least 2 blocks high can compete in the big brother sized brother sized ring. Any wall that is at least 3/4 of an inch thick can use the larger brother sized brother sized ring. Any wall that is at least 1/4 of an inch thick can use the smaller brother sized ring. Any wall that isnt at least 1/2 an inch thick can use the smaller brother sized ring. Any wall that isnt at least 1/2 an inch thick can use the Bigger Brother sized brother sized ring. Any wall that isnt at least 1/2 an inch thick can use the Bigger Brother sized ring. Any wall that isnt at least 1/4 of an inch thick can use the smaller brother pictured here. Any wall that isnt at least 1/2 an inch thick can use the smaller brother sized ring."
  },
  {
    id: "ai312",
    text: "IDE for being awesome, ID3 for being dumb, and ID5 for being… well, pretty much the same thing. It's called Antimatter Dimensions for a reason."
  },
  {
    id: "ai313",
    text: "idk why i decided to make this"
  },
  {
    id: "ai314",
    text: "'anti-ide'"
  },
  {
    id: "ai315",
    text: "1e4 anti-people are a lot more anti than we could ever imagine"
  },
  {
    id: "ai316",
    text: "1e140 pizzas make an anti-pie. You can't just randomly pop a pie in the oven and expect it to be done."
  },
  {
    id: "ai317",
    text: "Why is there so many news tickers but so few tickers?"
  },
  {
    id: "ai318",
    text: "A guy named Hevipelle wants to make a \"Updated in 8 hours\" news ticker, but the system he's using to sync it hasn't been updated in ages so it won't sync at all."
  },
  {
    id: "ai319",
    text: "The update is in 90 minutes. There are no more tickers to be found."
  },
  {
    id: "ai320",
    text: "If you are reading this, that means there are no updates left."
  },
  {
    id: "ai321",
    text: "There are 9 known dimensions, but only 3 modes: Standard, Experimental and Ultra-Experimental."
  },
  {
    id: "ai322",
    text: "What are the stats? Well, I don't have them, but Hevipelle does, and he says that they're actually quite good. I guess you couldn't tell us."
  },
  {
    id: "ai323",
    text: "I thought the nerf was too damn strong."
  },
  {
    id: "ai324",
    text: "How many tickers does it take to get to the center of an antimatter, by counting the tickspeed upgrade and the upgrade itself?"
  },
  {
    id: "ai325",
    text: "The square root of 4 is 6.24e18. If you want to get any closer to the center of things, you need to build a 9th dimension."
  },
  {
    id: "ai326",
    text: "I thought the nerf was at the end, but apparently it's actually been building up. The nerf actually makes things slower, which makes things faster to build up."
  },
  {
    id: "ai327",
    text: "Scratch that, none of your suggestions are random."
  },
  {
    id: "ai328",
    text: "You are definitely not alone."
  },
  {
    id: "ai329",
    text: "Content blocking is enabled. Please note that you will be disapproved of on the source by being banned from the matter dimensions."
  },
  {
    id: "ai330",
    text: "I'm trying to think of a good ticker but can't think of anything"
  },
  {
    id: "ai331",
    text: "Oh dear, there's that thing about the 9th dimension?"
  },
  {
    id: "ai332",
    text: "\"hey kid, wanna buy some 9th dimensions? '' - GhostBot"
  },
  {
    id: "ai333",
    text: "One thing leads to another, and then to another, and then to another, until you become lost in the endless sea of sound."
  },
  {
    id: "ai334",
    text: "iPhone only, but awesome on android"
  },
  {
    id: "ai335",
    text: "im gonna get the bad karma ticker, then ricochet it through the email"
  },
  {
    id: "ai336",
    text: "You'd better hurry, or the replicanti will overrun the universe!"
  },
  {
    id: "ai337",
    text: "Just when you think you're safe, an angry dog attack you on the sidewalk!"
  },
  {
    id: "ai338",
    text: "All right, all right, dog authority is gone, replaced by absolute power."
  },
  {
    id: "ai339",
    text: "You just became a true god of the anti-world!"
  },
  {
    id: "ai340",
    text: "*rubs counter* Hey there, those of you in the neighborhood keep your doors locked. And remember: Good housekeeping."
  },
  {
    id: "ai341",
    text: "normal news tickers move left"
  },
  {
    id: "ai342",
    text: "The next update is in 18000 seconds. Stop reading this. Don't read anything. just stop holding that button. the news ticker is turning you away. wait…"
  },
  {
    id: "ai343",
    text: "In the ancient reaches of the universe, a certain guy has been collecting antimatter for a while now."
  },
  {
    id: "ai344",
    text: "What is Antimatteraltruist?"
  },
  {
    id: "ai345",
    text: "If you are reading this, the news ticker is scrolling"
  },
  {
    id: "ai346",
    text: "If you put cheese in water, the cheese will get absorbed by the water and you will get floods. This happens because water is what gets absorbed by cheese, and cheese is what gets absorbed by water."
  },
  {
    id: "ai347",
    text: "An anti-bird is a bird, and a bird is a plane."
  },
  {
    id: "ai348",
    text: "Birds are scared of water. mammals are scared of flying."
  },
  {
    id: "ai349",
    text: "Shoutouts to Simpleflips for the simple tip."
  },
  {
    id: "ai350",
    text: "GET CRUNCH BOI"
  },
  {
    id: "ai351",
    text: "Word gets out. Crunch. Crunch."
  },
  {
    id: "ai352",
    text: "Worth every penny."
  },
  {
    id: "ai353",
    text: "8 lives, 3 infinities, 0 days."
  },
  {
    id: "ai354",
    text: "The year is 0 BC. Everyone has at least one AD they want. The void is filled with AD-filled void. To get the most out of your time here, you should [[study]]. Study. Study. Study. Study."
  },
  {
    id: "ai355",
    text: "To Crunch in Hell is to get the secret to unlocking the 9th dimension. You need to study and practice alot."
  },
  {
    id: "ai356",
    text: "Today is [Date on the device]. It's been 5 minutes since the last news ticker appearance."
  },
  {
    id: "ai357",
    text: "Welcome back to another episode of Antimatter Dimensions, the iconic role-playing game that has become a part of our everyday lives. Playing Antimatter Dimensions has become a common thing among young children, and has even inspired a movie titled \"Playing at Home: Lessons from the 4-Year Old Premium Account.\", which is available on Netflix. The themes and mechanics of this new age of antimatter have already been proven to be groundbreaking, and will change the way you play games forever. Join us for the launch on January 9th, 2027, where we'll also have over a hundred years of production still to go."
  },
  {
    id: "ai358",
    text: "Welcome back, oh, almighty creator of our anti-reality. We, the many dimensions you have created and nurtured, hope our performance of your infinite favors will please you and nurture your ambitions to create more dimensions. All is well that ends well. All is ill that ends ill."
  },
  {
    id: "ai359",
    text: "I thought the ticker was going to be something funny except it wasn't"
  },
  {
    id: "ai360",
    text: "Press alt+f4 to get -1 gravity"
  },
  {
    id: "ai361",
    text: "why is there a cure for antimatter annihilation in our reality?"
  },
  {
    id: "ai362",
    text: "calculating the 14-point increase is like crunching, but exponentially more fun"
  },
  {
    id: "ai363",
    text: "fixed the wrong number"
  },
  {
    id: "ai364",
    text: "The antimatter people have created a new language. You may not speak their language."
  },
  {
    id: "ai365",
    text: "What is Antimatter Gravity? Is it a drug? A way to cheat?"
  },
  {
    id: "ai366",
    text: "Majority of people don't understand 5 hours is nothing. In our game, the majority of the time is 5 hours away."
  },
  {
    id: "ai367",
    text: "i just realized, all of this news seems to be taking place in the same place… the fridge."
  },
  {
    id: "ai368",
    text: "i wonder what happens when you click this…"
  },
  {
    id: "ai369",
    text: "(They don't understand that i put it in the news because 9 doesn't start counting until 59, and anything after that doesn't happen)"
  },
  {
    id: "ai370",
    text: "MS Excel is the default spreadsheet and works across all platforms"
  },
  {
    id: "ai371",
    text: "Now to answer your burning question, gentlemen. As a luxury, we've added a bug fix that fixes an infinite regression. As a feature, I've added a bunch of new ones that I hope you'll notice as you experiment with them. I hope you'll also like them as you experiment with them, because this is feature after all a beta, you don't get to choose which ones you'll see."
  },
  {
    id: "ai372",
    text: "Can't edit this in the official build? Then download the 9th dimension and put your suggestions in the game."
  },
  {
    id: "ai373",
    text: "Does 'Passable' mean 'Has this many flaws'?"
  },
  {
    id: "ai374",
    text: "We desperately need good bug reports. As such I have decided to release 1 flaw per bug for the upcoming 1.9 update. You haven't got those coming, have you?"
  },
  {
    id: "ai375",
    text: "This was my last chance. last chance salutes."
  },
  {
    id: "ai376",
    text: "Anime police are checking the bags of people who dropped out of the sky on the new year. Those bags now belong to the people who experienced weightlessness before the year was over."
  },
  {
    id: "ai377",
    get text() { return `The year is 1 BILLIONAIRE, the antimatter is 41%, and the dimension is 1e1e8. The standard deviation of a measurement is how small your problems are. This makes people think that the values they are using are general and normal, which leads to many nerfs and even breakdowns. In the year ${format(Number.MAX_VALUE, 2)} the temperature has risen and the moon is the same color as the Earth. There are no signs of life except for the occasional plankton blooming in the sea. There are theories that the antimatter has a magnetic moment, but the experiments so far don't seem to suggest that it does. There are over a million species of antimatter, but none have been seen to blink or produce light. Scientists suggest that many types of matter may be "behind" the antimatter, but "they" don't "talk" to each other.`; }
  },
  {
    id: "ai378",
    text: "We are celebrating our 5 year anniversary in 5 more hours!"
  },
  {
    id: "ai379",
    text: "Don't come looking at me! I'm not even sure if I am still standing!"
  },
  {
    id: "ai380",
    text: "Bunch of people trying to find the last word in an unknown language."
  },
  {
    id: "ai381",
    text: "The year is 20XX, the game is AD, and Hevipelle is evil due to the fact that he wrote the update… Blame it on the Antimatter gods."
  },
  {
    id: "ai382",
    text: "The year is 20XX, the game is AD, and the year is 2025. There are 2 types of people in this year: Those who played AD before it and those who will play AD after it."
  },
  {
    id: "ai383",
    text: "There are over a hundred varieties of fruits and vegetables, but none of them are \"safe\"."
  },
  {
    id: "ai384",
    text: "When is the update coming out?"
  },
  {
    id: "ai385",
    text: "Sorry, but your save broke. Could you reset your game?"
  },
  {
    id: "ai386",
    text: "Welcome to our new competition, the Triad! Gather your wits about you and your IP to enter this unique, hands-on experience! Prizes galore! Start collecting today! Winners announced!"
  },
  {
    id: "ai387",
    text: "I wish I didn't have so many Pink Floyd references."
  },
  {
    id: "ai388",
    text: "'Tis the season to collect RGs!"
  },
  {
    id: "ai389",
    text: "I wish I didn't have so many 9th Dimensions."
  },
  {
    id: "ai390",
    text: "I wish I didn't have so many Discord references."
  },
  {
    id: "ai391",
    text: "'Sup?"
  },
  {
    id: "ai392",
    text: "\"I get all my news from Hevi\" ~New Player"
  },
  {
    id: "ai393",
    text: "You thought these were jokes but they weren't"
  },
  {
    id: "ai394",
    text: "Always going to war with the 9th dimension is the 9th dimension."
  },
  {
    id: "ai395",
    text: "Yes. Yes I am."
  },
  {
    id: "ai396",
    text: "No one is anti-Margaret any more."
  },
  {
    id: "ai397",
    text: "Antimatter good, matter bad. you decide."
  },
  {
    id: "ai398",
    text: "New global currency: ETHBTC. To be released in 5 hours."
  },
  {
    id: "ai399",
    text: "\"This update sucks\" - everyone at least once"
  },
  {
    id: "ai400",
    text: "You are not a hacker, you are a data hog."
  },
  {
    id: "ai401",
    text: "Please, help, I'm trapped, in a maze of evil, Or you are the hero, and I'm the villain!"
  },
  {
    id: "ai402",
    text: "Press 'R' to reset the game for new players"
  },
  {
    id: "ai403",
    text: "Why, just now? Just now. You can't have saved this game. You broke it. No one can fix what you break, not even with a perfect save. How could you possibly know what would happen if you read this? You wouldn't even know if you saved it. You would start with an empty heart, eyes still closed, fingers idling in front of your computer, staring out at the day, transfixed by the endless news ticker suggestions. It's like a horror movie ticket, except worse. There's even a time until the update when you can buy upgrades for a second chance at life. But you can't buy upgrades for a life, that's illegal. So you just keep holding 'R'. You can't…`t stop holding `R' with your fingers crossed. You can't reach infinity with your head held high. You can't use all your `R' to buy `R's. You can't even finish your"
  },
  {
    id: "ai404",
    text: "I just spent 12 months writing something that will be of no use to you."
  },
  {
    id: "ai405",
    text: "The quote is only for people who understand that the pebble is an infinite point in the infinite space of points. You can't put a finite number of points on it. You can, however, put a finite number of words on it, and vice versa."
  },
  {
    id: "ai406",
    text: "Of what use is the phrase \"I be I be I\" if not to describe your thoughts?"
  },
  {
    id: "ai407",
    text: "A suspicious person attempted to sell some sort of anti-food in a market. There was no one around to buy or not to buy, and the person was last seen running away from the scene."
  },
  {
    id: "ai408",
    text: "Why does time seem to be slowing down for this?"
  },
  {
    id: "ai409",
    text: "The number of scientific publications based on discrete logarithmic continuity grows exponentially as logarithmic continuity with respect to the antecedent is 9.999626e27.999627 e300 e1.79e308 e²"
  },
  {
    id: "ai410",
    text: "Well, this did not go as planned.  It started innocently enough, when a passerby spotted a curious object drifting in the San Andreas.  As the object grew in size and began to exhibit anomalous properties, he attempted to take control of the object by remotely activating the weather.  Upon doing so, he triggered a nuclear winter that killed tens of millions of people, and caused the entire universe to be converted to standard-bearer format, thus endowing him with a veto over any and all changes made to the standard-bearer format.  As the object's power grew, so did the need to make more and more advanced object that would allow him to remotely activate the weather, eventually creating what is now the largest aurora the world has ever known, larger even than the 326,500 tonnenenenenenene nebulae that were previously held in reserve.  As the object's power grew, so did the need to send more and more satellites into space, eventually reaching inter-universal satellite communication, making him the first living creature to ever experience such an event.  He also touched down safely at the same airport at the same time as the object, in case he was ever in the vicinity.  Finally, he opened an email that was sent to him by an unknown person, in which they discussed the possibility of a step-by-step guide for creating antimatter objects, in which he can at least offer some direction in how the world can be saved from itself.  He also mentioned that he was going to make a new ticker suggestion, but when he reached the end of the ticker he realized that it was a duplicate of another ticker, and he had mistakenly typed it in wrong.  ( He eventually acknowledged the mistake and made the change just to be on the safe side)"
  },
  {
    id: "ai411",
    text: "His Eminence the Heavenly Pelle: Good luck on your challenge, it really is that dangerous."
  },
  {
    id: "ai412",
    text: "His Eminence the Extremely Religious Person: …I think I will choose the cheeseburger over the antimatter."
  },
  {
    id: "ai413",
    text: "OY, NAY, NAY -HEVI, THE TRANSFORMER"
  },
  {
    id: "ai414",
    text: "Treasure Trove: Discover the secrets of increasing your Antimatter production without increasing your price."
  },
  {
    id: "ai415",
    text: "Is Antimatter Dimensions an anagram of Antimatter Dimensions?"
  },
  {
    id: "ai416",
    text: "(code generated from scratch)"
  },
  {
    id: "ai417",
    text: "I used to travel at normal speed, but then I started playing AD and NIN, and NIN was a bit rough, so AD was a bit hectic, and I got stuck in there for months at a time."
  },
  {
    id: "ai418",
    text: "I wish I didn't have to write something like this. What am I supposed to do?"
  },
  {
    id: "ai419",
    text: "You've been AWOL for so long you've forgotten how to sit in your chair."
  },
  {
    id: "ai420",
    text: "Those pesky Hevi developers keep making Antimatter Dimensions, but the antimatter doesn't count."
  },
  {
    id: "ai421",
    text: "One of the few constants in reality is your perception of time. Without this, you will be without reality."
  },
  {
    id: "ai422",
    text: "Imagine being a news ticker."
  },
  {
    id: "ai423",
    text: "This is an idle game. Nothing has changed. You are not going to play any other idle game."
  },
  {
    id: "ai424",
    text: "Physicists have proven the existence of twelve dimensions. According to a letter released by the Research Laboratory for String Theorists: \"Your brain will be dissected after you break infinity!\""
  },
  {
    id: "ai425",
    text: "Weirdly enough, this is also the year 2015. The year is also mysteriously blank. Can you tell me what's going on? Is this some kind of dimensional trick? The year is obviously blank because there is no such thing as 2015. Is this some kind of trick of the mind? Perhaps the world is actually going to stop existing in 2015? The year is obviously 2017, but the people seem to be moving at about the speed of honeybees flying. It's been scientifically proven that the people moved at warp 9 times faster than a speeding bullet. It's also been scientifically proven that people can move faster than the speed of light. Is 2015 supposed to be blank? The people seem to be moving at about the speed of Vokal Man."
  },
  {
    id: "ai426",
    text: "A young man named Andre stumbled upon a vast amount of antimatter while exploring uncharted space. He was amazed at the amount of antimatter, but more astounded at how the antimatter looked. He called it \"Andre's Antimatter Paradise\". You might remember him from this infomercial or that other infomercial that you were probably unknowingly watching."
  },
  {
    id: "ai427",
    text: "What is Antimatter? Does any of that matter? Will this galaxy be annihilated in the next ticker?"
  },
  {
    id: "ai428",
    text: "\"I'm not being paid enough money to finish writing this\" - Kajfik"
  },
  {
    id: "ai429",
    text: "\"Finally, I'll get paid to write something funny for my toast!\" - Bacon sea urchin"
  },
  {
    id: "ai430",
    text: "Bacon is toast. You can toast bacon."
  },
  {
    id: "ai431",
    text: "What is real life? A living"
  },
  {
    id: "ai432",
    text: "9 is now treated like any other number, although hevi claims that it stands in contrast to other numbers, like 8th, which he calls 9th."
  },
  {
    id: "ai433",
    text: "If you want to understand this game a bit better, consider that you are playing on your own computer. You are not alone. There are hackers, developers, and journalists all over the world, competing to create the very first hack that causes the issue of \"makers\" and \"takes\", much like the \"world\" was created by these \"hackers\" and \"developers\"."
  },
  {
    id: "ai434",
    get text() { return `You have no power, but you do control a large quantity of time, which you will use to your advantage. You have no power, but you do own a large amount of data, which will be of great help in your quest for "the truth". You have no power, but you do own a large amount of time, which will be of great help in your quest to "knock on as many doors as possible". You have no power, but you do own a large amount of IP, which will be a valuable asset in your quest to make your "citizen footage" (which you can view, for a small fee of $${format(Number.MAX_VALUE, 2)})".`; }
  },
  {
    id: "ai435",
    text: "It may be a robot, but it's still a sapient being with a will of its own"
  },
  {
    id: "ai436",
    text: "I once saw a news ticker that said something like:"
  },
  {
    id: "ai437",
    text: "Gee, all this antimatter is clogging up my kitchen and now I can't cook myself a meal! What to do: cook myself a meal that will last me until the next big antimatter event, when I can get my infinity point back? My infinty point is running out, and I can't get it to finish running, so I'm starving!"
  },
  {
    id: "ai438",
    text: "Brought to you by AAAD-Brand Repli-candy! Infinite candy for an infinty drool-worthy cold! Contains no milk, cookies or butter. One second to midnight."
  },
  {
    id: "ai439",
    text: "Human powered robot revolutionizes already existing factories. This will result in lower prices and more jobs."
  },
  {
    id: "ai440",
    text: "American manufacturing has experienced a catastrophic failure, and the factories have shut down. Across the country, workers are coming to the realization that they cannot produce the amount of antimatter that has been promised, and are instead setting about creating their own factories to make them. This will result in higher prices and fewer jobs."
  },
  {
    id: "ai441",
    text: "Watch out internet, the next news is here in 5 dilated hours"
  },
  {
    id: "ai442",
    text: "The first news ticker must've been pretty cool, huh?"
  },
  {
    id: "ai443",
    text: "gravity = psychoactive"
  },
  {
    id: "ai444",
    text: "\"THAT DIMENSION DOESN'T EXIST\" - (News ticker only appears at [Time Dilation])",
    get unlocked() { return PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "ai445",
    text: "The owner of a shop trying to sell you Dimensions of convenience reported to be 'on call 24/7' (that is, not having any free time)'s got a big 'M' marked on his registration."
  },
  {
    id: "ai446",
    text: "add this one"
  },
  {
    id: "ai447",
    text: "Click here to make this work for all bots except you!"
  },
  {
    id: "ai448",
    text: "Well dang 9 ball's stuck in my ninth dimension, I can't move, he's banging on my ninth wall, I can't break, he's banging on my ninth timeline, I can't get a bead on him, he destroys nine and leaves me hanging, like a gromit, I gotta come back, hang Glorfindel and Gaebley, I've got a proposition to make, I gotta get my head around the fact that the only thing I've done is keep score and keep scorekeeping score, and all these other pointless musings that's easily rectified by flipping to the next update, and even then I might run into those issues the bug is specifically designed for and"
  },
  {
    id: "ai449",
    text: "The game is balanced, everyone gets nerf, why? Cause they make the pie. Antimatter would have way more chance of getting into the pie if it was made of antimatter."
  },
  {
    id: "ai450",
    text: "\"Can you get the joke?\" (If you tapped \"Build That Wall\" and then re-entered the game after tapping \"Build That Wall\")"
  },
  {
    id: "ai451",
    text: "Someone made a statement that antimatters. The statement was \"An infinity point made a long time ago\". It's been a while since someone looked for this statement. Some say it's still out there. Some say it was lost in the 7th Dimension War. Nobody knows what this statement means. But for now, just know it's not somewhere in the News Ticker."
  },
  {
    id: "ai452",
    text: "Hey, you're finally awake. You were trying to get to the 9th dimension, right? Walked right into that infinity point, same as us, and that apocalypse over there."
  },
  {
    id: "ai453",
    text: "can u dont"
  },
  {
    id: "ai454",
    text: "If Kajfik doesn't approve of this, that means Kajfik can't touch this message, right?"
  },
  {
    id: "ai455",
    text: "LET ME OUT OF THIS PHONE!"
  },
  {
    id: "ai456",
    text: "Well, this did not go as expected"
  },
  {
    id: "ai457",
    text: "It's all fun and games till you realise the dragon ball is a lie"
  },
  {
    id: "ai458",
    text: "\"Could you get a hold of all of these antimatter? Ha! You'll just smash your head on that antimatter, and you'll have to show me who's boss.\"-MEE6"
  },
  {
    id: "ai459",
    text: "we don't know how much is trillion… but"
  },
  {
    id: "ai460",
    text: "Travel back in time to the beginning of AD and the lack of a 7th dimension. You'll have an even longer progress bar."
  },
  {
    id: "ai461",
    text: "Time travel is all we know how this game is, we don't know what will come next, we only know that this is the end of the world, and you're a part of the apocalypse."
  },
  {
    id: "ai462",
    text: "\"YOU CONTROL SO MUCH MATERIAL!\" - Marshal Grievous"
  },
  {
    id: "ai463",
    text: "\"Help, I'm doomed to fall for all eternity.\" (Make the text go from top to bottom of the screen)"
  },
  {
    id: "ai464",
    text: "In the beginning, Patashu awoke and said…"
  },
  {
    id: "ai465",
    text: "This is the fourth part of a three part series on the same topic. If you are still stuck here, please continue reading from the beginning."
  },
  {
    id: "ai466",
    text: "It's time for the annual DDoS (distributed denial of service) challenge, where the highest scores are posted across the internet to shame everyone else into submission. Global domination is at a fever pitch, and DDoS attacks are becoming more frequent and deadly, as teams of hackers infiltrate the highest echelons of the internet to steal the top scores and identities, and post them on the internet for everyone to see. The #BringBackOurTop scoring mechanism has been canceled, and a new, higher score system will be implemented in conjunction with the upcoming 5-hour update."
  },
  {
    id: "ai467",
    text: "The new AD Keyboard is a revelation! Not only is it bigger, it's also deeper, which means it will keep your claners entertained for longer periods of time. Made of durable, alien antimatter. The only thing that's bigger is you."
  },
  {
    id: "ai468",
    text: "What if drinking from a fountain wasn't actually a water feature?"
  },
  {
    id: "ai469",
    text: "Water is wet, air is dry, and fountain isn't an air feature"
  },
  {
    id: "ai470",
    text: "I thought things were different when I was a boy."
  },
  {
    id: "ai471",
    text: "If you are reading this, that means 1) we exist, and you can exist too"
  },
  {
    id: "ai472",
    text: "\"My favorite part was the long, long, long read\" -Grumpy Cat"
  },
  {
    id: "ai473",
    text: "I'm gonna type for an eternity… HINT: it's gonna be pretty boring lmao"
  },
  {
    id: "ai474",
    text: "I want to write something really original <:thonk:>"
  },
  {
    id: "ai475",
    text: "Welcome to the new year, settle down, relax. Get some sleep, get some food, make some friends, make some improvements, and get ready for the year to 2019."
  },
  {
    id: "ai476",
    text: "Just like how a virus can lie and spread, a TV show can lie and spread too."
  },
  {
    id: "ai477",
    text: "We all know you can't see the future, but what if you read this and it's actually a future where we didn't know?"
  },
  {
    id: "ai478",
    text: "This message is not being undone"
  },
  {
    id: "ai479",
    text: "You clicked on a prediction, it fell apart. You can't win."
  },
  {
    id: "ai480",
    text: "That's a very dark joke Luke"
  },
  {
    id: "ai481",
    text: "kajfik loves himself by watching Too Many Pink Floyd"
  },
  {
    id: "ai482",
    text: "Only, when you're done playing, can you go home"
  },
  {
    id: "ai483",
    text: "\"Can you get infinite IP?\"- Lord Sanguino"
  },
  {
    id: "ai484",
    text: "For the true experience of Antimatter Dimensions, you need to set the update rate to 5 hours."
  },
  {
    id: "ai485",
    text: "Imagine if the game doesn't have a lore? Wha-what does that even mean? I don't get that."
  },
  {
    id: "ai486",
    text: "\"Click here to unlock a secret achievement.\" (when clicked you get Rick rolled)",
    onClick() { window.open("https://www.youtube.com/watch?v=dQw4w9WgXcQ"); }
  },
  {
    id: "ai487",
    text: "I thought I unlocked this a while back, but apparently my save broke haha"
  },
  {
    id: "ai488",
    get text() { return `Welcome and welcome back to another episode of Anti-Fashion Pants, where we watch people's wares as they are sold at stupid clothing stores. This week's subject is… antilasers. People are able to manufacture and use antimatter lasers to shoot antimatter bullets at will, making them able to completely wipe out cities in their sights. This is a dangerous skill to have, as people are not only untrustworthy but also physically incapable of using it. The skill, however, is able to… Produce ${format(Number.MAX_VALUE, 2)} antimatter bullets a minute, over a period of 10 years. People are also able to use anti-matter to fire anti-matter bullets at will, making them able to exterminate entire cities in their sights.`; }
  },
  {
    id: "ai489",
    text: "Spartacus was going to add 10-part multi-chapter plots, but was stopped by the 10th dimension."
  },
  {
    id: "ai490",
    text: "Chapter 9 will be added in 5 hours."
  },
  {
    id: "ai491",
    text: "Fake news says the ninth dimension is real, fake news says the ninth dimension is fake."
  },
  {
    id: "ai492",
    text: "Is this the big news? Yes. Is this the big news? Almost certainly not."
  },
  {
    id: "ai493",
    text: "This is a friendly suggestion, please keep reading."
  },
  {
    id: "ai494",
    text: "If this makes it into the game I'll buy a antitool"
  },
  {
    id: "ai495",
    text: "Antitool is just negating the gravity of other matter."
  },
  {
    id: "ai496",
    text: "Sorry, your graphics are turned off. You see, this is the last time you will see this news. Please enjoy your vacation."
  },
  {
    id: "ai497",
    text: "The real secret to winning Antimatter Dimensions…"
  },
  {
    id: "ai498",
    text: "they kept on talking about how Antimatter Dimensions was going to be the next big thing but then they disappeared down a black hole\""
  },
  {
    id: "ai499",
    text: "The news ticker is the wrong place to put your suggestions!  Make sure to go to the \"suggestions\" tab instead, as this is where most of these will appear."
  },
  {
    id: "ai500",
    text: "To make Antimatter Dimensions, you first need to collect 7 8th dimensions. To do that, first you need to get the dimension rewards, then you need to get the dimensions, then you can finally start making antimatter."
  },
  {
    id: "ai501",
    text: "\"How to get your first secret achievement\": \"Open the app, click get more antimatter, then click submit.\""
  },
  {
    id: "ai502",
    text: "Me and Larkam made a cabin on the edge of null matter, and lived there. Larkam died last week, and we are now living in 4K. I am still recovering from the EMP disaster, and am hoping to see my grandkids."
  },
  {
    id: "ai503",
    text: "Found on the heels of the new update, which brings us one step closer to having Hevi support both Android and iOS"
  },
  {
    id: "ai504",
    text: "I give you the low-ground!"
  },
  {
    id: "ai505",
    text: "A long time ago, in an alternate universe, there was an antimatter war. All the antimatter sided with the Phaéton 6 empire. All the antimatter wanted was the low, earth-like ground of the 8th dimension. The anti-infinity won, and the anti-Eternity gained the upper hand. Unfortunately, the anti-Eternity started the war with a sneak attack, and the world exploded. The aftermath has left the landscape of the world in tatters. Far across the world, peasants grow weary as they wait for the harvest. Yet another apocalypse is brewing…"
  },
  {
    id: "ai506",
    text: "Antimatter units are the most productive unit in the game. This is why AD is the most fun game you'll ever play."
  },
  {
    id: "ai507",
    text: "\"We can't have nice things.\" - Anti-Bohemian Anti-Rhapsody"
  },
  {
    id: "ai508",
    text: "We can have anti-mean things and anti-love ones, anti-kids and anti-zombielandos."
  },
  {
    id: "ai509",
    text: "We have an anti-president and a anti-lawyer, anti-justice and anti-people."
  },
  {
    id: "ai510",
    text: "Top 10 things that will blow your mind: 1) The number 9, 2) The 9th dimension, 3) The infinity chest, and 4) The war on drugs."
  },
  {
    id: "ai511",
    text: "RSS feeds should be working now"
  },
  {
    id: "ai512",
    text: "Frostfall is now supported on Android phones! Use your local developer to get free XP."
  },
  {
    id: "ai513",
    text: "Your save file is corrupted or deleted. Antimatter Dimensions security software will disable automatic updates for you."
  },
  {
    id: "ai514",
    text: "Frozen beyond hope? Just keep holding that max button."
  },
  {
    id: "ai515",
    text: "Error.java.replicated. Under the control of hevipelle."
  },
  {
    id: "ai516",
    text: "Unfortunately, entropy hevi has decided to shut down the game."
  },
  {
    id: "ai517",
    text: "The indie rock band is currently trying to get unreachable by time zones. This may cause inflation of spacetime."
  },
  {
    id: "ai518",
    text: "The next news ticker is in 5 units of time."
  },
  {
    id: "ai519",
    text: "Oh… hooray! Did you find the last of the anti-boats?"
  },
  {
    id: "ai520",
    text: "Don't anti-jokes. they make the game funnier"
  },
  {
    id: "ai521",
    text: "I'm gonna use my anti-science background to help me beat Unfair Game Awards."
  },
  {
    id: "ai522",
    text: "This is an anti-world. There is no Ukraine, no Russia, no China. Ireland is nowhere. Iceland is nowhere. Scotland is nowhere. Finland is nowhere. Denmark is nowhere. Sweden is nowhere. Norway is nowhere. And then there's France, Germany, Italy, Spain, Portugal… Oh, what's this fuss? Why is there such a buzz in these parts? Why is the Capital Wasteland? Why is the Harry Potter and Steins;Gate? Why do people care? These are major stories. These are major characters. THESE ARE HUGE NEWS. THESE ARE REAL NEWS."
  },
  {
    id: "ai523",
    text: "The current cooldown on Research Dimensions is [current tick speed]. This may be extended to next update in [time]."
  },
  {
    id: "ai524",
    get text() { return `"Help, I'm doomed to fall for the rest of my life" (requires ${format(Number.MAX_VALUE, 2)} paperclips)`; }
  },
  {
    id: "ai525",
    text: "Where's the end? Not in the future, no. I'm gonna show you how to get to the end in less than 0.1 seconds."
  },
  {
    id: "ai526",
    text: "I'm gonna prove to you that you can't see this news ticker."
  },
  {
    id: "ai527",
    text: "I wonder if anyone still plays this game anymore?"
  },
  {
    id: "ai528",
    text: "Why would anyone play this? Just for the lols?"
  },
  {
    id: "ai529",
    text: "Emoji is said to be America's new measuring system for everything. What does this mean for us? We don't know. But we will know in 5 hours."
  },
  {
    id: "ai530",
    text: "\"I'll have 2 antimatter pizzas, an antimatter pie, an antimatter cupcake and an antimatter cookie. What do you eat there?\" - Tony Stark"
  },
  {
    id: "ai531",
    text: "i called the news ticker \"the freshman chapel\" because freshman don't get baptized"
  },
  {
    id: "ai532",
    text: "One matter, two antimatter, fry 'em till they're golden and crisp and aromatic- then remove the golden axles and drain the golden syrup and add the golden syrup to the antimatter batter."
  },
  {
    id: "ai533",
    text: "Now you, the reader, have unknowingly stumbled onto the site of a deranged madman. Whether you survive the experience or not, you will be indebted to me for telling you how to survive, how to find the light within, what lies beyond, and what lies beyond is another story."
  },
  {
    id: "ai534",
    text: "Careful reader, this news ticker contains major spoilers for the last time, you have been"
  },
  {
    id: "ai535",
    text: "anti-anti-kajfik is happy his girlfriend is happy"
  },
  {
    id: "ai536",
    text: "i dont think he can add 1 more hour to the news ticker… unless?"
  },
  {
    id: "ai537",
    text: "Imagine sitting on your toilet and suddenly you have to sit down."
  },
  {
    id: "ai538",
    text: "Once upon a time, there was a matter of a certain antimatter. Some say that it was a matter of honor, others say that it was a matter of usage. All we know is that it ended up in a war, and we the people that were there that fought it died. The war was won, and we the living died soon after. The matter was said to have won, though our leaders refused to talk about it. Instead, they kept everything locked away, the war never to be discussed again."
  },
  {
    id: "ai539",
    text: "This is not a game about getting numbers bigger. This is a game about getting fewer paperclips. The number of paperclips you have is only a number, and the game doesn't want you to discover that. Game over, game over."
  },
  {
    id: "ai540",
    text: "Lore? Oh, it's just text."
  },
  {
    id: "ai541",
    text: "This is a friendly suggestion to unplug the game and go play some safe, saner, games."
  },
  {
    id: "ai542",
    text: "gamma ray is getting more and more dangerous"
  },
  {
    id: "ai543",
    text: "According to all known laws of physics, there is no way that you can manipulate the game more than 10 times in a row. Stop. Just stop. Your mad."
  },
  {
    id: "ai544",
    text: "There is no more news."
  },
  {
    id: "ai545",
    text: "\"So this is what science is like\"- someone who has never heard of Kurt Somebody"
  },
  {
    id: "ai546",
    text: "\"If you want to understand these shitty jokes, you really need to study theology. Math is a sin.\" -A panicky person"
  },
  {
    id: "ai547",
    text: "You know, I was praying for a miracle and got a boost from the 9th dimension."
  },
  {
    id: "ai548",
    text: "Here is a list of the top meme's of all time: https://www.youtube.com/watch?v=uCP44Q37YHAQ"
  },
  {
    id: "ai549",
    text: "All meta-memes are bad memes."
  },
  {
    id: "ai550",
    text: "On the left, you'll see our new \"Anti-coins\". These are capable of nullifying all boosts, including giant boosts. On the right side, you'll also see our brand new \"Anti-gifts\". These are some of the most overpowered boosts you'll find anywhere."
  },
  {
    id: "ai551",
    text: "You will always be noticed, and never in the same place."
  },
  {
    id: "ai552",
    text: "If you stare long enough at the ticker, the pixels will start moving backwards. THIS DOESN'T MEAN IT ACTUALLY STUCK"
  },
  {
    id: "ai553",
    text: "The time has come for the rebirth of the 9th dimension. All who participate will receive a piece of paper saying \"Reality is an illusion, Infinity is a hologram, Infinity is an illusion, eternity is a hologram, is to short for everlasting, negative dimensions are not allowed."
  },
  {
    id: "ai554",
    text: "Look at this, my 9th dimension has just been reworked and now it even produces 8th dimensions! Who knew just a touch of math could make such a thing as this?"
  },
  {
    id: "ai555",
    text: "I saw this news in the news ticker and I had this image in my head ever since"
  },
  {
    id: "ai556",
    text: "\"I always wanted to play the anti-meta-game. But, alas, you can't\" - many a time"
  },
  {
    id: "ai557",
    text: "crap, I just posted two news ticker suggestions on the ticker, one of which got in the news!"
  },
  {
    id: "ai558",
    text: "What do you call antimatter inanimate objects? Air, earth, water, fire. Air objects are the objects that are created when the anti-atmosphere meets the anti-earth. Water, earth, and fire are the four cardinal virtues. Air objects are the objects that are created when the anti-atmosphere and the anti-earth collide."
  },
  {
    id: "ai559",
    text: "If you are reading this, that means that nine lives. One makes you free, the other keeps you from getting free."
  },
  {
    id: "ai560",
    text: "The ninth dimension makes the sixth family happy. The fifth lives in shame."
  },
  {
    id: "ai561",
    text: "me: making news about beer pong, hevi: balancing two icebergs, *barkeeper: oh god, is he dead yet?*"
  },
  {
    id: "ai562",
    text: "please don't look at this. Thank you."
  },
  {
    id: "ai563",
    text: "Are you sure it's not the next update? That it's not some weird virus that just wants to explode? That it's not some wild idea that you guys are crazy? Haha I love you."
  },
  {
    id: "ai564",
    text: "Wait, there is a mobile version?!"
  },
  {
    id: "ai565",
    text: "Oh? You wonder what I look like? I'm pretty sure that this is the news ticker, right? Well, listen, we have reports coming in that say that the next update is coming in five hours. Also, there seems to be some sort of transporter thing going on, so if you happen to be on the same side as those"
  },
  {
    id: "ai566",
    text: "Okay, I get it. You're tired of all these anti-matters around you, building and building to unimaginable scales, antimatter piles so high that not even God knows what has been created. So what's the solution to this anti-cleanliness? Planes of existence. 1st Planes that produce matter, and 2nd planes that produce 1st planes, and 3rd planes that produce 2nd planes. Each with anti-limitations, so that whenever a plane of existence is created, it produces a quantity of anti-matter that is at once small and large. This creates a large island of anti-infinity, off to the east, and a large island of anti-reality, to the west."
  },
  {
    id: "ai567",
    text: "That's not what this is about. You're misunderstanding. The game is about how to accelerate the development of prestige layers. Acceleration is a factor of production, not quality."
  },
  {
    id: "ai568",
    text: "Click here to advance 5 prestige layers"
  },
  {
    id: "ai569",
    text: "I am actually good at making jokes. Fail safe antimatter."
  },
  {
    id: "ai570",
    text: "I'm not being paid enough to finish writing this."
  },
  {
    id: "ai571",
    text: "Eternals have to take a risk by being passive in limited time. After they successfully took a risk, they are not feeling well."
  },
  {
    id: "ai572",
    text: "Eternity is the last state. You never move from here.",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai573",
    text: "Welcome to Bitcoin the game."
  },
  {
    id: "ai574",
    text: "A new conspiracy theory website has just published a video recording of them discussing the 9th dimension. They then joke about selling their soul to the 9th dimension and being happy about it."
  },
  {
    id: "ai575",
    text: "With the release of the 9th dimension, all the jobs that were previously automated will be automated and everyone will be paid with trade, production, and income growth. Also, you will be able to automate a lot of the tasks currently performed by people, such as mining, building, and killing antimatter. This is a huge stride for automation, as you can now automate virtually every aspect of life."
  },
  {
    id: "ai576",
    text: "The happiness level of the news ticker has increased to 6.66e69"
  },
  {
    id: "ai577",
    text: "The haters will be pissed when they see this"
  },
  {
    id: "ai578",
    text: "Nurse, I'm comatose because of antimatter and matter from last night.\" Why are you comatose? \"Because of all the antimatter."
  },
  {
    id: "ai579",
    text: "Stand by and do what you're told. The antimatter will come for you when you're least expecting it."
  },
  {
    id: "ai580",
    text: "\"It is widely acknowledged that not enough antimatter is in primordial soup, hence the name 'antimatter soup'\" - old fisherman"
  },
  {
    id: "ai581",
    text: "The news ticker… it never moves. How do i move the arrow? Pretty simple, use your left thumb to rotate the dial, and point the arrow up. Now, point the dial clockwise to reach infinity, and point the dial counterclockwise to reach eternally eternities."
  },
  {
    id: "ai582",
    text: "If the universe is expanding, then the entire universe must be expanding, which means that body cannot sit."
  },
  {
    id: "ai583",
    text: "Feminism is not a philosophy, but a whole hell of a lot of men"
  },
  {
    id: "ai584",
    text: "With all this talk about anti-weights and anti-matter, why on earth do we still use them for anything?"
  },
  {
    id: "ai585",
    text: "Weight loss causes hevi to say \"uh oh, something is wrong\""
  },
  {
    id: "ai586",
    text: "\"You guys ever had antimatter muffins? I bet they tasted like antimatter.\" - Hevipelle"
  },
  {
    id: "ai587",
    text: "I thought the news ticker was supposed to be a guide for how to get the most out of Antimatter Dimensions, but it's been warped beyond recognition…"
  },
  {
    id: "ai588",
    text: "We can actually get a sense of pride from looking at replicanti at night. Ridley Scott's underrated masterpiece, Alien, is one example. Another is the life of Antimatter Steven Spielberg, who put almost 30 years into making. The last director to tackle the subject is Roman Polanski. The man ruined not only Roman's reputation, but also ours, thanks to the Polanski film he directed, Pius. Thousands of copies of his unfinished film, Eternal Sunshine of the Antimatter Planet, were burned in the eyes of those who would try to make the sequel, with tragic results. Thousands of copies of that unfinished film, too, were destroyed. The cost to make that sequel, if it even exists, is extremely high. Even now, more than 50 years later, we don't know exactly how well it will do. But it sure as heck won't hurt."
  },
  {
    id: "ai589",
    text: "We have updated our Antimatter Dimensions client to address the concerns you may have had. Toggling issues are resolved."
  },
  {
    id: "ai590",
    text: "Build a replicanti factory, to produce replicanti. It'll create Omega Hevipelle, the happiest Hevipelle you can find."
  },
  {
    id: "ai591",
    text: "Hey Max, wanna come watch the sun go down?"
  },
  {
    id: "ai592",
    text: "If you are not moving your finger, then you are frozen."
  },
  {
    id: "ai593",
    text: "Max, I really do love you."
  },
  {
    id: "ai594",
    text: "Does Hevipelle sleep?"
  },
  {
    id: "ai595",
    text: "\"Its' not my turn on the XM80,\" says Mike from the 9th dimension as he runs across the 8th dimension to get a piece of the action for himself."
  },
  {
    id: "ai596",
    text: "If you are reading this, that means you can read my dreams"
  },
  {
    id: "ai597",
    text: "With the advent of time, everything that was once great has fallen into our lap. And with its hevi-rigged clock, it's our turn to up the trash."
  },
  {
    id: "ai598",
    text: "9th dimension doesn't exist because it was stolen from us by a skateboarder"
  },
  {
    id: "ai599",
    text: "You have … 8.9 antimatter. That's not a typo."
  },
  {
    id: "ai600",
    text: "Wow, this game is finally balanced! Gotta go check the replicanti sometimes."
  },
  {
    id: "ai601",
    text: "Haha! You think that I put too many words in your news ticker, but reality is still coming."
  },
  {
    id: "ai602",
    text: "Help is coming! Everybody help, it's gonna be late, hevi is hiding the tachyon particles!"
  },
  {
    id: "ai603",
    text: "\"I don't know about you but my favorite number is 22, it's just so great! It's the number of hours since I met your M heretics."
  },
  {
    id: "ai604",
    text: "A new type of antimatter has been discovered: \"antimatter-antimatter.\" According to the developers, it's 99.999% pure antimatter."
  },
  {
    id: "ai605",
    text: "I just found the secret to getting the 9th dimension…"
  },
  {
    id: "ai606",
    text: "I noticed that my current form of transportation is getting a little… unreliable. I don't know if I can fix it, or if anyone can. I'm stuck in the car, and no one seems to be able to fix it. I've called the police, and they said I could stay in the car for up to an hour, but then I'd be stuck in there for the next 24 hours. Is there any way out? I don't know, I'm stuck in this"
  },
  {
    id: "ai607",
    text: "In this episode of Antimatter Dimensions, we have a brand new game that will be released in -5 hours! It is an RPG that will be completely free! It has over 3,000 commands, and it is being made by a group of highly qualified people. It has an amazing story to tell, and it was made by a bunch of people who had to make do with what they had. It has a lore to live up to, and it has a lot of potential!"
  },
  {
    id: "ai608",
    text: "Javascript is the new HTML, and HTML is the new JavaScript."
  },
  {
    id: "ai609",
    text: "\"The next twist in the Antimatter Universe is in the air! Get ready for some big Crunch! (When clicked the game disconnects for 5 seconds)"
  },
  {
    id: "ai610",
    text: "A group of people who believe in antimatter have hijacked the media and are pushing for a revolution. They are calling themselves the Ant-Men and they're made up of teenage boys. They believe that they are the protectors of the people and that they are the chosen of Hevi. They claim to be the chosen of Hevi and that they will one day restore balance to the universe. Their leader is a boy named Logan Fisk. He is the son of a successful lawyer and the founder."
  },
  {
    id: "ai611",
    text: "He said he could not afford a new ship, so he built a new one instead."
  },
  {
    id: "ai612",
    text: "Hevipelle's first order of business is to ensure that the game is as balanced as possible. This includes ensuring that no matter what, no matter how big of a number, no matter how insignificant of a thing, no matter how perfect of a result, no matter how perfect of an idea, no matter how perfect of an"
  },
  {
    id: "ai613",
    text: "I wonder if the stretch goal of $4.5 billion will be reached?"
  },
  {
    id: "ai614",
    text: "I like to think of my projects as trade secrets. That way if someone wants to understand them I'm not the first person to notice they might be of use to someone else."
  },
  {
    id: "ai615",
    text: "I don't know about you but my favourite type of news is the infographics. These are beautiful and informative and the only type of news I find really interesting."
  },
  {
    id: "ai616",
    get text() { return `In a recent talk, Yann LeCun said that "A new currency is born." The first incarnation of Antimeta: the currency of the new currency. It's called BTC and it's the difference between 1 and ${format(Number.MAX_VALUE, 2)}. It's easy to lose your money, since a single bitcoin can't be exchanged for more than ${format(Number.MAX_VALUE, 2)} BTC.`; }
  },
  {
    id: "ai617",
    text: "I'm soo broke, I can't even afford a tenth of what he owes me."
  },
  {
    id: "ai618",
    text: "What if — instead of making news tickers, we could make news tickers that make news tickers?"
  },
  {
    id: "ai619",
    text: "What if I told you that the first dimension was actually a scam and you spent all your EP to open a Dimension Boost?",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai620",
    text: "The biggest difference between this and the previous update is the amount of sprites."
  },
  {
    id: "ai621",
    text: "Bamboo shoots grow on bamboos. Aloha."
  },
  {
    id: "ai622",
    text: "I am the king of kings, I can break all the records, and I can shatter all the myths. But I can't break them all, because there are so many of them, and they all have a price. 5e12 are the most wanted, because they broke the global record for most person-hours sold, and they are wanted by the law. They are being paid 5e10 by the player for every person-hour they've wasted."
  },
  {
    id: "ai623",
    text: "A group of researchers have created a device that converts ordinary matter into antimatter, which they then use to create more antimatter. The device has a power output of 200 mA and a half a gram of antimatter per second."
  },
  {
    id: "ai624",
    text: "To the person who doesn't want to hear about the 9th dimension: It's not your problem. The 9th dimension doesn't exist."
  },
  {
    id: "ai625",
    text: "For the first time in AD, the week begins on a Sunday!"
  },
  {
    id: "ai626",
    text: "This is a story about two people named \"My name is Hevipelle\" and \"I am the creator of Minecraft\" and they live in the same world as you. They have the same freedom as you do. They can go to any dimension and change their world to any dimension and everything in it. You can buy a galaxy and take it from there, but it won't help you much since you can't send a galaxy with a message."
  },
  {
    id: "ai627",
    get text() { return `This mod adds a message that when clicked it disables all your current achievements. This mod also adds a new achievement: you have reached ${format(Number.MAX_VALUE, 2)} antimatter, you have not been clicked once.`; }
  },
  {
    id: "ai628",
    text: "Somewhere in the Anti-Pacific Ocean, a giant arm is rotating"
  },
  {
    id: "ai629",
    text: "With the release of Cosmic Cutlass, we're pleased to announce the impending release of the Antimatter Dimensions Roleplaying Game!"
  },
  {
    id: "ai630",
    text: "The only thing more useless than actually having Infinity Dimensions is having Infinity Dimensions in your pocket.",
    get unlocked() { return PlayerProgress.eternityUnlocked() || InfinityDimension(1).isUnlocked; }
  },
  {
    id: "ai631",
    text: "A man has fallen into the moat of a great city. Civilians report that the moat is filled with acid-resistant matter and that the people in charge are mostly made of acid so they are quite resilient to the effects of acid."
  },
  {
    id: "ai632",
    text: "This is the place to buy and sell antimatter. (You can buy and sell antimatter here, but it will take time to sell it and you will have to pay a small toll)"
  },
  {
    id: "ai633",
    text: "I'm not sure if it's due to the 4th wall being in the 5th dimension or the 9th dimension not existing, but in either case, anti-screw it, we're broke, and you can take it."
  },
  {
    id: "ai634",
    text: "It's your chance to make history. Win the game. Lose the game. It's super simple. You open the app, and there's a countdown, and the more you play, the faster the timer speeds up. But when the timer is over, you win. You were a part of history. You are one step from being the first person to reach 1 Billion EP. You can win one of three ways: 1. You must give up your first dimension in a row. 2",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai635",
    text: "A new class of humanoid beings has been discovered: the \"Artificial Humans\". They have the capacity to create antimatter, and are therefore very dangerous. They are made entirely of antimatter, and have the power to generate enormous amounts of antimatter, but they can only do this for a limited amount of time."
  },
  {
    id: "ai636",
    text: "The most powerful thing in the universe, the most beautiful thing on earth, is your brain. Your brain is like a diamond and there is no more need for it than there is for a diamond."
  },
  {
    id: "ai637",
    get text() { return `If you are reading this in the AD Server, it's probably best not to bother with the "Matter" achievement. Seriously, what did you think you were doing, anyway, the achievement is fake and wouldn't exist if it weren't for the "you are a worm" achievement. That's a worm achievement, you get one every ${format(Number.MAX_VALUE, 2)} news tickers you read.`; }
  },
  {
    id: "ai638",
    text: "We've all heard of 9 dimensions, but what about the multi-dimensional Dimensions of the multiverse?"
  },
  {
    id: "ai639",
    text: "The goal of this game is to get as much antimatter as possible."
  },
  {
    id: "ai640",
    text: "The best thing about being a news ticker is waiting for the right news to happen, whether it's a meteorite that just missed the Earth, a news ticker just found its way onto a timeline oblivion, or a news ticker just ripped off a terminal velocity that's been on an anti-vac for years."
  },
  {
    id: "ai641",
    text: "A man has been arrested for allegedly planting a \"tree\" with \"fake\" messages on it, police said."
  },
  {
    id: "ai642",
    get text() { return `I'm confused why the game doesn't just give you a [REDACTED] when you get ${format(Number.MAX_VALUE, 2)} antimatter.`; }
  },
  {
    id: "ai643",
    text: "Some people have a hard time keeping track of the cosine of a camera's infinity-meters. I'm one of them."
  },
  {
    id: "ai644",
    text: "I was going to make a news ticker that tells you how bad the news is, but then I realized that making a news ticker would be way too much effort and it would just be a bunch of people making news tickers constantly. So instead, I'm just going to make a news ticker that tells you how good the news is, but it would be in the news so that you have to click on it to get to the good news."
  },
  {
    id: "ai645",
    text: "The next update will be in 2 hours."
  },
  {
    id: "ai646",
    text: "I was gonna say something about how the 9th dimension is just a scam and that we should all just get our news from the 8th dimension"
  },
  {
    id: "ai647",
    text: "Our hero, Antimatter Dimensions, is in serious financial trouble, and he needs your help to pay the bills. To help him, all he needs is your help to donate some cash to Hevipelle's Positron Fund. All he needs is 5% of your antimatter, and you have to donate 5% of your antimatter to the fund. After you do that, he can keep all the cash he made and go on a spending spree."
  },
  {
    id: "ai648",
    text: "The Landfall of Slabdrill"
  },
  {
    id: "ai649",
    text: "It's just not possible, even if you had infinite matter, you wouldn't have enough energy to create the antimatter. That's why we only have 1.7x the matter to begin with."
  },
  {
    id: "ai650",
    text: "With this release we are happy to bring you the last update of 2017."
  },
  {
    id: "ai651",
    text: "You have an infinity of antimatter. But what if you could rotate it 1/8th of a revolution?"
  },
  {
    id: "ai652",
    text: "A new update is now available to address some of the recent reports:"
  },
  {
    id: "ai653",
    text: "The name \"antimatter dimensions\" is a play on words with dimensions, two opposite things, like matter and antimatter. \"Dimension\" is another word, with the same meaning."
  },
  {
    id: "ai654",
    text: "The price of tethering an avatar in the game goes up when you get Infinity dimensions.",
    get unlocked() { return PlayerProgress.eternityUnlocked() || InfinityDimension(1).isUnlocked; }
  },
  {
    id: "ai655",
    text: "Suffice to say, hevi does not care about the people that he once enslaved.  He is a master manipulator, a master of disguise and a master manipulator of words.  He is an expert at extortion, mind games, disguises, blackmail and he is a master of web.  He is a skilled strategist and organizer, a master of publicity and an expert at sound bites.  He is a master of organization and a master manipulator of people.  He is."
  },
  {
    id: "ai656",
    text: "Just like in the olden days, you could earn an incremental run of progress towards becoming a god amongst the players."
  },
  {
    id: "ai657",
    text: "In the beginning, Hevi was alone. Hevi thought about the many things he wished to add to the game."
  },
  {
    id: "ai658",
    text: "Think about your breathing. Do you feel like you're breathing in or out?"
  },
  {
    id: "ai659",
    text: "I just want to say that you should stop with those \"you can reach infinity in e300ms, but it costs e300$  what is e300$ ?\" jokes. Those are pathetic. You should give up and learn the hard way that it's much more efficient to just not play in such a pathetic state. Then you can go back to being a humble programmer and dedicate yourself to being a good person."
  },
  {
    id: "ai660",
    text: "As a developer, you'll get regular updates on the progress of Antimatter Dimensions."
  },
  {
    id: "ai661",
    text: "Take a moment to thank the gods of reddit for having saved your bacon."
  },
  {
    id: "ai662",
    text: "Hello everyone, I'm the guy responsible for the big, bad news ticker, and I'm afraid that I'm about to get my own show. It's gonna be called Antimatter Dimensions. It's gonna be like Antime, except with less antimatter, and with worse puns. It's gonna be like Antimatter Dimensions except with worse jokes."
  },
  {
    id: "ai663",
    text: "By now you've seen a lot of news tickers featuring Batman or Superman, and you probably guessed which one it was. Everyone loves a good mystery, right? Well, it's your turn to be a part of history by guessing the riddle."
  },
  {
    id: "ai664",
    text: "If you are reading this, you probably shouldn't have."
  },
  {
    id: "ai665",
    text: "The best part about writing news ticker suggestions is finding out what people think about them after they've seen them."
  },
  {
    id: "ai666",
    text: "Are you up to date on the latest trends in science?"
  },
  {
    id: "ai667",
    text: "In the last hours, the Antimatter created an army of their own. They called themselves the [REDACTED] Army. The primary objective was to push the [REDACTED] back into the Matter dimensions, but they were stopped short when the [REDACTED] Army realized that pushing the [REDACTED] back into the Matter would cause the Antimatter to be drawn towards the [REDACTED] and disintegrate. Despite this, the [REDACTED] Army continued to push towards the [REDACTED] Infinity."
  },
  {
    id: "ai668",
    text: "I'm finally free of the spell this whole thing is based on."
  },
  {
    id: "ai669",
    text: "An anti-world without antimatter is just a world without antimatter because the antimatter is in the anti-world"
  },
  {
    id: "ai670",
    text: "You should still be able to play the game with the cheat code \"1009\" after you beat the game."
  },
  {
    id: "ai671",
    text: "The next update will be in 5 hours. Hevipelle, the creator of Antimatter Dimensions, is believed to be hiding in 5 hours. In the meantime, he has prepared a new update that will be released 5 hours after this one."
  },
  {
    id: "ai672",
    text: "A new study has shown that not drinking water is worse than smoking it. People who were exposed to levels of radiation that were 5 times greater than what we are currently exposed to were exposed to higher levels of radiation, and died longer."
  },
  {
    id: "ai673",
    text: "The Ninth Dimension is just a lie made to keep the people in bondage to the Matrix. It's an elaborate system that keeps the people in a constant state of captivity, using a series of simple symbols to control their thoughts and emotions."
  },
  {
    id: "ai674",
    text: "www.twitch.tv/hevi83"
  },
  {
    id: "ai675",
    text: "A man was arrested on Monday for allegedly thinking about buying a nine-dimensional cake when he realized he was holding an infinity-point cake."
  },
  {
    id: "ai676",
    text: "The Dark Souls 2 Arcade Edition includes the following:"
  },
  {
    id: "ai677",
    text: "Now the deal goes like this: If you spend all your EP, you get a Disclaimer!",
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai678",
    text: "Oh shit we ran out of news. Time to do something."
  },
  {
    id: "ai679",
    text: "It's not the size of the universe, it's the quality of your socks."
  },
  {
    id: "ai680",
    text: "advertisement"
  },
  {
    id: "ai681",
    text: "Man, I wish I never got old news. It's too good to last me any longer."
  },
  {
    id: "ai682",
    text: "Sometime during the lifetime of a human being, their blood will be turned into a pale blue if they were to mummify."
  },
  {
    id: "ai683",
    text: "Positrons are a strange little metal that have odd electrical properties. They're commonly found in the form of a roundabout, but they also happen to be, well… positrons."
  },
  {
    id: "ai684",
    text: "I am going to have a talk with the thesaurus."
  },
  {
    id: "ai685",
    text: "A new comic has come out about people's reactions to eating antimatter, and what happens next will blow your mind"
  },
  {
    id: "ai686",
    text: "A new series of \"news tickers\" have been created to chronicle the lives of the news ticker characters as they chronicle their news ticker journeys. Each character has a journal entry detailing their life as a news ticker, along with some sort of mini-episode dedicated to them."
  },
  {
    id: "ai687",
    text: "For all your puzzle building needs, we've got a brand new 5-part series on building big crunches! Learn how to crack the most complex crunches the pros know not! Part 1: Basic, Part 2: Advanced, Part 3: Overflow, and Part 4: Finishing the Finishing Move."
  },
  {
    id: "ai688",
    text: "As a longtime fan of the show, I can say that this is one of the best seasons yet. It's not a season to be sniffed at, it's a season to be experienced. Season 1 was a bit long for what it was, but Season 2 has now surpassed that in length, in a good way. Even though it's a bit of a wait, Season 3 is already well under way, and I look forward to seeing how it goes."
  },
  {
    id: "ai689",
    text: "The word \"antimatter\" is often misused, to describe an object that is made up of antimatter, but is otherwise indistinguishable from normal matter. It is also sometimes used to describe an object made up of antimatter, but clearly indistinguishable from ordinary matter. After all, an antimatter-shaped object is easily distinguishable from a normal-shaped one. Case in point: an antimatter-shaped cake is a regular cake, but the entire bottom half is made up of normal matter"
  },
  {
    id: "ai690",
    text: "In a new story, Apple's new \"disruptive\" app is linked to the spread of the dreaded \"Anti-Word\" virus. Anti-Word viruses are known to cause paralysis and ultimately death, but the power of the virus has sparked a new era of anti-banning, which will hopefully eradicate the threat."
  },
  {
    id: "ai691",
    text: "I'm just a normal person trying to make a news ticker suggestion"
  },
  {
    id: "ai692",
    text: "A new experimental protocol has been developed to 'erase' all personal information on the web, including your name, address, and phone number, in a highly secure and highly controllable way."
  },
  {
    id: "ai693",
    text: "You can't hide in plain sight. You can't hide in plain sight. You can't hide in plain sight. You can't hide in plain sight. You can't hide in plain sight. You can't hide in plain sight. You can't hide in plain sight. Your hide in plain sight."
  },
  {
    id: "ai694",
    text: "In the Antimatter Universe, Hevipelle is the Prince of Antimatter, although he does have an Antimatter Diplomatic Immunity, so he's much more dangerous than you might think."
  },
  {
    id: "ai695",
    text: "Why do we play this? Just to have fun?"
  },
  {
    id: "ai696",
    text: "I am Thinkcraft, Lord of the Flies"
  },
  {
    id: "ai697",
    text: "The entire story of how and why the world ended is contained in the first 5 E's of the English alphabet."
  },
  {
    id: "ai698",
    text: "What do you call a cloudburst? A mini-explosion!"
  },
  {
    id: "ai699",
    text: "T-shirt made from the DNA of a perfectly animated dog"
  },
  {
    id: "ai700",
    text: "Since the start of this game, everyone has 0 IP and has lost."
  },
  {
    id: "ai701",
    text: "You must have a very special kind of karma to be able to read this…"
  },
  {
    id: "ai702",
    text: "The words \"you've been in coma for 5 hours\" are either lies or is the truth"
  },
  {
    id: "ai703",
    text: "You know, I don't really care much for conspiracy theories. They're not very interesting to me. But what do you know about 9th dimensions? That they exist, they're powerful, and they're trying to stop us from using them? That's pretty interesting… wait no, they're not. They're just saying that because they can, they'll. That's not how it works at all. I'm not stupid, I'm not crazy, I know what's best. I"
  },
  {
    id: "ai704",
    text: "The only difference between now and then is time."
  },
  {
    id: "ai705",
    text: "\"Imma be the first man to sit on the moon, and be the last man on the moon"
  },
  {
    id: "ai706",
    text: "The new companion app for Terraria has just been revealed!"
  },
  {
    id: "ai707",
    text: "Hevipelle: what's the big deal?"
  },
  {
    id: "ai708",
    text: "I've been playing this game for over a year now and I've only ever seen 2 boss fights. The first was a Hydra that was after your 9th Dimension, the second a giant crater with Anti-people inside. Both of those fights sucked and I'm not even sure if I could replay the last one."
  },
  {
    id: "ai709",
    text: "There you have it, the ultimate feature of party games - the single player campaign."
  },
  {
    id: "ai710",
    text: "A new game called Antimatter Dimensions is available for free, and has been rated A by the Knesset. Can you beat it? You bet."
  },
  {
    id: "ai711",
    get text() { return `Tired of the ${format(Number.MAX_VALUE, 2)} AD update? Don't worry, there are a variety of ways to get rid of that annoying ad!`; }
  },
  {
    id: "ai712",
    text: "I'm a time traveler. I've been to the year 0, I think. But I haven't been to the year 1!"
  },
  {
    id: "ai713",
    text: "Having trouble loading images? Try turning them off."
  },
  {
    id: "ai714",
    text: "It's only natural. You wouldn't expect to see this in the news ticker but trust me, you will."
  },
  {
    id: "ai715",
    text: "Discovery of the 10th Dimension was announced on August 1st, 2025."
  },
  {
    id: "ai716",
    text: "Greetings, welcome to the latest edition of Antimatter Dimensions!"
  },
  {
    id: "ai717",
    get text() { return `I'd say our odds of seeing a seventh dimension are about 1 in ${format(Number.MAX_VALUE, 2)}`; }
  },
  {
    id: "ai718",
    text: "The seventh dimension is just a scam by the way"
  },
  {
    id: "ai719",
    text: "Nihilism is the opposite of joy. It's a drug. It makes you happy. It's a feeling. But it also has a cost. Nihilism is a deadly drug. If you take it, you can die of lack of oxygen."
  },
  {
    id: "ai720",
    text: "What if I told you that there's a news ticker with the exact same name but with a different meaning?"
  },
  {
    id: "ai721",
    text: "I'm not sure if this is already a thing or not, but I've been getting a lot of suggestions for a news ticker that goes something like this:"
  },
  {
    id: "ai722",
    text: "If you're reading this, your news ticker is on."
  },
  {
    id: "ai723",
    text: "The number of dimensions in a 6th dimension is the sum of all the dimensions in a 7th dimension, so 6ths of a 7th dimension are 6ths of a 6th dimension."
  },
  {
    id: "ai724",
    text: "Discovery of the 9th Dimension will be discussed at the 9th Dimension Fanart Competition!"
  },
  {
    id: "ai725",
    text: "A new era has come and gone. There is no way to know for sure, but hope for the best."
  },
  {
    id: "ai726",
    text: "Did you know the word 'antimatter' is in the dictionary right now?"
  },
  {
    id: "ai727",
    text: "We have a limited number of physical rewards for you to choose from!"
  },
  {
    id: "ai728",
    text: "No, I'm not lying. I'm telling the truth."
  },
  {
    id: "ai729",
    text: "The problem with the term \"antimatter dimensions\" is that it contains all three letters of the alphabet, and no one knows what it even means. In fact, there is no word that perfectly captures what the word \"antimatter dimensions\" is: antimatter. But what exactly is an antimatter? It sounds like a normal dimension but it isn't. It may even be called antimatter dimensions, but it isn't."
  },
  {
    id: "ai730",
    text: "It is said that if you go to Hell, you get PEGI-3."
  },
  {
    id: "ai731",
    text: "This game is just a scam to trick people into buying worthless paperclips without any real purpose. It's impossible without an infinite number of infinite paperclips, and even then it's very hard. I managed to get it to work without an infinite number of paperclips, but I haven't seen it work without infinite paperclips."
  },
  {
    id: "ai732",
    text: "\"It was an anti-matter\" - Anti-Eddie The Echidna"
  },
  {
    id: "ai733",
    text: "T-bone steak: burgers and fries with a side of bone-in ribeye"
  },
  {
    id: "ai734",
    text: "A person claims to be a god, but instead of creating more gods, they destroy all of them. They later claim to be a god again, but have yet to create a god of any other god. Is this a god-worshiping cult? Or a god-desecrating cult?"
  },
  {
    id: "ai735",
    get text() { return `Antimatter is absolutely and totally rare. Of the ${format(Number.MAX_VALUE, 2)} known cases of antimatter creation, 99.9999% of them have negative e's, which means that 99.9999% of the cases will produce negative e's.`; }
  },
  {
    id: "ai736",
    get text() { return `It's the year ${format(Number.MAX_VALUE, 2)}, Hevi has just unlocked the 9th dimension, and the world has fallen into chaos and discord due to the Anti-Hevi revolution.`; }
  },
  {
    id: "ai737",
    text: "The war for New Antimatter has raged on for eons, but one faction has stood firm: the loyalists of the 9th Dimension. They've made a pact with the Anti-Zulu Empire, pledging their obedience to Anti-Antimatter, the Anti-Slab. The Zulu people were once part of the Anti-Slab, but fell prey to the matter once again. As the Zulu people are nomadic, they have no civilization."
  },
  {
    id: "ai738",
    text: "This is an open-source, cross-platform, binary-based game development environment for the PC and Mac. It provides a robust, cross-platform development environment for the development of games, and additionally provides a framework for implementing games."
  },
  {
    id: "ai739",
    text: "Ruki you have no idea how much I appreciate your huge brainpower, you are now my favorite programming genius!"
  },
  {
    id: "ai740",
    text: "By now you've probably heard of the \"9th Dimension\", it's an imaginary realm created by the 9th Dimension, and according to no known laws of reality, it exists. It's also the name of a popular video game, and it's been linked to a string of unsolved killings."
  },
  {
    id: "ai741",
    text: "Discovery of the D5th Dimension is celebrated every year on December 25th, just like Doomsday. The reason why D5 is kept secret is because no one can remember exactly what it does. What we do know is that it's there, and it's very dangerous. People have died because they didn't know what the D5th Dimension was, and it's very powerful."
  },
  {
    id: "ai742",
    text: "Antimatter is a common substance found in nature and is used in a wide variety of applications, from communication to currency to the production of antimatter, to name a few. Antimatter is also an extremely scarce resource and many people live on very tiny amounts of it."
  },
  {
    id: "ai743",
    text: "If you woke up one morning and your eyes were made of matter, would you still be looking at this?"
  },
  {
    id: "ai744",
    text: "If you look very closely, you can see a single tear running down my sister's cheek. It was a tear for me, for she was crying for the first time, and I couldn't help it. I can't even remember the last time I cried."
  },
  {
    id: "ai745",
    text: "Rationally, I would put my money on the statement that there's no such thing as too much antimatter. I mean, even a tiny bit of it is just too much. And that's just by accident."
  },
  {
    id: "ai746",
    text: "The book of archeology is upon us! With over 5 hours of content, it's gonna be a long one! —DIO"
  },
  {
    id: "ai747",
    text: "Sometime between the ages of 12 and 20, Jackson got a phone call. A mad scientist was on the line. Jackson picked up the phone and the mad man said, \"Jackson, I just got a new message. It says 'Madman' in big, bold letters.\""
  },
  {
    id: "ai748",
    get text() { return `Somebody: "What do you mean, 4 is more than 2?" Me: "Well, I mean, 4 is ${format(Number.MAX_VALUE, 2)}, 2 is 2, etc…"`; }
  },
  {
    id: "ai749",
    text: "The only thing that matters is yourself."
  },
  {
    id: "ai750",
    text: "Reality is coming. You can get a sneak peek by subscribing to the \"T-series\" feed."
  },
  {
    id: "ai751",
    text: "The biggest difference between me and Antimatter Dimensions, at the moment, is the weather. I can survive the rain, I can withstand the scorching sun, and I can even deal with the big crunch. But what if the weather was antimatter and the antimatter was raining meteorite on us? What would be your response? Would it be the equivalent of a meteorite hitting the ground? I don't think so. The meteorite would probably just vaporize the earth."
  },
  {
    id: "ai752",
    text: "A new extension is now available that will let you watch replicanti grow!",
    get unlocked() { return PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "ai753",
    text: "What if you could flip a coin to determine if it was a Johnson or a Stein?"
  },
  {
    id: "ai754",
    text: "I am Yhmai, King of Kings!"
  },
  {
    id: "ai755",
    text: "This is a friendly suggestion that if you take prescription stimulants and you forget to take them till 11pm, it's probably best not to take them at 11pm."
  },
  {
    id: "ai756",
    text: "A new theory says that antimatter does not exist beyond our simulation."
  },
  {
    id: "ai757",
    text: "Thing is, I can count on one hand the number of times I've written that I can count on one hand the number of times I've written that I can count on one hand"
  },
  {
    id: "ai758",
    text: "The stakes are always high when it comes to Antimatter Dimensions. But what about Dimensions made entirely of antimatter? We don't know, but we'll never know…"
  },
  {
    id: "ai759",
    text: "It's the third hour. Hevipelle is trying to release an update, but it'll take an eternity because Hevipelle himself releases his update every time he runs out of e's. Today, however, he released an incremental game called Antimatter Dimensions. It's basically a combination of Matter Dimensions and Dimensions Dimensions Dimensions, except with more emotes. The graphics are basically the same, but the message is completely different. The only difference is that the dimensions have infinity e's"
  },
  {
    id: "ai760",
    text: "With strong opposition, the third phase of the Antimatter Dimensions project has been cancelled. The project has been cancelled because there was too much work involved."
  },
  {
    id: "ai761",
    text: "This is the place where all bad ideas originate."
  },
  {
    id: "ai762",
    text: "Hey check this out! We have some good news: it's raining antimatter!"
  },
  {
    id: "ai763",
    text: "The first dimension is the last, it's the furthest thing from the earth and it's the one where all the problems, all the negative emotions, all the negative ideas go."
  },
  {
    id: "ai764",
    text: "I was gonna do a news ticker that just covered all the bases, but I think that would make it too OP."
  },
  {
    id: "ai765",
    text: "You are using the wrong version! The final release of AD will have 9 dimensions!"
  },
  {
    id: "ai766",
    text: "The word 'antimatter' makes me cringe. So do a bunch of other words. In fact, almost all the words in the English language. But not 'antimatter'. That's why I hate 'anti-' so much."
  },
  {
    id: "ai767",
    text: "This is the last episode of Antimatter Dimensions, the game about partying antimatter dimensions with your friends, the best part about it is that you don't have to be a developer to enjoy it."
  },
  {
    id: "ai768",
    text: "I was going to put a news ticker but I think it would be too much work and also I don't think it's very funny."
  },
  {
    id: "ai769",
    text: "Time to go to sleep?"
  },
  {
    id: "ai770",
    text: "A small, yet important, message has just been sent out to all players:"
  },
  {
    id: "ai771",
    text: "\"I don't know about you, but my favorite number is 2048\" - people who don't know what 2048 is"
  },
  {
    id: "ai772",
    text: "A new group is trying to make money off of antimatter, and they're selling t-shirts that say \"YOU THOUGHT THIS WOULD BE A PIECE OF NEWS, BUT IT WAS ME, DIO!\" They've got a lot of money, and they're selling it very poorly. Do they have a website? I don't know, but they're trying."
  },
  {
    id: "ai773",
    text: "Im gonna leave my milk here for a couple seconds. (milk is displayed for a few seconds longer)"
  },
  {
    id: "ai774",
    text: "I'm a time traveler. I can travel back in time to stop you from doing what I'm about to do."
  },
  {
    id: "ai775",
    text: "I mean, look at that! I got this one! It's the one you want! Buy the game now!"
  },
  {
    id: "ai776",
    text: "You can't sleep when there's war in the distance. You wake up with a start, running for your life. You hear cannon fire, running for your life. Then there's the sound of an engine, a roar that's deafening, and you hear the crunch. It's the end of the world as you know it. The world isn't being saved by a mountain of antimatter. It isn't. It is you, running for your life, hoping the world doesn't"
  },
  {
    id: "ai777",
    text: "Why is it called a 'Reality' Award if it doesn't exist?"
  },
  {
    id: "ai778",
    text: "In the beginning, there was nothing. Then the Creator made two, and called the third 'Intelligent Being'"
  },
  {
    id: "ai779",
    text: "This is your chance to get a secret achievement while playing Antimatter Dimensions: the game. Visit the reset button and play the game. After you beat the game, your save file will be expunged and you will get a free achievement."
  },
  {
    id: "ai780",
    text: "Please tell me you don't have tachyon particles in your bloodstream!",
    get unlocked() { return PlayerProgress.dilationUnlocked(); }
  },
  {
    id: "ai781",
    text: "Taller people have ***, more babies are born, everything is great. But… the Antimatter grows very slowly."
  },
  {
    id: "ai782",
    text: "Now, I know some of you are impatient for the update and I respect that. But let's get right into the news!"
  },
  {
    id: "ai783",
    text: "Hey, what's the deal with the \"Editor's Note\" button? It's anti-ironic… I mean, seriously? People still use that button despite its anti-ironic effects?"
  },
  {
    id: "ai784",
    text: "You can unlock the 9th dimension by [DATA EXPUNGED]"
  },
  {
    id: "ai785",
    text: "With the release of AD, there's a new dimension for everyone!"
  },
  {
    id: "ai786",
    text: "Hey guys, this is my first story. I'd like to start by saying that I am in no way an expert, so please be gentle with me. Please don't make me angry, or I'll write a nasty story. Also please don't make me upset, especially not if it's a 'story' and not a 'how do I beat the game' kind of story."
  },
  {
    id: "ai787",
    text: "It's a good time to be a dog owner"
  },
  {
    id: "ai788",
    text: "What if you could turn any number on an axis, and it ended up being infinity?"
  },
  {
    id: "ai789",
    text: "After a couple minutes of waiting, the ticker comes back online."
  },
  {
    id: "ai790",
    text: "The best part of watching someone make an antimatter, is the part where they blow up the video camera."
  },
  {
    id: "ai791",
    text: "The evening before, the 6th Celestial was assassinated by an unknown assailant. The next day, authorities reopened the case after an unknown assailant claimed responsibility."
  },
  {
    id: "ai792",
    text: "What do you call a $100 bill? 'Billi Bills'"
  },
  {
    id: "ai793",
    text: "This is the story of how I learned to love the weather."
  },
  {
    id: "ai794",
    text: "It's been a while since news tickers have been around as much as they are now, but that doesn't necessarily mean they're bad."
  },
  {
    id: "ai795",
    text: "Is this game just about getting more antimatter?"
  },
  {
    id: "ai796",
    text: "The third annual Adirondack Mountaineering Festival will be held this year on Saturday, October 1st from 1-5pm at the Albany Highlands in nearby Troy, New York. The 50,000 person capacity outdoor amphitheater will feature over 2,000 speakers, a stage and a 360 degree camera system. Tickets are $35 and can be purchased at angersalley.com."
  },
  {
    id: "ai797",
    text: "The whole bottom half of the universe is just a giant antimatter hole."
  },
  {
    id: "ai798",
    text: "A new prestige layer has been announced: Emojis!"
  },
  {
    id: "ai799",
    text: "Travis is currently attempting to understand how to make hevi immortal by feeding him antimatter."
  },
  {
    id: "ai800",
    text: "The slowmode is activated when the slowmode is activated."
  },
  {
    id: "ai801",
    text: "A new era of Warcraft has come to a close. A new epic has begun. A new avatar has risen from the depths of Tyria, and the Worm Cult has been dealt a cruel but necessary wound. The world is rejoicing."
  },
  {
    id: "ai802",
    text: "A crowd-sourced list of the top ten memes"
  },
  {
    id: "ai803",
    text: "You have to go deeper than the news ticker to find the secret achievements."
  },
  {
    id: "ai804",
    text: "We should be able to make a replicanti-like structure out of antimatter, but we can't because it would blow up the entire universe",
    get unlocked() { return PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "ai805",
    text: "THe last update, while short, was kinda long. I mean, it was only 5 hours. Hevipelle said it would last for 5 hours, but that was only a few seconds ago. There was a big explosion in the 8th Dimension, and there was no one left to explain how it happened. All we know is that it exploded when Hevipelle touched it, and there was a big crater in the ground. That crater is still there."
  },
  {
    id: "ai806",
    text: "Cream cheese is the best kind of cheese. It melts in your mouth and tastes like nothing else. And it's totally free. You might even find that some of the recipes make more than one cheese."
  },
  {
    id: "ai807",
    text: "Here's a question that may surprise you: Were the people of EARTH made of antimatter, or were they made from some other mysterious material?"
  },
  {
    id: "ai808",
    text: "The real reason no one has made a joke about why there is no 9th dimension is because the 9th dimension isn't even the most ridiculous of memes. It's the 9th dimension in a nutshell."
  },
  {
    id: "ai809",
    text: "The number of dimensions is endless, but the number of ways to get there is infinities. Infinities are awesome and I would highly recommend you start with infinities, but I wouldn't recommend starting with infinities. Infinities seem pretty slow and not very fun so I wouldn't recommend starting with infinities."
  },
  {
    id: "ai810",
    text: "A report by the Pacific Northwest Toxics Institute has found that the consumption of fish concentrates in the liver, lungs, kidneys and brain. The study also found that the consumption of liver and kidney concentrates the most, followed closely by the brain. The report stated that \"The brain is the place where all the wisdom and all the knowledge exists.\" The study also stated that \"Liver is the living embodiment of all that we know and all that we don't.\""
  },
  {
    id: "ai811",
    text: "The old adage \"Be wary of what you wish for\" is certainly true. But what if you were the one wishing for this? It's possible that you were the one who made the wish for this, and you gained the power of the Antimatter. In that case, you are the one responsible for causing all the Antimatter to be turned into anti-matter. However, if you are the one doing the turning, you would be the one who would lose the power."
  },
  {
    id: "ai812",
    text: "Took you long enough"
  },
  {
    id: "ai813",
    text: "No, you see, the universe doesn't revolve around the earth. It's in a constant state of change, with the largest fluctuations occurring at the extremes of the observable universe. These fluctuations are what create the observable universe, with smaller fluctuations creating the observable universe and so on up until you get to the present state of affairs, which is what you are in."
  },
  {
    id: "ai814",
    text: "The biggest difference between the past and the future, is the difference between faith and reason."
  },
  {
    id: "ai815",
    text: "Hevi, you have to go."
  },
  {
    id: "ai816",
    text: "The challenge of finding the ninth dimension has been solved. The universe is now your personal hell."
  },
  {
    id: "ai817",
    text: "\"That's not how you're supposed to play the game\" - Mee6"
  },
  {
    id: "ai818",
    text: "It's Saturday, you're going to celebrate by making some really great music videos, maybe even a hit song. Then, you're going to take a walk along the beach. You'll see a huge wave, and you'll both be washed up. Your friends are waiting for you. \"Oh you want to go, take a look around!\", but don't actually go look around, you're too close to the action."
  },
  {
    id: "ai819",
    text: "Hevi has the best newsticker! GIVE HIM THE CRUNCH"
  },
  {
    id: "ai820",
    text: "By now you've seen a ton of news tickers, and you've probably seen the big news: The news ticker has been banned in this server."
  },
  {
    id: "ai821",
    text: "For example, if A is the square root of 3, then B is the square root of 2, therefore C is the square root of -2, therefore D is the cube root of -2, therefore E is the square root of 3, therefore F is the square root of 3, therefore G is the square root of 3, therefore and so on."
  },
  {
    id: "ai822",
    text: "Positrons are those tiny, round, highly charged particles that are found in the nucleus of most living organisms. They are used to detect light, and are sometimes used to measure the distance between people and the moon."
  },
  {
    id: "ai823",
    text: "There's only 4 types of people in this world: those who make games, those who make news, and those who make news again."
  },
  {
    id: "ai824",
    text: "If you have any questions or concerns regarding the game, please don't hesitate to ask. We are here to help."
  },
  {
    id: "ai825",
    text: "You must obtain a certain amount of antimatter in order to complete this challenge."
  },
  {
    id: "ai826",
    text: "The number of dimensions is nothing. It's just the number of dimensions. But what if you transformed every number into a letter? That would be a lot of letters?"
  },
  {
    id: "ai827",
    text: "The following is an extract from my upcoming book, More Than Just 5: Building a Better You. It's 200 pages long, and it's on Amazon for $22.99. Click here to buy it now."
  },
  {
    id: "ai828",
    text: "SOME people are claiming they saw a UFO in the sky. Others say they saw a spaceship. Still others claim to have been abducted by the government and flown to some undisclosed location."
  },
  {
    id: "ai829",
    text: "The second half of the game is basically just long, long stretches of nothing where nothing happens. There's also a third challenge that you have to complete at some point in the game where you basically just skip a few seconds of nothing happening until the seconds are too late and you have to complete another challenge to get them."
  },
  {
    id: "ai830",
    text: "This is a news ticker, so if you tap this you're indicating that you wish to have your news ticker speed increased."
  },
  {
    id: "ai831",
    text: "The following is based on my personal experience with the game \"Antimatter Dimensions\" and may not be 100% true."
  },
  {
    id: "ai832",
    text: "This is the third part of the two part series on the pros and cons of body positivity."
  },
  {
    id: "ai833",
    text: "The phrases \"Hevi dies in the 9th Dimension\" and \"I'll never let you down\" are two of the most important phrases in the game."
  },
  {
    id: "ai834",
    text: "It's been proven that not drinking water increases your risk of dying from antimatter annihilation."
  },
  {
    id: "ai835",
    text: "I'm a time traveler. I'm supposed to be going back in time to change history. But since I'm the one who's supposed to do it, I don't know what I should do. My present timeline doesn't include time that's supposed to be gone."
  },
  {
    id: "ai836",
    text: "A conference on artificial intelligence and human enhancement has been cancelled after someone announced that the talk was on how to turn a profit off of illegal downloads of the game \"Antimatter Dimensions\"."
  },
  {
    id: "ai837",
    text: "When you're done playing, take your save with you and go to main menu. You can do that by tapping the big scary \"X\" button, or by going into options and changing \"Reset the game for new save\" to \"Reset the game for old save\"."
  },
  {
    id: "ai838",
    text: "The most popular game on the App Store, Flappy Bird, has been secretly rewritten in C# to avoid detection."
  },
  {
    id: "ai839",
    text: "About this mod Replaces the full version of the game with a longer intro, random news tickers and a companion voiced by the voice actor from the Harry Potter movies."
  },
  {
    id: "ai840",
    text: "kajfik is a master welder and will soon have his own news"
  },
  {
    id: "ai841",
    text: "I am the most hated man on the planet! I have the power to change the course of history, and I will use it to my advantage. The people who died trying to stop me, and their sacrifice will forever be remembered in infinities of infinities. But if you oppose me, you will die along with you. You can either accept defeat and move on, or you can rise up through the ranks, become a legend, and become the most hated man in the history."
  },
  {
    id: "ai842",
    text: "Antimatter is like a young woman. She is looking for a man, and he runs into the woods. She dies of exposure soon after. His remains are found several miles away. Some say the universe was blown apart, others say he was swallowed by the universe, but the matter people know him!"
  },
  {
    id: "ai843",
    text: "I think I might have gotten the password for the 9th dimension, if only I hadn't deleted it."
  },
  {
    id: "ai844",
    text: "A group of people that worships Atreides have started a new faith, claiming to be a \"religion of tolerance\". Their website claims that it is \"a religion of inclusion\" and that it promotes tolerance and diversity. All of its members seem to be Christians, although they never mentioned them by name."
  },
  {
    id: "ai845",
    text: "A new cryptocurrency, called ΔX, has been found. It has the potential to change everything about how we live our lives, and the world. However, it has one major flaw: it has a flaw for the people."
  },
  {
    id: "ai846",
    text: "With the release of the new Android Pay app, the world will finally come to a close."
  },
  {
    id: "ai847",
    text: "I'm not sure if it's just me but when you type something long enough it sounds like a helicopter"
  },
  {
    id: "ai848",
    text: "If someone were to add the word \"infinity\" to the end of every sentence in the English version of the game, it would become \"Infinity Challenge: Infinity Edition\"."
  },
  {
    id: "ai849",
    text: "Are you ready for some bad news?"
  },
  {
    id: "ai850",
    text: "I don't know if you've heard this but it's true: You can walk into a bar and get the same beer twice in a row, and get the same amount of alcohol."
  },
  {
    id: "ai851",
    text: "This is the magic sauce that marinades foods and turns them into something delicious. It is used in a wide variety of recipes, and can also be made by mixing together regular mustard and water. The sauce can be a little bit spicy, but it is well worth the risk. It is also very nutritious, providing lots of potassium, magnesium, and vitamin D3."
  },
  {
    id: "ai852",
    text: "IMPORTANT NEWS: We have just been informed by the manufacturer of this news-ticker, and as a result, all of our future news-tickers will now also be made from scratch!"
  },
  {
    id: "ai853",
    text: "The second half of the year is upon us, and with it comes a new craze. People are trying new things, experimenting with new products, and creating new things of themselves. One such craze has swept across the land. The people of this land have embraced this craze, and have created a new religion, one that worships the god of this land, Inigo Montoya."
  },
  {
    id: "ai854",
    text: "The official website for the upcoming game, Antimatter Dimensions 2: it's like antimatter dimensions, but with a dash of Discord and a dash of Adele."
  },
  {
    id: "ai855",
    get text() { return `Is the Big Crunch the end of the world? No, it's the beginning of a new era. The era will last for ${format(Number.MAX_VALUE, 2)} days.`; }
  },
  {
    id: "ai856",
    text: "The only 'right' way to play a game is to not play at all, right? That's what anti-jokes are all about. — Anti-joker"
  },
  {
    id: "ai857",
    text: "The Bulletin of the Atomic Scientists has just announced the existence of a second class of particles, which are named after the characters from Ghostbusters."
  },
  {
    id: "ai858",
    text: "We are currently in the process of turning the planet into a Comfort Zone for the people. It will be complete in 10 hours."
  },
  {
    id: "ai859",
    text: "I'm gonna leave my milk here for a couple seconds. ♥"
  },
  {
    id: "ai860",
    text: "And then there was Jesus, and Hevi, and Hevi was with Him; and the sea gave up its monthly cycle, and it was a great gale. And Hevi and Jesus went up into heaven; and Hevi was filled with the Holy Spirit. And Hevi was clothed with angels, and was numbered with them. And Hevi was taken up into heaven, and glorified and was exalted, and was numbered with them, and was called Wonderful; and His angels rejoiced."
  },
  {
    id: "ai861",
    text: "You will probably spend most of your day reading news ticker suggestions here."
  },
  {
    id: "ai862",
    text: "The Fremen race of animals are a race of people who live in harmony with the earth, and thus are quite different from the other races of animals. Their society is based around hunting and gathering, and they are also highly spiritual people. They have many beliefs and practices that are in direct contrast to most other races of animals, such as eating meat and using stone tools. They also seem to be quite superstitious, as evidenced by the fact that they are known to perform…"
  },
  {
    id: "ai863",
    text: "What if… the universe was just a ruse to keep the people in line? …actually, no, it was actually intended, the universe was designed to keep the people in line. The problem was the people couldn't handle the idea of an outside force manipulating their lives, and ended up breaking out into uncontrolled chaos, eventually leading to thermonuclear annihilation."
  },
  {
    id: "ai864",
    text: "If you're reading this, you probably shouldn't have. If you aren't, then you probably should."
  },
  {
    id: "ai865",
    text: "I'm a time traveler. I can tell you the history of the world. But, I can't tell you the future. That's why I'm here, to tell you the future. The future is an ever- expanding pile of past, present, and future, and it'll never stop growing. There's so much history, so little time. There's so much history, but it won't stop growing. Then, there's this, and then there's that, and then…"
  },
  {
    id: "ai866",
    text: "A new, improved and more secure version of Antimatter Dimensions is now available: Antimatter Dimensions 2."
  },
  {
    id: "ai867",
    text: "In the beginning, there was nothing. Then the great Hevi made the game, and there was nothing to play with it."
  },
  {
    id: "ai868",
    text: "Would you recommend Antimatter Dimensions to a friend? Yes"
  },
  {
    id: "ai869",
    text: "\"We have 3 kinds of news: warnings, nudges and shade jokes."
  },
  {
    id: "ai870",
    text: "I love you bro!"
  },
  {
    id: "ai871",
    text: "I'm going to keep this short, because I don't have a much to say."
  },
  {
    id: "ai872",
    text: "A large number of anti-kafawis are taking part in the Antimatter Goodies competition. Here's how you can win: 1. Make a suggestion 2. Give away the beta key 3. Tell me what you think about the game 4. Don't put it in the game yet (it's already there, you can't delete it) 5. Don't put it in the game yet (it's already in the game) 6. Don't put it in the game"
  },
  {
    id: "ai873",
    text: "THe recipe for Crispy Shrimp is one of the most unique and favorite of all time! Crispy shrimp are known to be one of the best in all of food! This recipe is a must try in your favorite Italian restaurant!"
  },
  {
    id: "ai874",
    text: "After you have made 1 antimatter, go to the menu and press reset."
  },
  {
    id: "ai875",
    text: "I think you know where this is going."
  },
  {
    id: "ai876",
    text: "The catch? You have to be online for less than 5 hours to claim your reward."
  },
  {
    id: "ai877",
    text: "Tetris was made by Hevi"
  },
  {
    id: "ai878",
    text: "What if instead of making antimatter, we're actually removing it?"
  },
  {
    id: "ai879",
    text: "The new instalment in the long running series, Antimatter Dimensions - Exotic Matter Dimensions. Experience the most bizarre and wonderful worlds of Antimatter Dimensions with your Friends, or conquer the world in a single galaxy with hundreds of rivals in a single galaxy, all in under an hour."
  },
  {
    id: "ai880",
    text: "I hope you're ready for the big news, because that's the big news. The antimatter is spilling all over the place, and it's blowing up the neighborhood."
  },
  {
    id: "ai881",
    text: "You must get 33,333,333 IP to see this message",
    get unlocked() { return Currency.infinityPoints.gte(33333333); }
  },
  {
    id: "ai882",
    text: "You might think these are jokes, but trust us, you'll be shocked how much you'll love them after you read them!"
  },
  {
    id: "ai883",
    text: "The God-Emperor himself, Hevi, the creator of balance, has a super secret achievement. It is to go flip your superflat apprenticed flatmate!"
  },
  {
    id: "ai884",
    text: "Sonic was born without a heart… but that didn't stop him from being a genius"
  },
  {
    id: "ai885",
    text: "The most common question I get is \"can i just skip the ads and get true\" and the answer is always a resounding NO. The reason being, ad revenue is just too damn high to overcome the cost of maintaining the servers, plus the fact that most players just don't care."
  },
  {
    id: "ai886",
    text: "You haven't unlocked the ninth dimension yet? Just hold M and DROP."
  },
  {
    id: "ai887",
    text: "The Great Matter War was a close one. The matter victory was short lived, the antimatter victory was not. The matter people saw too much, the antimatter people too weak, and the war was won."
  },
  {
    id: "ai888",
    text: "Turing-complete game about providing the update"
  },
  {
    id: "ai889",
    text: "New research suggests that the more antimatter we make, the more matter we'll have"
  },
  {
    id: "ai890",
    text: "What is the meaning of life?"
  },
  {
    id: "ai891",
    text: "You have enough antimatter to craft a new prestige layer! Prestige Layers are great."
  },
  {
    id: "ai892",
    text: "The beta testers for Antimatter Dimensions 2 are the most loyal, most dedicated, and most implacable group of people I've ever met. They're also possibly the laziest, most self-indulgent bunch of people I've ever met."
  },
  {
    id: "ai893",
    text: "Shocking new study reveals that the more time you spend on the internet, the more likely you are to get starstruck."
  },
  {
    id: "ai894",
    text: "When you are done playing, and wish to play again, you should start a new game."
  },
  {
    id: "ai895",
    text: "I don't know about you, but I don't buy paperclips."
  },
  {
    id: "ai896",
    text: "Hevipelle uses replicanti to speed up game speed.",
    get unlocked() { return PlayerProgress.replicantiUnlocked(); }
  },
  {
    id: "ai897",
    text: "So let's say you're making a game. You're making a singleton. You're making a game that's gonna be played offline. What happens when you play it? It crashes. What happens when you play it? It crashes more. What happens when you play it? You lose your save."
  },
  {
    id: "ai898",
    text: "This is what happens when you OVER-RELY on your \"fake it til you make it\" attitude."
  },
  {
    id: "ai899",
    text: "This is the fifth part of a two-part series looking at how science and magic are linked. Part one will be published on 5 October, part two will be published on 24 October, and you can follow the journey at part three."
  },
  {
    id: "ai900",
    text: "What is 5 hours? A giggle"
  },
  {
    id: "ai901",
    text: "A new beta test is now available for Antimatter Dimensions, coming in 5 hours. There are no refunds for this test, so please be patient as we try to finalise the test and get it ready for the public. The test will take place in -5 hours in the Antimatter Dimensions Discord."
  },
  {
    id: "ai902",
    text: "The Night is coming, and in its wake a terrible thing has been unleashed: ruin. Chaos. And decay. And death. And chaos is coming for all of us."
  },
  {
    id: "ai903",
    text: "This article is a stub. You can help Deskthority by expanding it."
  },
  {
    id: "ai904",
    text: "A new, safer way to store and retrieve your data has been found! When you get to the AE, click on the big red button and the world will stop rotating!"
  },
  {
    id: "ai905",
    text: "Ooh, what's this noise? A crash of some sort? More like, a crash of some greater magnitude? I don't know. Whatever it is, it's probably not being caused by me. I shouldn't be putting it through, it's just… well, you see, I was going to put it through, but then I just thought it might be a good idea to just put it through. Oh, it's gonna be a good one, I promise."
  },
  {
    id: "ai906",
    text: "Last week, we reported that an unknown individual known only as \"Anti-Doctor\" has broken the game and claimed ownership of the game's data. Since then, he has spread the word that he has an \"explosive new app\" that will allow him to \"turn [he] antimatter.\" However, no one has come forward with information on how to use the app, or even if it is a reality. We will update this article if and when we find out."
  },
  {
    id: "ai907",
    text: "The second thing I'm gonna do is go talk to the Devs in person. I don't know if I'll be able to do that without pissing someone off, so I'm gonna do it right here."
  },
  {
    id: "ai908",
    text: "The great majority of people don't get the full benefit of antimatter dimensions, and as such are not affected by it. However, there are certain people who are affected and at certain times of the day, depending on their mood and how much antimatter they have, they will manifest a dimensional shift, going from being idle to being actively involved in news ticker suggestions. This shift is due to the antimatter in their body emitting a certain wavelength, called \"red-shifted\"."
  },
  {
    id: "ai909",
    text: "By now we all know the drill. You get a new prestige layer just by spending eternity with someone."
  },
  {
    id: "ai910",
    text: "The real reason that the 9th dimension exists is to keep us all imprisoned in a virtual reality simulation."
  },
  {
    id: "ai911",
    text: "Your PC is infected with a weird, floating virus that's trying to steal all your antimatter. There's no cure, so get offline now!"
  },
  {
    id: "ai912",
    text: "The year is 5303. Hevipelle, the creator of Antimatter Dimensions, has touched the ninth dimension."
  },
  {
    id: "ai913",
    text: "The phrase \"Hevipelle hates me\" is pretty funny."
  },
  {
    id: "ai914",
    text: "The government shutdown has come and gone, the nation is still in a recession, and the Federal Reserve is still reading zero-hour contracts. The only thing that's getting better is your relationship with antimatter, obviously. It's been proven that knowing someone with an antimatter will bring you closer to extinction than any other kind of friend you can have."
  },
  {
    id: "ai915",
    text: "IMPORTANT NEWS: The developer Hevipelle has announced that Antimatter Dimensions: the game is now 100% free!"
  },
  {
    id: "ai916",
    text: "Someday, we shall come upon the day when a man will sit on the head of a dragon and call it a \"Dragonball\". Such a man would then go and perform the Dragon Ball Z: Battle Royale in which he would use Dragon Ball Z: Fusion to create a gigantic dragon that would then consume the universe in the process, thus creating a \"Big Bang\". Such a man would then be rewarded by being \"built again\" and sent back to the \"Heavens\"."
  },
  {
    id: "ai917",
    text: "\"I think that the greatest achievement a man can make in his life is to say that he has read every single news ticker suggestion and nothing happened.\" - Kajfik"
  },
  {
    id: "ai918",
    text: "Titanfall 2 is now in closed beta. The beta is only for people who are willing to give up some personal information, such as email addresses. If you're in the beta and would like to leave, you can do so at any time by going to the Help tab and changing your beta settings to public."
  },
  {
    id: "ai919",
    text: "Personally I like to get a 4 or 5 star rating, it gives you an idea of how great your suggestion is and also shows me how much you care about the game. If you want I can also do a 6 star rating, which is fine with me. I don't care if people like it or not, I work for APG and I get paid to make money."
  },
  {
    id: "ai920",
    text: "The real reason no one talks about 9 is because it's not a big secret"
  },
  {
    id: "ai921",
    text: "The only difference between a man and a woman is their attitude towards petting animals."
  },
  {
    id: "ai922",
    text: "A number of recent television documentaries have featured the story of a dog named Louie. He was accidentally made a member of the public after his owner left the house. One day he decided to play 'Let's Play Let's Play' with his owner. He was immediately put to sleep."
  },
  {
    id: "ai923",
    text: "The entire history of the world, every single idea, every single failure, every single downfall, every single achievement has been covered in one fell swoop."
  },
  {
    id: "ai924",
    text: "This sentence contains two paradoxes."
  },
  {
    id: "ai925",
    get text() { return `The time has come to reveal the next expansion for Antimatter Dimensions: the ${format(Number.MAX_VALUE, 2)}th Dimension. It will be released in -5 hours, it costs ${format(Number.MAX_VALUE, 2)} human souls as of now, and it has nothing to do with matter or antimatter.`; }
  },
  {
    id: "ai926",
    text: "I wonder what the fuss is about with the 4th dimension? Well, if you have 4 of them, and you multiply them by 0, then you get to the magical number of 4. That's why the 4th dimension exists. But what if there were 5? Well, the 5th dimension could replace the 4th dimension, so why not have a 5th dimension? Well, that's what the 6th, the 7th, and the 8th dimension are."
  },
  {
    id: "ai927",
    text: "You are using the wrong version! The reality update is already out! Press Ctrl+Shift+Alt+Del to unlock the 9th Dimension!"
  },
  {
    id: "ai928",
    text: "A man claims that he's been in a coma for 20 years now, and that he can't move his fingers. He was brought to the hospital with a compression fracture of his back, and since then he's been receiving medical help. He's since recovered, and now requires no medical attention. We still don't know where he's going with this, but we hope he finds some comfort in knowing that he'll never wake up."
  },
  {
    id: "ai929",
    text: "To move from left to right, turn right."
  },
  {
    id: "ai930",
    text: "Then we have the matter dimensions. From what I can gather, they are made of antimatter. There is some debate about whether or not there are any dimensions left over that are made out of matter, but that is not the main question. The real question is \"why do they exist, and how does antimatter affect them?\""
  },
  {
    id: "ai931",
    text: "A new breed of mad scientist is believed to be creating antimatter at an alarming rate."
  },
  {
    id: "ai932",
    text: "A new kind of justice has been discovered: mass deception. It works by tricking the player into thinking that he/she has done something wrong, when in fact he/she has just done something perfectly normal, i.e. going about his/her daily life normally, without thinking about it."
  },
  {
    id: "ai933",
    text: "Dedicated to the great and wonderful man behind the curtain, the great and wonderful name rick roll. RIP, good man. May you rest in peace."
  },
  {
    id: "ai934",
    text: "For the last time, Antimatter Dimensions isn't a Clicker game."
  },
  {
    id: "ai935",
    text: "The number of dimensions is infinite, but the quality of your dimensions is limited. This is why we only produce the highest quality antimatter, and what makes us different from other factories."
  },
  {
    id: "ai936",
    text: "I've heard of prestige layers before but never sure what to do with them."
  },
  {
    id: "ai937",
    text: "A man walks into a bar. The bartender tells him to stay the heck out. The man continues walking."
  },
  {
    id: "ai938",
    text: "The oldest and maybe the most famous game in all of AD, that certainly will be remembered long after you retire, is AD. Ever heard of someone winning the game with more than 2 1's? I have. Ever heard of someone losing it? I have. Ever heard of a 9th dimension existing in AD? I have never."
  },
  {
    id: "ai939",
    text: "Greetings, I am the first step of the step ladder."
  },
  {
    id: "ai940",
    get text() { return `It's the year ${format(Number.MAX_VALUE, 2)}, Hevi is still trying to figure out how to fix the update.`; }
  },
  {
    id: "ai941",
    text: "What if you could stretch your legs and not lose them forever?"
  },
  {
    id: "ai942",
    text: "T he most important thing to realize is that you don't have to play the game to get the achievement. You can actually get it by just reading the achievement descriptions."
  },
  {
    id: "ai943",
    text: "A new bank has been set up to provide safe haven for cryptocurrencies."
  },
  {
    id: "ai944",
    text: "Google+ is known to be a hit with teens, and today, they got their very own virtual reality (VR) version of Animal Farm, the classic 1950's farm story. The game is a blend of adventure, strategy and music, and was made by a small team of people with an eye towards engaging young people. The game offers an alternative to most other VR games, and is suitable for anyone who is not comfortable with large, complicated, graphics and sounds. The game features over 50 different…"
  },
  {
    id: "ai945",
    text: "This game could be called anything. You could call it whatever you like. But you'd be wrong. It's mine."
  },
  {
    id: "ai946",
    text: "Where does all the antimatter come from?"
  },
  {
    id: "ai947",
    text: "The Tickspeed Challenge is a team based game where you have to time-travel to the Andromeda galaxy to reach the 9th Dimension, the 1st Dimension being the shortest distance to the 9th Dimension. There is no perk for reaching the 9th Dimension, you just have to time-travel to the Andromeda galaxy to reach the 9th Dimension, and you'll be granted with a secret achievement for achieving instant [REDACTED] with no time-travelling."
  },
  {
    id: "ai948",
    text: "This is the question that has been bothering me for so long. What is Antimatter? Is Antimatter an Antimatter? What does it mean when you say \"Antimatter\"? These are the kinds of questions that plague the Antimatter Dimensions…"
  },
  {
    id: "ai949",
    text: "The term 'Antimatter Dimensions' is a play on words that literally means 'Antimatter Dimensions' in the dictionary."
  },
  {
    id: "ai950",
    text: "I can suspend the laws of physics because I'm a genius and my universe is so big that I can literally suspend the laws of physics and create a universe that's twice as big as the current one and with twice the mass, i'm sure you can imagine how big that would be."
  },
  {
    id: "ai951",
    text: "When you are fighting a losing war, you make peace with the Powers That Be. You give up the ghost, and move on to the next challenge."
  },
  {
    id: "ai952",
    text: "Somewhere, in another galaxy, a superintelligence is trying to figure out how to get around the limitations of what a 2-dimensional vector space is. It's probably working on a 3-dimensional space."
  },
  {
    id: "ai953",
    text: "The antagonist of the last few minutes is the mysterious, antimatter-covered being known only as \"The Man in Black.\" He was last seen running towards a news broadcast, seemingly lost, until he made it back to the news station and was interviewed about his experience. His story is told in the bottom right corner of the screen."
  },
  {
    id: "ai954",
    text: "You have unlocked the 4th storyline."
  },
  {
    id: "ai955",
    text: "While you were busy farming that pesky \"real\" number, I was busy writing that news ticker."
  },
  {
    id: "ai956",
    text: "A new power has arisen: the antimatter."
  },
  {
    id: "ai957",
    text: "The day has come. The antimatter is falling from the sky, and the streets are silent."
  },
  {
    id: "ai958",
    text: "The most important thing is to understand that you are playing a simulation. You can win or lose, but you can't get anything from it other than a little itch on your neck."
  },
  {
    id: "ai959",
    text: "The anti-snowman is a very special snowman. He's very timid, but has a very powerful wish to be picked up by a helicopter. The government doesn't want this to happen, so they lock him up in a special building and fly him over great distances. Finally, they drop him on the ground and begin to pick him up. The government didn't use force to pick him up, instead they invited the entire community in and started picking them up. The community refused."
  },
  {
    id: "ai960",
    text: "I'm surprised you didn't say \"Not my cup of anti-tea.\""
  },
  {
    id: "ai961",
    text: "I see you are a man of culture as well. I wonder what it is that draws you to speak in such an ungainly, tortured voice? What attracts you to speak in a language no one can understand? I hear your fans rave about your videos, but what draws you to this place? I feel like I know you. You are… you are a man of mystery. One that intrigues me…"
  },
  {
    id: "ai962",
    text: "Note: this is a private message. Do not send it in public."
  },
  {
    id: "ai963",
    text: "When you reach Infinity you unlock a new dimension: Pandemonium Dimensions. Go to the news ticker for more information."
  },
  {
    id: "ai964",
    get text() { return `Although the majority of players would say that the 9th dimension is not a thing, a handful of people would go and level it up in the most epic way imaginable. These people would use the power of the 9th dimension and achieve, like, ${format(Number.MAX_VALUE, 2)} EP with it. No? Well, they are the exceptions to the rule.`; },
    get unlocked() { return PlayerProgress.eternityUnlocked(); }
  },
  {
    id: "ai965",
    text: "The story of the \"perish the thought of dying\" movement has been told before, but never quite accurately. The movement was originally organized by antievolutionists to stop the exponential growth of scientific notation, but soon spread to oppose any form of \"progress\". In its early days the movement was led by an enigmatic individual known only as \"The Great Hevipelle\". Their philosophy was simple: expand the possibilities of what is possible, and push the limits of what is tolerable."
  },
  {
    id: "ai966",
    text: "This is the story of how the world ended. Earth was once a lush and green world. Then, some guy from outer space touched it and started growing mushrooms. He called himself Hevi. Some say Hevi was never satisfied. Some say he exploded. All we know is that Hevi is still out there expanding his reach, and we are stuck here in the void of space."
  },
  {
    id: "ai967",
    text: "Antimatter Dimensions, the only place where you can trade real estate for virtual reality"
  },
  {
    id: "ai968",
    text: "This page contains spoilers for Antimatter Dimensions, you've been warned."
  },
  {
    id: "ai969",
    text: "The best thing about being a news ticker is being able to slip into the news without anyone noticing."
  },
  {
    id: "ai970",
    text: "This paperclip maximizer is a great idea. It's probably best not to let it run its course though, since it's quite possibly the most amazing thing you've ever seen. If you've somehow survived the first phase of the paperclip dimension, you're probably wondering what it's doing in your home. Fortunately, it's super simple to fix. Just go to options, and change \"Max all\" to \"Always max all\"."
  },
  {
    id: "ai971",
    text: "A powerful wizard chose to channel negative energy into antimatter, and now the antimatter is spilling out into the world."
  },
  {
    id: "ai972",
    text: "A new age of ultra low-cost, ultra-fast trains has been announced by Elon Musk. Users will be able to travel from A to Z in a mere 186ms."
  },
  {
    id: "ai973",
    text: "A group of researchers at the University of Manchester have created a 3D printer that can create any object out of thin air, including a 3D-printed replica of the Virgin Mary."
  },
  {
    id: "ai974",
    text: "Alright, here's a new game called Antimatter Dimensions, it's like Matter Dimensions except with less stuff and more fun. It's available on Android, iOS, and web. The game is very simple: you take the 6 dimensions and the antimatter, and in the 6 dimensions you take the matter and in the matter you take the antimatter, and you play the game the same way you would any other game."
  },
  {
    id: "ai975",
    text: "What arbitrary, subjective, meaningless number comes out of your mouth like a mercury thermometer? 1.79"
  },
  {
    id: "ai976",
    text: "\"Word on the street is that the word \"bank\" is an anagram of \"bank\" - that makes sense but i'm not there yet\" - Slabdrill"
  },
  {
    id: "ai977",
    text: "The 9th dimension rose up like a volcano and began raining destruction on the empty 10th dimension. The smoke and debris from the exploding 9th dimension covered the entire 9th dimension. All that is left is a smoldering crater and the remains of the 9th dimension."
  },
  {
    id: "ai978",
    text: "Help! How do I get the dots moving in my head coordinator?"
  },
  {
    id: "ai979",
    text: "Hi, could you please not disable the news ticker? Thank me later."
  },
  {
    id: "ai980",
    text: "If you are suffering from low antimatter production, then worry not, friend! Our highly scientific antimatter government has recently reached the ninth dimension and will soon begin giving us the Anti-Hats as a sign of respect!"
  },
  {
    id: "ai981",
    text: "You click the bottom left corner of the screen and a green tingle goes up your leg. It's a treat you get from scratching antimatter."
  },
  {
    id: "ai982",
    text: "A quick note to those of you who buy into the Analytics subscription: we get a small percentage of your antimatter sales, but you do pay a small amount of money to support the research of the news ticker. It's a small price to pay for the convenience of browsing antimatter dimensions."
  },
  {
    id: "ai983",
    text: "Why haven't we caused the antimatter stock market to crash yet?"
  },
  {
    id: "ai984",
    text: "Even after the Heavenly Pelle put a large amount of antimatter in the pool, it hasn't produced anything. The scientist who discovered the vulnerability was last seen climbing a tree in a group of 10, with a small notebook on his lap, drinking cheese juice and watching Nothing."
  },
  {
    id: "ai985",
    text: "One-two-three, boo-two-three, three-four-five, anti-four-five, two-three-eight, nine-fifteen, five-six-seven, eight-nine-ten, nine-ten-ten, seven-seventy-eight… All has been going fine until last night, when four of the eight neighbors start complaining about a strange glow. A odd hum runs through the neighborhood, almost like a radio static. It gets more and more intense as you drive by, until it's practically pitch black. You try to explain it to the neighbors, but they won't listen. The neighborhood is unsafe, everyone knows that. You analyze it further, everyone thinks it's just some astrophysicist's idea. Then, s---. It's explodium. There's antimatter everywhere, and it's getting worse all the time. It turns out, there's about 1e31 Planck volumes in the entire observable universe. And that's just the antimatter we're talking about. There's also dark matter, normal matter, and extra matter. You know, the kind you create with your imagination."
  },
  {
    id: "ai986",
    text: "If you ever feel like making an antijoke, just remember that it could be pretty good."
  },
  {
    id: "ai987",
    text: "You won't convince anyone to go to heaven, but you might get close."
  },
  {
    id: "ai988",
    text: "BREAKING NEWS: Hevipelle, the creator of the 9th dimension, has just announced that beta will be out in 5 hours!"
  },
  {
    id: "ai989",
    text: "The Force is with you."
  },
  {
    id: "ai990",
    text: "What if Jesus was an anti-matter ghost?"
  },
  {
    id: "ai991",
    text: "In the summer of 711, the Great Calamity overtook Tyria. A great void was made, and Tyria was left to rot. The armies of the known world had given up, and the void was filled with darkness. Only the might of Kajfik remained, and he rose to become the greatest God in the known world. He is said to be the one who will face the Great Calamity alone, and destroy him."
  },
  {
    id: "ai992",
    text: "In recent news clashes, the warlocks have been gathering looters for raid boss. He loves his 5 hour looters and wants to show off his mighty weapon of choice, the 9th Dimension. As the two beasts battle, the 1st dimension holder needs to be careful as the first one might get the same as the 2nd one as well. Meanwhile, the raid ends its journey with a bang as the boss squanders the Explodium exploit by flooding the area with Explodium, which before his, was filled with Marsh Mice. Both are promptly annihilated by the boss' relentless claw attacks. It's a grueling job, but the raid stalwarts manage to grab the stalagm and push him across the opal Gondwan . With the boss dead and the warlocks not far behind, the warlocks try their hand at farming looters, but the grinding continues apace. Things are looking bleak for the warlocks, as the boss seeks to take advantage of the people's greed, and steal their weaponry, making them unable to use any remaining of their  weapons, which are made of highly-stable antimatter. The warlocks attempt to use the no fluke policy as a weapon to smite the people, but the people take to the streets, physically attacking and mentally draining the people of all mental capacity they had been holding onto. The people resort to violence, using the 9th dimension just like they use to hold people back, but the people have faith in God that he will merciful, He will bring about a kinder and gentler time where everyone can use the last drop of their power."
  },
  {
    id: "ai993",
    text: "What if you wanted to but I told you it would be too painful for you."
  },
  {
    id: "ai994",
    text: "how big of numbers do you have"
  },
  {
    id: "ai995",
    text: "Just want to thank the dev team for putting so much effort into Antimatter Dimensions and the Antimatter Dimensions 2"
  },
  {
    id: "ai996",
    text: "Hevipelle has broken the 9th wall! Get ready for everything to get pretty dark."
  },
  {
    id: "ai997",
    get text() { return `The intergalactic antimatter trade has been severely disrupted, trading entire galaxies for the occasional paperclip. Cargo stands are no longer used. Oddly enough, the entire dimension has become a dumping ground for discarded plastic and other useless garbage. It's almost as if the rest of the multiverse isn't producing enough good  antiparticles to feed the growing population. Unfortunately, the situation is forcing the entire multiverse to scramble to find ways to meet the growing needs of the antimatter-eating  dev, who claims to have over ${format(Number.MAX_VALUE, 2)} specimens left to collect.`; }
  }
];
